Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-code-and-documentation.po
Languages: de, id, ko_kr, zh_cn

source: When you ``git commit`` (without ``--amend``), you're creating a new commit on top of whatever commit you started at. If you started with a clean, freshly ``pull``\ed master branch, that'll be whatever the most recently merged commit in the master branch was. In this example, that's commit ``3d008a3``.
id: Ketika Anda ``git commit`` (without ``--amend``), Anda sedang membuat komit baru di atas komit apa pun yang Anda mulai. Jika Anda mulai dengan cabang master yang bersih dan baru ``pull``\ed, itu akan menjadi apa pun yang komit terakhir digabung di cabang master tadi. Dalam contoh ini, itu melakukan ``3d008a3``.
ko_kr: ``git commit`` (`` --admed`` 없이) ``git commit`` 을 할 때, 당신이 시작한 모든 commit에 새로운 commit을 만들어 내고 있는 것입니다. 만약 여러분이 새로 생긴 `` PULL`` 마스터 지점으로 시작한다면, 마스터 지사에서 가장 최근에 합병된 지점이 무엇이었든 간에 그렇게 될 것입니다. 이 예에서 그것은 ``3d008a3`` 을 범하는 것입니다.
zh_cn: 当您执行 ``git commit`` （不带 ``--amend`` 选项）时，您将在开始的任何提交之上创建一个新的提交。 如果您从一个干净的，新的 ``pull`` 出来的主分支开始，那将是主分支中最新合并的提交。 在此示例中，是提交 ``3d008a3`` 。

source: When you are working on implementing a new feature or adding documentation to an already existing one it is easy to get carried away by the work itself and forget about the unwritten rules of constructing your changes.
de: Wenn Sie an der Implementierung eines neuen Features arbeiten oder Dokumentation zu einem bereits bestehenden hinzufügen, ist es leicht, sich von der Arbeit selbst mitreißen zu lassen und die ungeschriebenen Regeln für die Erstellung Ihrer Änderungen zu vergessen.
id: Ketika Anda sedang berupaya mengimplementasikan fitur baru atau menambahkan dokumentasi ke yang sudah ada, mudah terbawa oleh karya itu sendiri dan melupakan aturan tidak tertulis dalam menyusun perubahan Anda.
ko_kr: 새로운 기능을 구현하거나 이미 존재하는 기능에 문서를 추가하는 작업을 할 때, 작업 자체에 휩쓸리거나 변경 사항 구성성의 불문율을 잊어 버리기 쉽습니다.
zh_cn: 当您在实现一项新功能或向现有功能添加文档时，很容易被这些任务本身所牵扯住，而忽略了构建变更的一些不成文规则。

source: When you encounter a failure that's not being tracked by elastic-recheck and you've looked through the logs to determine that it's not being caused by the proposed change and is affecting other changes you can propose a new elastic-recheck fingerprint.
de: Wenn Sie auf einen Fehler stoßen, der nicht durch elastic-recheck verfolgt wird, und Sie die Protokolle durchgesehen haben, um festzustellen, dass er nicht durch die vorgeschlagene Änderung verursacht wird und andere Änderungen beeinflusst, können Sie einen neuen elastic-recheck Fingerabdruck vorschlagen.
id: Ketika Anda menemukan kegagalan yang tidak dilacak oleh elastic-recheck dan Anda telah memeriksa log untuk menentukan bahwa itu tidak disebabkan oleh perubahan yang diajukan dan memengaruhi perubahan lain, Anda dapat mengusulkan fingerprint elastic-recheck baru.
ko_kr: Elastic-recheck에 의해 추적되지 않는 오류가 발생하고 로그를 검토하여 제안 된 변경으로 인한 것이 아니며 다른 변경에 영향을 미치는지 확인한 경우 새로운 elastic-recheck 지문을 제안 할 수 있습니다.

source: When you have a chain Gerrit helps you by listing all the commit titles in the 'Related Changes' column on the top right corner of the Gerrit UI. The titles are also links which help you navigate between the changes to review them when you upload a new version.
de: Wenn Sie eine Kette haben, hilft Ihnen Gerrit, indem es alle Commit-Titel in der Spalte'Related Changes' in der rechten oberen Ecke der Gerrit-Benutzeroberfläche auflistet. Die Titel sind auch Links, die Ihnen helfen, zwischen den Änderungen zu navigieren, um sie beim Hochladen einer neuen Version zu überprüfen.
id: Ketika Anda memiliki rantai, Gerrit membantu Anda dengan mendaftar semua judul komit di kolom 'Related Changes' di sudut kanan atas Gerrit UI. Judul itu juga tautan yang membantu Anda menavigasi di antara perubahan untuk meninjau mereka ketika Anda mengunggah versi baru.
ko_kr: 체인이 있는 경우 Gerrit은 Gerrit UI의 오른쪽 상단 모서리에 있는 '관련 변경 사항' 열에 모든 커밋 제목을 나열하면 도움이 됩니다. 제목은 새 버전을 업로드할 때 검토하기 위해 변경 사항 사이를 탐색하는 데 도움이 되는 링크입니다.
zh_cn: 当有一组补丁链后，Gerrit可以通过在Gerrit UI右上角的“相关联变更（Related Changes）”中列出所有提交标题来帮助您。 标题也是链接，可帮助您在更改之间导览，以在上载新版本时查看它们。

source: When you have changes in multiple project repositories you can mark dependent patches with the 'Depends-On' tag. The tag will appear as a link in the commit message which helps you and also the reviewers to track and navigate between the dependencies of your changes.
de: Wenn Sie Änderungen in mehreren Projekt-Repositories haben, können Sie abhängige Patches mit dem Tag'Depends-On' markieren. Der Tag wird als Link in der Commit-Nachricht angezeigt, der Ihnen und auch den Reviewern hilft, zwischen den Abhängigkeiten Ihrer Änderungen zu verfolgen und zu navigieren.
id: Ketika Anda memiliki perubahan dalam beberapa repositori proyek, Anda dapat menandai patch dependen dengan tag 'Depends-On'. Tag akan muncul sebagai tautan dalam pesan komit yang membantu Anda dan juga pengulas untuk melacak dan menavigasi antara dependensi perubahan Anda.
ko_kr: 여러 프로젝트 저장소에 변경 사항이 있는 경우 'Depends-On' 태그로 종속 패치를 표시 할 수 있습니다. 태그는 커밋 메시지에 링크로 표시되어 사용자와 검토자가 변경 사항의 종속성을 추적하고 탐색하는 데 도움이 됩니다.
zh_cn: 当您在多个项目仓库中进行更改时，可以使用'Depends-On'标签标记相关依赖的补丁。 该标记将作为链接显示在提交消息中，该链接可以帮助您以及审阅者在更改的依赖关系之间进行跟踪和导览。

source: When you submit a patch to gerrit and zuul returns the test results for the jobs it ran, sometimes one of those tests fails. Most of the time this indicates there is an issue with your proposed change and the tests are catching it. Sometimes the test run might have tripped over an underlying pre-existing bug in OpenStack. Additionally, some times the infrastructure for running the tests might have had a failure. To figure this out you'll always need to look at the logs from the failed job to understand what's happening.
de: Wenn Sie einen Patch an gerrit senden und zuul die Testergebnisse für die von ihm ausgeführten Jobs zurückgibt, schlägt manchmal einer dieser Tests fehl. Die meiste Zeit zeigt dies an, dass es ein Problem mit Ihrer vorgeschlagenen Änderung gibt und die Tests fangen es auf. Manchmal ist der Testlauf über einen zugrunde liegenden, bereits vorhandenen Fehler in OpenStack gestolpert. Darüber hinaus konnte es vorkommen, dass die Infrastruktur für die Durchführung der Tests manchmal ausgefallen ist. Um dies herauszufinden, müssen Sie sich immer die Protokolle des fehlgeschlagenen Auftrags ansehen, um zu verstehen, was passiert.
id: Ketika Anda mengirimkan patch ke gerrit dan zuul mengembalikan hasil tes untuk pekerjaan yang dijalankannya, terkadang salah satu dari tes itu gagal. Sebagian besar waktu ini menunjukkan ada masalah dengan perubahan yang Anda usulkan dan tes menangkapnya. Kadang-kadang uji coba mungkin telah tersandung bug yang sudah ada sebelumnya di OpenStack. Selain itu, beberapa kali infrastruktur untuk menjalankan tes mungkin mengalami kegagalan. Untuk mengetahuinya, Anda harus selalu melihat log dari pekerjaan yang gagal untuk memahami apa yang terjadi.
ko_kr: gerrit에 패치를 제출하고 zuul이 실행 한 작업에 대한 테스트 결과를 반환할 때, 때때로 이러한 테스트 중 하나가 실패하기도 합니다. 대부분의 경우 이는 제안된 변경 사항에 문제가 있으며 테스트에서 이를 포착하고 있음을 나타냅니다. 때때로 테스트 실행이 OpenStack의 기본 기존 버그로 인해 넘어졌을 수 있습니다. 또한 테스트를 실행하기 위한 인프라에 오류가 발생한 경우도 있습니다. 이를 파악하려면 실패한 작업의 로그를 항상 살펴보고 현재 상황을 파악해야 합니다.
zh_cn: 当您向gerrit提交补丁时，zuul返回其运行的测试结果，有时其中一项测试失败。 在大多数情况下，这表明您建议的更改存在问题，并且测试正在找出问题。 有时，测试运行可能会因OpenStack中潜在的预先存在的错误而跳闸。 此外，有时运行测试的基础设施可能会出现故障。 为了弄清楚这一点，您始终需要查看失败作业的日志以了解发生了什么。

source: When you upload changes in a chain only the patches that got updated will be uploaded. This also means that the review scores on lower patches in the chain will be untouched.
de: Wenn Sie Änderungen in einer Kette hochladen, werden nur die Patches hochgeladen, die aktualisiert wurden. Dies bedeutet auch, dass die Bewertungspunkte bei niedrigeren Werten in der Kette unberührt bleiben.
id: Saat Anda mengunggah perubahan dalam rantai, hanya patch yang diperbarui akan diunggah. Ini juga berarti bahwa skor ulasan pada patch yang lebih rendah dalam rantai tidak akan tersentuh.
ko_kr: 체인에 변경 사항을 업로드하면 업데이트된 패치만 업로드됩니다. 이는 체인의 하위 패치에 대한 검토 점수가 변경되지 않음을 의미하기도 합니다.
zh_cn: 当您上传补丁链中的更改时，只会上传被更新的补丁。 这也意味着补丁链中较低层的补丁的评论得分数将保持不变。

source: When you're working on a blueprint, you want to name your local branch after the blueprint. For this example, we'll use ``bp/nova-cyborg-interaction``.
id: Saat Anda mengerjakan blueprint, Anda ingin memberi nama cabang lokal Anda setelah cetak biru itu. Untuk contoh ini, kami akan gunakan ``bp/nova-cyborg-interaction``.
ko_kr: Blueprint를 작업할 때 Blueprint의 이름을 따서 로컬 분기의 이름을 지정하려고 합니다. 이 예에는 ``bp/nova-nova-cyborg-interaction`` 을 사용하겠습니다.
zh_cn: 在工作在一个蓝图（bp）上时，您可能会想要在蓝图后命名本地分支。 在此示例中，我们将使用 ``bp/nova-cyborg-interaction`` 。

source: When your work item grows above a particular size and you need to upload multiple patches it is crucial to structure it well in case of both patch chains and independent changes.
de: Wenn Ihr Workitem über eine bestimmte Größe hinausgeht und Sie mehrere Patches hochladen müssen, ist es wichtig, es sowohl bei Patchketten als auch bei unabhängigen Änderungen gut zu strukturieren.
id: Ketika item pekerjaan Anda tumbuh di atas ukuran tertentu dan Anda perlu mengunggah beberapa patch, sangat penting untuk menyusunnya dengan baik jika terjadi perubahan patch dan perubahan independen.
ko_kr: 작업 항목이 특정 크기 이상으로 커지고 여러 패치를 업로드해야 하는 경우 패치 체인과 독립적 변경의 경우 해당 패치를 잘 구성해야 합니다.
zh_cn: 当您的工作项增长到特定大小以上并且您需要上传多个补丁时，至关重要的是，在补丁链或是独立更改的情况下，合理地组织它。

source: While there is no magic number try to **keep the size of your changes as small as possible**, but under a few hundreds of lines changed total. Patches that are test heavy with little code change require as much effort as code heavy changes.
de: Während es keine magische Zahl gibt, versuche **die Größe Ihrer Änderungen so klein wie möglich zu halten**, aber unter ein paar hundert Zeilen wurden insgesamt geändert. Patches, die mit wenig Code-Änderungen teststark sind, erfordern genauso viel Aufwand wie codestarke Änderungen.
id: Meskipun tidak ada angka ajaib, cobalah untuk **keep the size of your changes as small as possible**, tetapi di bawah beberapa ratus baris berubah total. Patch yang uji berat dengan sedikit perubahan kode membutuhkan usaha sebanyak perubahan berat kode.
ko_kr: **변경 사항의 크기를 최대한 작게 유지** 하는 것에 대한 매직 넘버는 없지만 총 수백 줄 미만으로 변경됩니다. 코드 변경이 거의없이 테스트가 많은 패치는 코드 변경만큼 많은 노력이 필요합니다.
zh_cn: 虽然没有一个神奇的数字规范**使变更量的大小保持尽可能小**，但最好总变更量要少于几百行。 少量代码变更但是进行大量测试的补丁与大量代码变更所需的工作量相同。

source: You can find a `Sandbox <https://storyboard-dev.openstack.org/#!/project/2>`_ project in the tool that provides all the functionalities to you as any of the other active projects.
de: Sie können ein `Sandbox <https://storyboard-dev.openstack.org/#!/project/2>``_ Projekt in dem Tool finden, das Ihnen alle Funktionalitäten wie jedes andere aktive Projekt zur Verfügung stellt.
id: Anda dapat menemukan proyek `Sandbox <https://storyboard-dev.openstack.org/#!/project/2>`_ dalam alat yang menyediakan semua fungsi kepada Anda sebagai salah satu dari proyek aktif lainnya.
ko_kr: 다른 활성 프로젝트와 마찬가지로 모든 기능을 제공하는 도구에서 `샌드박스 <https://storyboard-dev.openstack.org/#!/project/2>`_ 프로젝트를 찾을 수 있습니다.
zh_cn: 您可以在工具中找到一个 `Sandbox <https://storyboard-dev.openstack.org/#!/project/2>`_ 项目，该项目可以像其他任何活跃项目一样为您提供所有功能。

source: You can find a `sandbox Git repository <https://opendev.org/opendev/sandbox>`_ where you can practice the Git commands before you put together a patch to resolve a bug or implement a new functionality.
ko_kr: 패치를 조합하여 버그를 해결하거나 새 기능을 구현하기 전에 Git 명령을 연습할 수 있는 `instit Git 저장소 <https://opendev.org/opendev/sandbox>`_ 를 찾을 수 있습니다.

source: You can find instructions on how to use Git in the :ref:`git` section.
de: Eine Anleitung zur Verwendung von Git finden Sie im Abschnitt :ref:`git`.
id: Anda dapat menemukan petunjuk tentang cara menggunakan Git di bagian :ref:`git`.
ko_kr: Git 사용 방법에 대한 지침은 :ref:`git` 섹션에서 확인할 수 있습니다.
zh_cn: 您可以在 :ref:`git` 章节中找到有关如何使用Git的说明。

source: You can find the same repositories using the search function here: `OpenDev git repository browser <https://opendev.org/explore/repos>`_
id: Anda dapat menemukan repositori yang sama menggunakan fungsi pencarian di sini: `OpenDev git repository browser <https://opendev.org/explore/repos>`_
ko_kr: 여기서 검색 기능을 사용하여 `OpenDev git 저장소 브라우저 <https://opendev.org/explore/repos>`_ 와 동일한 리포지토리를 찾을 수 있습니다.
zh_cn: 您可以在此处使用搜索功能找到相同的仓库： `OpenDev git repository browser <https://opendev.org/explore/repos>`_

source: You can find these pages at:
de: Sie finden diese Seiten unter:
id: Anda dapat menemukan halaman ini di:
ko_kr: 다음 페이지를 참조하십시오.

source: You can see the current status of the bugs being tracked by elastic recheck at: `Elastic Recheck <http://status.openstack.org/elastic-recheck/index.html>`_
de: Sie können den aktuellen Status der Bugs durch elastic-recheck sehen unter: `Elastische Überprüfung <http://status.openstack.org/elastic-recheck/index.html>``_
id: Anda dapat melihat status terkini dari bug yang dilacak oleh elastic recheck di: `Elastic Recheck <http://status.openstack.org/elastic-recheck/index.html>`_
ko_kr: Elastic 재검사를 통해 추적중인 버그의 현재 상태는 `Elastic Recheck <http://status.openstack.org/elastic-recheck/index.html>`_ 에서 확인할 수 있습니다.

source: You can upload your changes to the sandbox repository and review it on Gerrit as it is described in the :ref:`gerrit` section.
de: Sie können Ihre Änderungen in das Sandbox-Repository hochladen und auf Gerrit überprüfen, wie im Abschnitt :ref:`gerrit` beschrieben.
id: Anda dapat mengunggah perubahan Anda ke repositori sandbox dan memeriksanya di Gerrit seperti yang dijelaskan di bagian :ref:`gerrit`.
ko_kr: 샌드박스 저장소에 변경 사항을 업로드한 후 :ref:`gerrit` 섹션에 설명된 대로 Gerrit에서 검토할 수 있습니다.
zh_cn: 您可以将所做的更改上传到沙箱仓库，然后按照 :ref:`gerrit` 章节中的说明在Gerrit上进行检查。

source: You get permissions to perform all the operations in the Sandbox project for the sake of practice. When you join a project as a contributor you will have limited access to the functionalities as there are actions only core reviewers can perform. You can find information about these in the respective sections of the Contributor Guide.
de: Sie erhalten die Berechtigung, alle Operationen im Sandbox-Projekt aus praktischen Gründen durchzuführen. Wenn Sie einem Projekt als Beitragender beitreten, haben Sie begrenzten Zugriff auf die Funktionalitäten, da es Aktionen gibt, die nur von Kernreviewern ausgeführt werden können. Informationen dazu finden Sie in den jeweiligen Abschnitten des Contributor Guide.
id: Anda mendapatkan izin untuk melakukan semua operasi di proyek Sandbox demi praktik. Ketika Anda bergabung dengan sebuah proyek sebagai kontributor, Anda akan memiliki akses terbatas ke fungsi karena ada tindakan yang hanya dapat dilakukan oleh pengulas inti. Anda dapat menemukan informasi tentang ini di bagian masing-masing Contributor Guide.
ko_kr: Sandbox 프로젝트에서 모든 작업을 수행할 수 있는 권한을 실습용으로 얻을 수 있습니다. 프로젝트에 기여자로 참여하면 핵심 검토자만 수행할 수 있는 작업이 있으므로 기능에 대한 액세스가 제한됩니다. 이러한 정보에 대한 정보는 기여자 안내서의 각 섹션에서 확인할 수 있습니다.
zh_cn: 为了练习，您具有在沙箱项目中执行所有操作的权限。 当您以贡献者身份加入项目时，您将只能使用部分功能，因为只有核心审核人员可以执行某些操作。 您可以在《贡献者指南》的相应章节中找到有关这些内容的信息。

source: You have the option to specify a topic for your changes when you upload them for review. While Gerrit topics will not add dependency to your patches you can apply a search based on the topic that will show you all the relevant changes in all the projects where there are patches with the same topic. Gerrit will also show them to you in the 'Same Topic' column on the top right corner of the page of a review.
de: Sie haben die Möglichkeit, ein Thema für Ihre Änderungen anzugeben, wenn Sie sie zur Überprüfung hochladen. Während Gerrit-Topics keine Abhängigkeit zu Ihren Patches hinzufügen, können Sie eine Suche basierend auf dem Thema anwenden, die Ihnen alle relevanten Änderungen in allen Projekten anzeigt, in denen es Patches mit dem gleichen Thema gibt. Gerrit wird sie Ihnen auch in der Spalte 'Same Topic' oben rechts auf der Seite einer Rezension zeigen.
id: Anda memiliki opsi untuk menentukan topik untuk perubahan Anda saat Anda mengunggahnya untuk ditinjau. Sementara topik Gerrit tidak akan menambah ketergantungan pada patch Anda, Anda bisa menerapkan pencarian berdasarkan topik yang akan menunjukkan semua perubahan yang relevan di semua proyek di mana ada patch dengan topik yang sama. Gerrit juga akan menunjukkannya kepada Anda di kolom 'Same Topic' di sudut kanan atas halaman ulasan.
ko_kr: 검토를 위해 변경사항을 업로드할 때 변경사항을 지정할 수 있습니다. 게리트 항목은 패치에 종속성을 추가하지 않지만, 동일한 주제를 가진 패치가 있는 모든 프로젝트의 모든 관련 변경 사항을 보여주는 항목을 기반으로 검색을 적용할 수 있습니다. 게리트는 또한 검토 페이지의 오른쪽 상단 모서리에 있는 'Same Topic' 열에 해당 항목을 표시합니다.
zh_cn: 当您上传更改以进行审核时，可以选择为更改指定标题。 尽管Gerrit标题不会对补丁增加依赖性，但是您可以基于标题进行搜索，该搜索将向您显示所有具有相同标题的补丁的所有相关更改。 Gerrit还将在评论页面右上角的“相同标题（Same Topic）”列中向您显示这些标题。

source: You need as many '^' as the number of the patch you want to edit first from the top of the chain. Alternatively you may wish to use `git-restack <https://docs.openstack.org/infra/git-restack/>`_, which figures out the appropriate ``git rebase`` command for you.
id: Anda membutuhkan '^' sebanyak jumlah tambalan yang ingin Anda edit pertama dari atas rantai. Atau Anda mungkin ingin menggunakan `git-restack <https://docs.openstack.org/infra/git-restack/>` _, yang menunjukkan perintah ``git rebase`` yang sesuai untuk Anda.
ko_kr: 체인 상단에서 편집할 패치 번호만큼 '^' 이 필요합니다. 아니면 `git-restack <https://docs.openstack.org/infra/git-restack/>`_ 를 사용하여, 적절한 ``git rebase`` 명령어를 파악할 수 있습니다.
zh_cn: 从补丁链顶部开始，您将需要与要编辑的补丁数量一样多的'^'。 另外，您可能希望使用 `git-restack <https://docs.openstack.org/infra/git-restack/>`_ ，这会为您找出合适的 ``git rebase`` 命令。

source: You should also check any elastic search queries using kibana at: `Logstash Search <http://logstash.openstack.org/>`_
de: Sie sollten auch alle elastischen Suchanfragen mit Kibana überprüfen: Logstash-Suche <http://logstash.openstack.org/>``_
id: Anda juga harus memeriksa kueri elastic search menggunakan kibana di: `Logstash Search <http://logstash.openstack.org/>`_
ko_kr: 또한 kibana를 사용하여 엘라스틱서치 쿼리를 확인해야합니다: `Logstash Search <http://logstash.openstack.org/>`_

source: `+1`_: Looks good to me, but someone else must approve. This does not mean that there is nothing to comment on, just that there aren't any issues that would block the merging of the patch. You can still make comments on nitpicky things the patch owner can address if others find issues with the patch. These comments might also be something to address in a followup patch as opposed to another patchset.
de: `+1`_: Sieht für mich gut aus, aber jemand anderes muss es genehmigen. Das bedeutet nicht, dass es nichts zu kommentieren gibt, nur dass es keine Probleme gibt, die das Zusammenführen des Patches blockieren würden. Sie können immer noch Kommentare zu pingeligen Dingen abgeben, die der Patch-Besitzer ansprechen kann, wenn andere Probleme mit dem Patch finden. Diese Kommentare können auch etwas sein, das in einem Followup-Patch im Gegensatz zu einem anderen Patchset behandelt werden sollte.
id: `+ 1`_: Terlihat bagus untuk saya, tetapi orang lain harus menyetujuinya. Ini tidak berarti bahwa tidak ada yang perlu dikomentari, hanya saja tidak ada masalah yang akan memblokir penggabungan patch. Anda masih dapat membuat komentar tentang hal-hal yang bersifat nitpicky yang bisa ditangani pemilik patch jika orang lain menemukan masalah dengan patch itu. Komentar ini mungkin juga sesuatu untuk diatasi dalam patch tindak lanjut sebagai lawan dari patch lain.
ko_kr: `+1`_ : 보기엔 좋지만, 다른 사람이 승인해야 합니다. 그렇다고 해서 언급할 내용이 없는 것은 아니며 패치 병합에 방해가 되는 문제가 없는 것은 아닙니다. 다른 사용자가 패치에서 문제를 발견할 경우 패치 소유자가 해결할 수 있는 사소한 문제에 대해서도 의견을 제시할 수 있습니다. 이러한 설명은 다른 패치 집합과 달리 후속 패치에서 해결할 수도 있습니다.
zh_cn: `+1`_ ：对我来说不错，但其他人必须批准。 这并不意味着没有什么可评论的，只是不存在任何会阻碍补丁合并的问题。 如果其他人发现补丁的问题，您仍然可以对补丁所有者可能解决这个问题的一些方式发表评论。 这些评论也可能是这项补丁的后续补丁（而不是另一个补丁集）中要解决的问题。

source: `+2`_: Looks good to me (core reviewer). Depending on the project team and repository, merging a patch will require at least one +2 vote if not two +2 votes.
de: `+2`_: Sieht für mich gut aus (Kernprüfer). Abhängig vom Projektteam und dem Repository erfordert das Zusammenführen eines Patches mindestens eine +2 Stimme, wenn nicht sogar zwei +2 Stimmen.
id: `+2`_: Terlihat bagus untuk saya (core reviewer). Bergantung pada tim proyek dan repositori, penggabungan patch akan membutuhkan setidaknya satu suara +2 jika tidak dua suara +2.
ko_kr: `+2`_ : (핵심 검토자) 보기 좋아요. 프로젝트 팀과 리포지토리에 따라 패치를 병합하려면 2 +2표가 아닌 경우 최소 1 +2표가 필요합니다.
zh_cn: `+2`_ ：对我来说看起来不错（核心审阅者）。 根据项目团队和软件仓库的不同，合并补丁至少需要一票“+2”（如果不是两票“+2”）。

source: `-1`_: This patch needs further work before it can be merged. A -1 is usually given when the reviewer sees some issue that needs to be fixed before the patch can be merged. The issues the author needs to address would, ideally, have inline comments posted on them unless there is some larger issue. If there is something wrong with the overall approach, you are able to leave an overall comment with the vote to raise your concerns.
id: `-1`_: Patch ini perlu kerja lebih lanjut sebelum bisa digabung. A -1 biasanya diberikan ketika pengulas melihat beberapa masalah yang perlu diperbaiki sebelum patch dapat digabungkan. Masalah yang penulis perlu atasi, idealnya, memiliki komentar sebaris yang diposting padanya kecuali ada masalah yang lebih besar. Jika ada yang salah dengan pendekatan keseluruhan, Anda dapat meninggalkan komentar keseluruhan dengan suara untuk meningkatkan kekhawatiran Anda.
ko_kr: `-1`_ : 이 패치를 병합하려면 추가 작업이 필요합니다. -1은 일반적으로 패치를 병합하기 전에 수정해야 하는 일부 문제가 검토자에게 나타날 때 제공됩니다. 저자가 다루어야 할 이슈는, 이상적으로는, 더 큰 이슈가 없는 한, 인라인 코멘트가 게시될 것입니다. 전체적인 접근방식에 이상이 있을 경우 투표와 함께 전반적인 의견을 남겨 우려를 제기할 수 있습니다.
zh_cn: `-1`_ ：这个补丁需要进一步的修改才能合并。 当审阅者发现合并补丁之前需要解决一些问题时，通常会给出-1。 理想情况下，除非有更大的问题，否则作者需要解决的问题应在相应的位置上添加行内评论（inline comments）。 如果总体方法有问题，您可以在投票中留下总体评论，以提出您的担忧。

source: `-2`_: Do not merge. This score does not often appear and when it does, it's for a good reason:
de: `-2`_: Nicht mergen. Diese Partitur erscheint nicht oft, und wenn sie es tut, hat sie einen guten Grund:
id: `-2`_: Jangan gabung. Skor ini tidak sering muncul dan ketika itu terjadi, itu karena alasan yang bagus:
ko_kr: `-2`_ : 병합하지 않습니다. 이 점수는 자주 나타나지 않으며, 점수가 나타나는 경우 다음과 같은 이유가 있습니다.
zh_cn: `-2`_ ：不要合并。 这个分数并不经常出现，当出现时，这是有充分的理由的：

source: `0`_: No score. This is the default score when replying to a patchset. Generally it's kept as the vote when someone has a question about the patchset or doesn't have a fully formed opinion of the patchset yet - it requires more time, testing, or investigation.
de: `0`_: Kein Treffer. Dies ist die Standardpunktzahl bei der Antwort auf ein Patchset. Im Allgemeinen wird es als Stimme behalten, wenn jemand eine Frage über das Patchset hat oder noch keine vollständige Meinung über das Patchset hat - es erfordert mehr Zeit, Tests oder Untersuchungen.
id: `0`_: Tidak ada skor. Ini adalah skor default ketika membalas patchset. Biasanya ini disimpan sebagai suara ketika seseorang memiliki pertanyaan tentang patchset atau belum memiliki opini yang lengkap tentang patchset - itu membutuhkan lebih banyak waktu, pengujian, atau penyelidikan.
ko_kr: `0점`_ : 점수가 없습니다. 패치 집합에 응답할 때의 기본 점수입니다. 일반적으로 패치셋에 대한 질문이 있거나 아직 패치셋에 대한 의견이 완전히 형성되지 않은 경우, 더 많은 시간, 테스트 또는 조사가 필요한 경우 투표로 유지됩니다.
zh_cn: `0`_ ：没有分数。 这是回复补丁集时的默认分数。 通常，当有人对补丁集有疑问或尚未对补丁集有完整的意见时，它将保留表决权–需要更多时间，测试或调查。
