Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-organizations.po
Languages: de, id

source: A guide outlining the base requirements and recommendations for employees looking to contribute to OpenStack.
de: Ein Leitfaden, der die grundlegenden Anforderungen und Empfehlungen für Mitarbeiter enthält, die einen Beitrag zu OpenStack leisten möchten.
id: Panduan yang menguraikan persyaratan dasar dan rekomendasi untuk karyawan (employee) yang ingin berkontribusi ke OpenStack.

source: A process to clear contributions from IP point of view
de: Ein Prozess zur Klärung von Beiträgen aus IP-Sicht
id: Suatu proses untuk menghapus kontribusi dari sudut pandang IP

source: Ability to receive E-mail from and send E-mail to addresses at lists.openstack.org (mailing lists)
de: Möglichkeit zum Empfangen von E-Mails und Senden von E-Mails an Adressen unter lists.openstack.org (Mailinglisten)
id: Kemampuan menerima E-mail dari dan mengirim E-mail ke alamat di lists.openstack.org (milis)

source: Access to chat.freenode.net port 6697/tcp (IRC communication)
de: Zugang zum chat.freenode.net Port 6697/tcp (IRC-Kommunikation)
id: Akses ke chat.freenode.net port 6697/tcp (IRC communication)

source: Access to review.openstack.org for code review and code submission.
id: Akses ke review.openstack.org untuk ulasan kode dan pengiriman kode.

source: All projects have regular meetings on IRC. Most these meetings alternate between two different timezones. Sometimes however, it is advantageous to get all developers working on a certain feature or project to be in one place at the same time.
de: Alle Projekte haben regelmäßige Treffen im IRC. Die meisten dieser Treffen wechseln zwischen zwei verschiedenen Zeitzonen. Manchmal ist es jedoch von Vorteil, wenn alle Entwickler, die an einem bestimmten Feature oder Projekt arbeiten, gleichzeitig an einem Ort sind.
id: Semua proyek memiliki pertemuan rutin di IRC. Sebagian besar pertemuan ini bergantian antara dua zona waktu yang berbeda. Namun terkadang, menguntungkan jika semua pengembang mengerjakan fitur atau proyek tertentu berada di satu tempat pada saat yang sama.

source: All these extra developers means more eyes on code finding, fixing, and improving the code. This means having a community of developers helping in the development and improvement of your own infrastructure.
de: All diese zusätzlichen Entwickler bedeuten mehr Augenmerk auf das Finden, Reparieren und Verbessern des Codes. Das bedeutet, dass Sie eine Gemeinschaft von Entwicklern haben, die Ihnen bei der Entwicklung und Verbesserung Ihrer eigenen Infrastruktur helfen.
id: Semua pengembang tambahan ini berarti lebih banyak perhatian pada pencarian kode, perbaikan, dan peningkatan kode. Ini berarti memiliki komunitas pengembang yang membantu dalam pengembangan dan peningkatan infrastruktur Anda sendiri.

source: Avoid carrying downstream patches.
de: Vermeiden Sie Downsstream Patches.
id: Hindari membawa patch hilir (downstream patch).

source: Be involved in design and direction of the project.
de: Beteiligen Sie sich an der Gestaltung und Leitung des Projekts.
id: Terlibat dalam desain dan arah proyek.

source: Being a global community, with members from across the globe being available to occasionally work, talk or meet outside of typical office hours is paramount.
de: Als globale Gemeinschaft mit Mitgliedern aus der ganzen Welt, die gelegentlich außerhalb der üblichen Bürozeiten arbeiten, reden oder sich treffen können, ist von größter Bedeutung.
id: Menjadi komunitas global, dengan anggota dari seluruh dunia tersedia untuk sesekali bekerja, berbicara, atau bertemu di luar jam kerja biasa adalah yang terpenting.

source: Being involved in and shape implementation discussions.
de: Beteiligung und Gestaltung von Umsetzungsgesprächen.
id: Terlibat dalam dan membentuk diskusi implementasi.

source: Better yet, instead of forking or adding downstream patches in your own products that you'd then need to carry, support and maintain, which can be very costly. You could push it upstream and get benefit from an entire community of developers improving and maintaining it with you. Effectively removing most, if not all of the additional cost and risk of maintaining it downstream.
de: Noch besser, anstatt Downstream-Patches in Ihren eigenen Produkten zu forken oder hinzuzufügen, die Sie dann tragen, unterstützen und warten müssten, was sehr kostspielig sein kann. Sie könnten es zu Upstream schieben und von einer ganzen Gemeinschaft von Entwicklern profitieren, die es mit Ihnen verbessern und pflegen. Effektive Beseitigung der meisten, wenn nicht sogar aller zusätzlichen Kosten und Risiken für die Instandhaltung nachgeschalteter Systeme.
id: Lebih baik lagi, daripada memanipulasi (forking) atau menambahkan patch hilir dalam produk Anda sendiri yang perlu Anda bawa, dukung, dan pelihara, yang bisa sangat mahal. Anda bisa mendorongnya ke atas dan mendapatkan manfaat dari seluruh komunitas pengembang yang meningkatkan dan mempertahankannya bersama Anda. Secara efektif menghapus sebagian besar, jika tidak semua biaya tambahan dan risiko mempertahankannya di hilir.

source: Code
id: Kode

source: Communication
de: Kommunikation
id: Komunikasi

source: Community Culture
de: Community-Kultur
id: Budaya Masyarakat

source: Consider an exception for standard email footers on emails being sent to the community mailing lists
de: Betrachten Sie eine Ausnahme für Standard-E-Mail-Fußzeilen bei E-Mails, die an die Community-Mailinglisten gesendet werden
id: Pertimbangkan pengecualian untuk footer email standar pada email yang dikirim ke milis komunitas

source: Consider signing up as a contributing organization member
de: Erwägen Sie, sich als beitragendes Organisationsmitglied zu registrieren
id: Pertimbangkan mendaftar sebagai anggota organisasi yang berkontribusi

source: Contributing Organization Guide
de: Beitragen zum Organisationleitfaden
id: Menyumbang Panduan Organisasi

source: Depends on your own plan, but try to cover the range of project services that you're using or plan to use for your services.
de: Hängt von Ihrem eigenen Plan ab, aber versuchen Sie, die Bandbreite der Projektdienste abzudecken, die Sie für Ihre Dienste nutzen oder in Anspruch nehmen wollen.
id: Tergantung pada rencana Anda sendiri, tetapi cobalah untuk mencakup berbagai layanan proyek yang Anda gunakan atau rencanakan untuk digunakan untuk layanan Anda.

source: Developer Involvement
de: Einbindung von Entwicklern
id: Keterlibatan Pengembang

source: Different timezones means different cultures, so be sensitive to these cultural differences. One example is to give non-native English speakers a chance to think and speak and if using a voice medium, please slow down.
de: Unterschiedliche Zeitzonen bedeuten unterschiedliche Kulturen, also seien Sie sensibel für diese kulturellen Unterschiede. Ein Beispiel ist, Nicht-Muttersprachlern die Möglichkeit zu geben, zu denken und zu sprechen, und wenn Sie ein Sprachmedium verwenden, verlangsamen Sie bitte.
id: Zona waktu yang berbeda berarti budaya yang berbeda, jadi peka terhadap perbedaan budaya ini. Salah satu contohnya adalah memberi kesempatan bagi penutur bahasa Inggris non-native untuk berpikir dan berbicara dan jika menggunakan media suara, tolong pelan-pelan.

source: Email Consideration
de: E-Mail-Betrachtung
id: Pertimbangan Email

source: Everyone is in this together and are working for a better OpenStack.
de: Alle sind gemeinsam dabei und arbeiten an einem besseren OpenStack.
id: Semua orang bersama-sama dan bekerja untuk OpenStack yang lebih baik.

source: Everyone who holds a title, such as PTL or a part of the technical committee are elected in. So titles are temporary.
de: Gewählt werden alle, die einen Titel wie PTL oder ein Teil des Technischen Komitees sind. Titel sind also temporär.
id: Setiap orang yang memegang gelar, seperti PTL atau bagian dari komite teknis dipilih. Jadi, gelar bersifat sementara.

source: Expectation of travel to at least some events - does not need to be all
de: Erwartung der Reise zu mindestens einigen Veranstaltungen - muss nicht alles sein
id: Harapan bepergian ke setidaknya beberapa acara - tidak harus semuanya

source: Expectations
de: Erwartungen
id: Harapan

source: Focusing staff on particular project areas, or towards particular goals is more effective than asking them to track activity over many projects.
de: Die Fokussierung der Mitarbeiter auf bestimmte Projektbereiche oder auf bestimmte Ziele ist effektiver, als sie zu bitten, die Aktivitäten über viele Projekte hinweg zu verfolgen.
id: Memfokuskan staf pada area proyek tertentu, atau ke arah tujuan tertentu lebih efektif daripada meminta mereka untuk melacak aktivitas pada banyak proyek.

source: For more information on how we use gerrit see:
de: Für weitere Informationen darüber, wie wir Gerrit verwenden, siehe:
id: Untuk informasi lebih lanjut tentang cara kami menggunakan gerrit, lihat:

source: For more information on such events see: https://www.openstack.org/community/events/
de: Weitere Informationen zu solchen Veranstaltungen finden Sie unter: https://www.openstack.org/community/events/
id: Untuk informasi lebih lanjut tentang acara tersebut, lihat: https://www.openstack.org/community/events/

source: Forks are bad, contributing upstream is much better.
de: Forks sind schlecht, ein Beitrag upstream ist viel besser.
id: Pencabangan (fork) adalah buruk, berkontribusi di hulu jauh lebih baik.

source: Further, having engineers in the community long term will also keep the company ahead of the curve as they are embedded and engaged in the community rather then popping in and out.
de: Darüber hinaus wird es auch das Unternehmen vorantreiben, wenn Ingenieure langfristig in der Community tätig sind, da sie eingebettet und in der Community engagiert sind, anstatt ein- und auszusteigen.
id: Lebih jauh, memiliki insinyur dalam komunitas jangka panjang juga akan membuat perusahaan berada di depan kurva karena mereka tertanam dan terlibat dalam komunitas daripada muncul dan keluar.

source: Getting involved in these projects means you can:
de: Sich an diesen Projekten zu beteiligen, bedeutet, dass Sie es können:
id: Terlibat dalam proyek-proyek ini berarti Anda dapat:

source: Good metrics are hard https://en.wikipedia.org/wiki/Goodhart%27s_law .
id: Metrik yang baik sulit https://en.wikipedia.org/wiki/Goodhart%27s_law .

source: How long they should be there?
de: Wie lange sollten sie dort sein?
id: Berapa lama mereka di sana?

source: How many people you should send?
de: Wie viele Personen sollten Sie schicken?
id: Berapa banyak orang yang harus Anda kirim?

source: IRC conversations
de: IRC-Gespräche
id: Percakapan IRC

source: IRC meetings
id: Pertemuan IRC

source: If connectivity to certain ports are locked down or are a problem, a SOCKS server can be used to provide access.
de: Wenn die Verbindung zu bestimmten Ports gesperrt ist oder ein Problem darstellt, kann ein SOCKS-Server verwendet werden, um den Zugriff zu ermöglichen.
id: Jika konektivitas ke port tertentu dikunci atau ada masalah, server SOCKS dapat digunakan untuk menyediakan akses.

source: If utilizing an IRC bouncer port 443, to the bouncer, may be used.
de: Bei Verwendung eines IRC-Bouncer-Ports 443 kann der Bouncer verwendet werden.
id: Jika menggunakan IRC bouncer port 443,, ke bouncer, dapat digunakan.

source: If your company is large enough to have the choice, giving engineers more time to specialise and concentrate on specific areas tend to be more efficient than having engineers continually context switching as they have to wear multiple hats.
de: Wenn Ihr Unternehmen groß genug ist, um die Wahl zu haben, ist es in der Regel effizienter, Ingenieuren mehr Zeit für die Spezialisierung zu geben und sich auf bestimmte Bereiche zu konzentrieren, als wenn Ingenieure ständig den Kontext wechseln, da sie mehrere Hüte tragen müssen.
id: Jika perusahaan Anda cukup besar untuk memiliki pilihan, memberi insinyur lebih banyak waktu untuk mengkhususkan dan berkonsentrasi pada bidang-bidang tertentu cenderung lebih efisien daripada meminta insinyur terus-menerus mengubah konteks karena mereka harus mengenakan banyak topi (wear multiple hats).

source: It will also be better tested than anything developed internally because it will be tested by the community and used more widely than just your customers.
de: Es wird auch besser getestet als alles, was intern entwickelt wird, weil es von der Community getestet und umfassender genutzt wird als nur Ihre Kunden.
id: Ini juga akan diuji lebih baik daripada apa pun yang dikembangkan secara internal karena itu akan diuji oleh komunitas dan digunakan lebih luas daripada hanya pelanggan Anda.

source: Likewise, when reviewing patches, talking with a patch author in channel can greatly speed up reviews especially for more complicated patches.
de: Ebenso kann das Gespräch mit einem Patch-Autor im Channel bei der Überprüfung von Patches die Überprüfung insbesondere bei komplexeren Patches erheblich beschleunigen.
id: Demikian juga, ketika meninjau patch, berbicara dengan pembuat patch di saluran dapat sangat mempercepat ulasan terutama untuk patch yang lebih rumit.

source: Mailing list can be high traffic, consider permitting use of external mail services to handle the intake from community mailing lists.
de: Die Mailingliste kann sehr stark frequentiert sein, erwägen Sie, die Verwendung externer Maildienste zu erlauben, um die Aufnahme aus den Community-Mailinglisten zu verwalten.
id: Mailing list dapat berupa traffic tinggi, pertimbangkan untuk mengizinkan penggunaan layanan mail eksternal untuk menangani intake dari mailing list komunitas.

source: Monitor the health of the project.
de: Überwachen Sie den Zustand des Projekts.
id: Pantau kesehatan proyek.

source: Non-Technical
de: Nicht technische
id: Non-Teknis

source: OpenStack is a global community. Interaction with the community means working and interacting with people from different timezones and cultures, as such there are other non-technical recommendations that help facilitate engagement in the OpenStack community, these can be broken down into three areas: communication, culture and expectations.
de: OpenStack ist eine globale Community. Interaktion mit der Community bedeutet, mit Menschen aus verschiedenen Zeitzonen und Kulturen zu arbeiten und zu interagieren, da es andere nicht-technische Empfehlungen gibt, die das Engagement in der OpenStack-Community erleichtern, diese lassen sich in drei Bereiche unterteilen: Kommunikation, Kultur und Erwartungen.
id: OpenStack adalah komunitas global. Interaksi dengan komunitas berarti bekerja dan berinteraksi dengan orang-orang dari zona waktu dan budaya yang berbeda, karena ada rekomendasi non-teknis lainnya yang membantu memfasilitasi keterlibatan dalam komunitas OpenStack, ini dapat dipecah menjadi tiga bidang: komunikasi, budaya dan harapan.

source: Operating System (OS) Considerations
de: Überlegungen zum Betriebssystem (OS)
id: Pertimbangan Sistem Operasi (OS)

source: Operator meetups
id: Pertemuan operator

source: Other
de: Andere
id: Lain

source: Other projects may choose other ways of communicating depending on the developers in question. But transparency is important. Anything discussed should be logged or minuted for the rest of the OpenStack project and world to see.
de: Andere Projekte können je nach Entwickler andere Kommunikationswege wählen. Aber Transparenz ist wichtig. Alles, was besprochen wird, sollte protokolliert oder protokolliert werden, damit der Rest des OpenStack-Projekts und die Welt sehen kann.
id: Proyek lain mungkin memilih cara komunikasi lain tergantung pada pengembang yang dimaksud. Tetapi transparansi itu penting. Apa pun yang didiskusikan harus dicatat atau di minute untuk dilihat oleh sisa (rest) proyek OpenStack dan dunia.

source: Permission and budget to send contributors to events
de: Genehmigung und Budget für die Entsendung von Beitragenden zu Veranstaltungen
id: Izin dan anggaran untuk mengirim kontributor ke acara

source: Permission to agree to the OpenStack ICLA (required)
de: Erlaubnis zur Zustimmung zum OpenStack ICLA (erforderlich)
id: Izin untuk menyetujui OpenStack ICLA (wajib)

source: Permission to agree with terms of becoming an OpenStack Foundation Individual Member
de: Erlaubnis zur Zustimmung zu den Bedingungen für die Aufnahme in die OpenStack Foundation Einzelmitglied
id: Izin untuk menyetujui syarat menjadi OpenStack Foundation Individual Member

source: Permission to occasionally work outside typical office hours
de: Erlaubnis, gelegentlich außerhalb der üblichen Bürozeiten zu arbeiten
id: Izin untuk sesekali bekerja di luar jam kerja biasa

source: Permission to run Linux and install other open source software on employer-supplied hardware.
de: Erlaubnis, Linux zu betreiben und andere Open-Source-Software auf vom Arbeitgeber zur Verfügung gestellter Hardware zu installieren.
id: Izin untuk menjalankan Linux dan menginstal perangkat lunak open source lainnya pada perangkat keras yang disediakan majikan.

source: Port 29428/tcp is the Gerrit SSH API.
de: Port 29428/tcp ist die Gerrit SSH API.
id: Port 29428/tcp adalah Gerrit SSH API.

source: Port 443/tcp is also available to access gerrit but only recommended if opening port 29428 is not possible, as it requires generating a password in the gerrit interface rather than using ssh certificates, so is inherently less secure.
de: Port 443/tcp steht auch für den Zugriff auf gerrit zur Verfügung, wird aber nur empfohlen, wenn das Öffnen von Port 29428 nicht möglich ist, da es die Generierung eines Passworts in der gerrit-Schnittstelle erfordert, anstatt ssh-Zertifikate zu verwenden, was von Natur aus weniger sicher ist.
id: Port 443/tcp juga tersedia untuk mengakses gerrit tetapi hanya disarankan jika membuka port 29428 tidak dimungkinkan, karena memerlukan pembuatan kata sandi di antarmuka gerrit daripada menggunakan sertifikat ssh, sehingga secara inheren kurang aman.

source: Recommendations
de: Empfehlungen
id: Rekomendasi

source: Remember many hands make light work.
de: Denken Sie daran, dass viele Hände leichte Arbeit machen.
id: Ingat banyak tangan membuat pekerjaan ringan.

source: See :ref:`communication-mailing-lists`.
de: Siehe :ref:`communication-mailing-lists`.
id: Lihat :ref:`communication-mailing-lists`.

source: See :ref:`setup-irc`.
de: Siehe :ref:`setup-irc`.
id: Lihat :ref:`setup-irc`.

source: Should be prepared to write permission letter/visa letters/necessary letters for getting visas
de: Sollte bereit sein, ein Genehmigungsschreiben/Visumsschreiben/notwendige Schreiben für die Visabeschaffung zu schreiben
id: Harus siap untuk menulis surat izin/surat visa/surat yang diperlukan untuk mendapatkan visa

source: Some asynchronous communication mediums, such as email and gerrit, are heavily used, but at times these discussions can to be sped up by using more synchronous mediums such as:
de: Einige asynchrone Kommunikationsmedien, wie E-Mail und Gerrit, werden stark genutzt, aber manchmal können diese Diskussionen durch die Verwendung synchroner Medien wie:
id: Beberapa media komunikasi yang tidak sinkron, seperti email dan gerrit, sangat banyak digunakan, tetapi kadang-kadang diskusi ini dapat dipercepat dengan menggunakan media yang lebih sinkron seperti:

source: Some technical events include:
de: Einige technische Ereignisse sind unter anderem:
id: Beberapa acara teknis meliputi:

source: Suggestions
de: Vorschläge
id: Saran

source: Summits and Forums
de: Summits und Forum
id: Summits dan Forums

source: Technical
de: Technisch
id: Teknis

source: Technical Events
de: Technische Veranstaltungen
id: Acara Teknis

source: The OpenStack community is spread across the different timezones, so always try be transparent to the greater community and if using a synchronous communication system to make feature/project decisions, make sure you make it possible for asynchronous input from members in other timezones.
de: Die OpenStack-Community ist auf die verschiedenen Zeitzonen verteilt, also versuchen Sie immer, für die größere Community transparent zu sein, und wenn Sie ein synchrones Kommunikationssystem verwenden, um Funktions-/Projektentscheidungen zu treffen, stellen Sie sicher, dass Sie asynchrone Eingaben von Mitgliedern in anderen Zeitzonen ermöglichen.
id: Komunitas OpenStack tersebar di berbagai zona waktu, jadi selalu coba transparan kepada komunitas yang lebih besar dan jika menggunakan sistem komunikasi sinkron untuk membuat keputusan fitur/proyek, pastikan Anda memungkinkan input asinkron dari anggota di zona waktu lain.

source: The community upstream is filled with passionate and intelligent people who all want what's best for the project. Being involved means you can help shape and improve the project.
de: Die Community im Upstream ist gefüllt mit leidenschaftlichen und intelligenten Menschen, die alle das Beste für das Projekt wollen. Mitwirken bedeutet, dass Sie das Projekt mitgestalten und verbessern können.
id: Komunitas hulu dipenuhi oleh orang-orang yang bersemangat dan cerdas yang semuanya menginginkan yang terbaik untuk proyek ini. Terlibat berarti Anda dapat membantu membentuk dan meningkatkan proyek.

source: The ideal answer is to give the technical people as much percentage of their time as you can give, and for as long as possible.
de: Die ideale Antwort ist, den Technikern so viel Prozent ihrer Zeit wie möglich und so lange wie möglich zu geben.
id: Jawaban yang ideal adalah memberi orang-orang teknis persentase waktu mereka sebanyak yang Anda bisa berikan, dan selama mungkin.

source: The letters/decisions made on travel should be given out, ideally weeks or more, in advance
de: Die auf der Reise getroffenen Schreiben/Entscheidungen sollten idealerweise Wochen oder mehr im Voraus ausgehändigt werden
id: Surat-surat/keputusan yang diambil dalam perjalanan harus diberikan, idealnya berminggu-minggu atau lebih, sebelumnya

source: The more people you have working upstream, the better attention your feature will get. Providing more reviewers will definitely help merge your implementation to projects. Code review is a bottleneck for landing patches, more good reviews the faster code can land.
de: Je mehr Leute Sie im Upstream arbeiten haben, desto mehr Aufmerksamkeit wird Ihr Feature erhalten. Die Bereitstellung von mehr Reviewern wird definitiv dazu beitragen, Ihre Implementierung in Projekte einzubinden. Code Review ist ein Engpass für Landing Patches, mehr gute Reviews, je schneller kann der Code.
id: Semakin banyak orang yang bekerja di hulu, semakin baik perhatian fitur Anda. Memberikan lebih banyak pengulas pasti akan membantu menggabungkan implementasi Anda dengan proyek. Ulasan kode adalah hambatan untuk pendaratan patch (landing patch), lebih banyak ulasan bagus kode lebih cepat dapat mendarat.

source: There are a number of technical events that are held where community, project, and cross-project planning and networking happen in person. Although this planning and networking does happen online outside these events you should consider sending developers along to be involved.
de: Es gibt eine Reihe von technischen Veranstaltungen, bei denen Community-, Projekt- und projektübergreifende Planung und Vernetzung persönlich stattfinden. Obwohl diese Planung und Vernetzung außerhalb dieser Veranstaltungen online stattfindet, sollten Sie in Betracht ziehen, Entwickler mitzunehmen.
id: Ada sejumlah acara teknis yang diadakan di mana komunitas, proyek, dan perencanaan serta jejaring lintas proyek terjadi secara langsung. Meskipun perencanaan dan jaringan ini terjadi secara online di luar acara ini, Anda harus mempertimbangkan untuk mengirimkan pengembang untuk terlibat.
