Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: Official project teams within OpenStack have a `Project Team Lead <https://governance.openstack.org/tc/reference/charter.html#project-team-leads>`_. These individuals coordinate the day to day operation of the project, resolve technical disputes within the project, and operate as the spokesperson and ambassador for the project.
de: Offizielle Projektteams innerhalb von OpenStack haben einen `Projektteamleiter <https://governance.openstack.org/tc/reference/charter.html#project-team-leads>`_. Diese Personen koordinieren den täglichen Projektbetrieb, lösen technische Streitigkeiten innerhalb des Projekts und fungieren als Sprecher und Botschafter des Projekts.
id: Tim proyek resmi dalam OpenStack memiliki `Project Team Lead <https://governance.openstack.org/tc/reference/charter.html#project-team-leads>`_. Orang-orang ini mengoordinasikan operasi proyek sehari-hari, menyelesaikan perselisihan teknis di dalam proyek, dan beroperasi sebagai juru bicara dan duta besar untuk proyek tersebut.
ko_kr: OpenStack의 공식 프로젝트 팀에는 `Project Team Lead <https://governance.openstack.org/tc/reference/charter.html#project-team-leads>`_ 이 있습니다. 이들 개인은 프로젝트의 일상적인 운영을 조정하고, 프로젝트 내에서 기술적인 분쟁을 해결하며, 프로젝트의 대변인 및 홍보대사로 활동합니다.

source: On IRC, we also have a dedicated channel for the topics our cohorts focus on. Please join #openstack-mentoring whenever you are online to stay in the loop and meet other people that have overlapping timezones- both mentors and mentees.
de: Im IRC haben wir auch einen eigenen Kanal für die Themen, auf die sich unsere Kohorten konzentrieren. Bitte nehmen Sie am #openstack-mentoring teil, wann immer Sie online sind, um auf dem Laufenden zu bleiben und andere Menschen mit überlappenden Zeitzonen zu treffen - sowohl Mentoren als auch Mentees.
id: Di IRC, kami juga memiliki saluran khusus untuk topik yang menjadi fokus kelompok kami. Silakan bergabung #openstack-mentoring setiap kali Anda online untuk tetap di loop dan bertemu orang lain yang memiliki zona waktu yang tumpang tindih - baik mentor dan mentees.
ko_kr: IRC에서는 또한 코호트들이 중점적으로 다루는 주제에 대한 전용 채널을 운영하고 있습니다. #오픈스택멘토링에 참여하여 온라인에 접속할 때마다 루프를 유지하며 멘토와 멘티 모두 타임존이 겹치는 다른 사람들을 만나시기 바랍니다.

source: On the next screen you are prompted to add details including its name and title.
de: Auf dem nächsten Bildschirm werden Sie aufgefordert, Details wie Name und Titel hinzuzufügen.
id: Pada layar berikutnya Anda diminta untuk menambahkan detail termasuk nama dan judulnya.
ko_kr: 다음 화면에서 이름 및 제목을 포함한 세부 정보를 추가하라는 메시지가 표시됩니다.

source: On the top right corner, click the **login** button.
de: Klicken Sie oben rechts auf die Schaltfläche **Login**.
id: Di sudut kanan atas, klik tombol **login**.
ko_kr: 오른쪽 위 구석에서, **login** 단추를 클릭합니다.

source: Once a 6-month development cycle is completed the code for that release is branched, in git, to a stable branch. For instance, when the Stein release was completed a new branch in git, ``stable/stein`` was created.
id: Setelah siklus pengembangan 6 bulan selesai, kode untuk rilis itu bercabang, dalam git, ke cabang stabil. Misalnya, ketika rilis Stein selesai cabang baru di git, ``stable/stein`` dibuat.
ko_kr: 6개월 개발 주기가 완료되면 해당 릴리스에 대한 코드가 git 단위로 안정적인 분기에 분기됩니다. 예를 들어 Stein 릴리즈가 완료되면 git에 ``stable/stein`` 이 만들어졌습니다.

source: Once registered, you can join a language team.
de: Nach der Registrierung können Sie einem Sprachenteam beitreten.
id: Setelah terdaftar, Anda dapat bergabung dengan tim bahasa.
ko_kr: 일단 등록되면 언어 팀에 가입할 수 있습니다.

source: Once you have Git installed you need to configure it. Open your terminal application and issue the following commands putting in your first/last name and email address. This is how your contributions will be identified::
de: Sobald Sie Git installiert haben, müssen Sie es konfigurieren. Öffnen Sie Ihre Terminalanwendung und geben Sie die folgenden Befehle ein, indem Sie Ihren Vor-/Nachnamen und Ihre E-Mail-Adresse eingeben. So werden Ihre Beiträge identifiziert::
id: Setelah Anda menginstal Git, Anda perlu mengkonfigurasinya. Buka aplikasi terminal Anda dan keluarkan perintah berikut dengan memasukkan nama depan / belakang dan alamat email Anda. Beginilah kontribusi Anda akan diidentifikasi ::
ko_kr: Git를 설치한 후에는 Git을 구성해야 합니다. 터미널 응용 프로그램을 열고 이름/성 및 전자 메일 주소를 입력하는 다음 명령을 실행합니다. 다음과 같은 방법으로 공헌을 확인할 수 있습니다.

source: Only APCs can participate in the election process to vote for the next PTL of the team.
de: Nur APCs können am Wahlprozess teilnehmen, um für die nächste PTL des Teams zu stimmen.
id: Hanya APC yang dapat berpartisipasi dalam proses pemilihan untuk memilih PTL tim berikutnya.
ko_kr: APC만이 선거 과정에 참여하여 팀의 다음 PTL에 투표할 수 있습니다.

source: Open Infrastructure Summit
ko_kr: 개방형 인프라 서밋

source: Open your terminal program and type::
de: Öffnen Sie Ihr Terminalprogramm und geben Sie ein::
id: Buka program terminal Anda dan ketik ::
ko_kr: 터미널 프로그램을 열고 다음을 입력합니다.

source: OpenInfra Days are essentially the same in format and benefit to attendees, but are broader in scope. OpenInfra Days are focused on being more open and welcoming of adjacent infrastructure technologies.
id: OpenInfra Days pada dasarnya memiliki format dan manfaat yang sama untuk peserta, tetapi cakupannya lebih luas. OpenInfra Days difokuskan untuk lebih terbuka dan menyambut teknologi infrastruktur yang berdekatan.
ko_kr: OpenInfra Days는 기본적으로 형식과 참석자에게 혜택이 동일하지만 범위가 더 넓습니다. OpenInfra Days는 보다 개방적이고 인접한 인프라 기술을 환영하는 데 초점을 맞추고 있습니다.

source: OpenStack Events
de: OpenStack-Ereignisse
id: Acara OpenStack
ko_kr: OpenStack 이벤트

source: OpenStack Governance
id: Tata Kelola OpenStack
ko_kr: OpenStack 거버넌스

source: OpenStack `Special Interest Groups <https://governance.openstack.org/sigs/>`_ are working groups that operate within the entire OpenStack community to address interests and concerns of all participants with a shared interest.
de: OpenStack `Special Interest Groups <https://governance.openstack.org/sigs/>`_ sind Arbeitsgruppen, die innerhalb der gesamten OpenStack-Community tätig sind, um Interessen und Anliegen aller Teilnehmer mit einem gemeinsamen Interesse anzusprechen.
id: OpenStack `Special Interest Groups <https://governance.openstack.org/sigs/>`_ adalah kelompok kerja yang beroperasi dalam seluruh komunitas OpenStack untuk mengatasi minat dan keprihatinan semua peserta dengan kepentingan bersama.
ko_kr: OpenStack `Special Interest Groups <https://governance.openstack.org/sigs/>`_ 은 전체 OpenStack 커뮤니티 내에서 공유 관심사를 가진 모든 참가자의 관심과 우려를 해결하기 위해 활동하는 작업 그룹입니다.

source: OpenStack consists of a large number of projects that form the main components of an OpenStack cloud, from client libraries to lifecycle management services. The different projects are different in nature which implies different `release models <https://releases.openstack.org/reference/release_models.html>`_ to follow.
de: OpenStack besteht aus einer Vielzahl von Projekten, die die Hauptkomponenten einer OpenStack-Cloud bilden, von Benutzer-Bibliotheken bis hin zu Lifecycle-Management-Services. Die verschiedenen Projekte sind unterschiedlicher Natur, was bedeutet, dass verschiedene `Release Modelle <https://releases.openstack.org/reference/release_models.html>`_ folgen werden.
id: OpenStack terdiri dari sejumlah besar proyek yang membentuk komponen utama dari cloud OpenStack, dari pustaka klien hingga layanan manajemen siklus hidup. Berbagai proyek berbeda di alam yang menyiratkan berbeda `release models <https://releases.openstack.org/reference/release_models.html>`_ mengikuti.
ko_kr: OpenStack은 클라이언트 라이브러리에서 라이프사이클 관리 서비스에 이르기까지 OpenStack 클라우드의 주요 구성 요소를 구성하는 수많은 프로젝트로 구성됩니다. 프로젝트마다 성격이 다르고, 따라서 `릴리스 모델 <https://releases.openstack.org/reference/release_models.html>`_ 이 다르다는 것을 암시합니다.

source: OpenStack has a 6-month long release cadence with different release models that projects can choose to follow.
de: OpenStack hat eine 6-monatige Release-Kadenz mit verschiedenen Release-Modellen, denen Projekte folgen können.
id: OpenStack memiliki irama (cadence0 rilis selama 6 bulan dengan model rilis berbeda yang dapat dipilih proyek untuk diikuti.
ko_kr: OpenStack은 프로젝트에서 선택할 수 있는 다양한 릴리스 모델로 6개월의 릴리즈 기간을 제공합니다.

source: OpenStack is a community working towards one mission:
de: OpenStack ist eine Gemeinschaft, die sich für eine Mission einsetzt:
id: OpenStack adalah komunitas yang bekerja menuju satu misi:
ko_kr: OpenStack은 하나의 미션을 위해 노력하는 커뮤니티입니다.

source: OpenStack is a software package that provides a cloud platform for Public and Private cloud covering various use cases including Enterprise and Telecom. The main focus is on Infrastructure as a Service (IaaS) cloud and additional services built upon IaaS. The Technical Committee maintains an evolving `vision for OpenStack clouds <https://governance.openstack.org/tc/reference/technical-vision.html>`_ describing the overall design scope for an OpenStack cloud and the principles of cloud platforms in general, and OpenStack in particular, that each service within OpenStack is expected to follow.
de: OpenStack ist ein Softwarepaket, das eine Cloud-Plattform für Public und Private Cloud bietet und verschiedene Anwendungsfälle wie Enterprise und Telekom abdeckt. Der Schwerpunkt liegt auf der Infrastructure as a Service (IaaS)-Cloud und zusätzlichen Services auf Basis von IaaS. Das Technical Comittee erarbeitet eine evolvierende `Vision für OpenStack Clouds <https://governance.openstack.org/tc/reference/technical-vision.html>`_ welche den kompletten Designumfang einer OpenStack Cloud und die Prinzipien von Cloud Plattformen im Allgemeinen und OpenStack im Speziellen, welche jeder Service in OpenStack folgen soll.
id: OpenStack adalah paket perangkat lunak yang menyediakan platform cloud untuk cloud Public dan Private yang mencakup berbagai kasus penggunaan termasuk Enterprise dan Telecom. Fokus utamanya adalah cloud Infrastructure as a Service (IaaS) dan layanan tambahan yang dibangun di atas IaaS. Komite Teknis mempertahankan `vision for OpenStack clouds <https://governance.openstack.org/tc/reference/technical-vision.html>` _ yang menggambarkan ruang lingkup desain keseluruhan untuk cloud OpenStack dan prinsip-prinsip platform cloud di umum, dan OpenStack pada khususnya, bahwa setiap layanan dalam OpenStack diharapkan untuk diikuti.
ko_kr: OpenStack은 엔터프라이즈 및 Telecom을 비롯한 다양한 사용 사례를 다루는 퍼블릭 및 프라이빗 클라우드를 위한 클라우드 플랫폼을 제공하는 소프트웨어 패키지입니다. 주요 초점은 IaaS(Infrastructure as a Service) 클라우드와 IaaS를 기반으로 구축된 추가 서비스에 있습니다. 기술 위원회는 OpenStack 클라우드에 대한 전반적인 설계 범위와 일반적으로 클라우드 플랫폼의 원리, 특히 OpenStack 내의 각 서비스가 따라야 할 것으로 예상되는 `OpenStack 클라우드 전반에 대한 vision <https://governance.openstack.org/tc/reference/technical-vision.html>`_ 을 계속 유지하고 있습니다.

source: OpenStack provides an ecosystem for collaboration. It has infrastructure for
de: OpenStack bietet ein Ökosystem für die Zusammenarbeit. Es verfügt über eine Infrastruktur für
id: OpenStack menyediakan ekosistem untuk kolaborasi. Ini memiliki infrastruktur untuk
ko_kr: OpenStack은 협업을 위한 에코시스템과 그에 대한 인프라를 갖추고 있습니다.

source: OpenStack/OpenInfra Days
de: OpenStack/OpenInfra Tage
ko_kr: OpenStack/OpenInfra Days입니다.

source: Operators Meetup
id: Pertemuan Operator
ko_kr: 운영자 밋업

source: Option 1: install using pip with more options::
de: Option 1: Installation mit Pip mit mehr Optionen::
id: Opsi 1: instal menggunakan pip dengan lebih banyak opsi ::
ko_kr: 옵션 1: 더 많은 옵션과 함께 pip을 사용하여 설치합니다.

source: Option 2: Use the package manager `Homebrew <https://brew.sh>`_, and type in a terminal::
de: Option 2: Verwenden Sie den Paketmanager `Homebrew <https://brew.sh>`_, und geben Sie in einem Terminal ein::
id: Opsi 2: Gunakan manajer paket `Homebrew <https://brew.sh>` _, dan ketikkan di terminal ::
ko_kr: 옵션 2: 패키지 관리자 `Homebru <https://brew.sh>`_ 을 사용하여 터미널에 다음을 입력합니다.

source: Or if you created a separate key pair, assuming the example name above::
de: Oder wenn Sie ein separates Schlüsselpaar erstellt haben, wobei Sie den Beispielnamen oben annehmen::
id: Atau jika Anda membuat pasangan kunci terpisah, dengan asumsi nama contoh di atas ::
ko_kr: 또는 별도의 키 쌍을 생성한 경우 위의 예 이름을 가정하여 다음을 수행합니다.

source: PTGs are scheduled at the beginning of each release cycle which makes it possible to do more thorough release planning and ensure that the more complicated proposals are discussed with all the affected teams.
de: PTGs werden zu Beginn jedes Release-Zyklus geplant, was eine gründlichere Release-Planung ermöglicht und sicherstellt, dass die komplexeren Vorschläge mit allen betroffenen Teams diskutiert werden.
id: PTG dijadwalkan pada awal setiap siklus rilis yang memungkinkan untuk melakukan perencanaan rilis yang lebih menyeluruh dan memastikan bahwa proposal yang lebih rumit dibahas dengan semua tim yang terkena dampak.
ko_kr: PTG는 각 릴리스 주기가 시작될 때마다 예약되므로 보다 철저한 릴리스 계획을 수립할 수 있으며, 보다 복잡한 제안이 모든 관련 팀과 논의될 수 있습니다.

source: Participate in regular meetings with the above groups.
de: Nehmen Sie an regelmäßigen Treffen mit den oben genannten Gruppen teil.
id: Berpartisipasilah dalam pertemuan rutin dengan kelompok-kelompok di atas.
ko_kr: 위의 그룹과 함께 정기 회의에 참여하세요.

source: Participating as a Mentee
de: Teilnahme als Mentee
id: Berpartisipasi sebagai Mentee
ko_kr: 멘티로 참여

source: Participating as a Mentor
de: Als Mentor teilnehmen
id: Berpartisipasi sebagai Mentor
ko_kr: 멘토로 참여

source: Paste the public key into the **Add SSH Public Key** text box and click **Add**.
de: Fügen Sie den öffentlichen Schlüssel in das Textfeld **Add SSH Public Key** ein und klicken Sie auf **Add**.
id: Rekatkan (paste) kunci publik ke dalam kotak teks **Add SSH Public Key** dan klik **Add**.
ko_kr: 공용 키를 **SSH 공용 키 추가** 텍스트 상자에 붙여넣고 **추가** 를 클릭합니다.

source: Preparing to Send a Review
de: Vorbereitung zum Senden einer Rezension
id: Bersiap untuk Mengirim Ulasan
ko_kr: 리뷰를 보낼 준비

source: Project Team Lead (PTL)
de: Projektteamleitung (PTL)
ko_kr: 프로젝트 팀 리드(PTL)

source: Project Team Leads are `elected <https://governance.openstack.org/tc/reference/charter.html#election-for-ptl-seats>`_ for each release cycle by Active Project Contributors: individuals who have contributed to the project in the last two release cycles.
de: Projektteamleiter werden für jeden Release-Zyklus `gewählt <https://governance.openstack.org/tc/reference/charter.html#election-for-ptl-seats>`_ von aktiven Projektmitarbeitern: Personen, die in den letzten beiden Release-Zyklen zum Projekt beigetragen haben.
id: Pimpinan Tim Proyek adalah `elected <https://governance.openstack.org/tc/reference/charter.html#election-for-ptl-seats>`_ untuk setiap siklus rilis oleh Active Project Contributors: individu yang telah berkontribusi pada proyek dalam dua siklus rilis terakhir.
ko_kr: 프로젝트 팀 리더는 최근 두 번의 릴리스 사이클 동안 프로젝트에 기여한 각 개인에 의해 각 릴리스 주기에 대해 `선출 <https://governance.openstack.org/tc/reference/charter.html#election-for-ptl-seats>`_ 됩니다.

source: Project teams do point releases off stable branches when enough changes accumulate in the stable branch to justify creating another release for their project.
id: Tim proyek menunjuk rilis dari cabang stabil ketika perubahan yang cukup menumpuk di cabang stabil untuk membenarkan membuat rilis lain untuk proyek mereka.
ko_kr: 프로젝트 팀은 프로젝트에 대한 다른 릴리즈를 만드는 것을 정당화하기 위해 안정적인 분기에 충분한 변경 사항이 누적될 때 포인트 릴리즈를 수행합니다.

source: Push `Specifications <https://specs.openstack.org>`_
de: Push `Spezifikationen <https://specs.openstack.org>`_
id: Dorong `Specifications <https://specs.openstack.org>`_
ko_kr: `사양 <https://specs.openstack.org>`_ 을 누릅니다.

source: Push `Use cases for features <https://specs.openstack.org/openstack/openstack-user-stories/>`_
id: Dorong `Use cases for features <https://specs.openstack.org/openstack/openstack-user-stories/>`_
ko_kr: `Use cases for features <https://specs.openstack.org/openstack/openstack-user-stories/>`_ 을 누릅니다.

source: Push and test `code, docs, infrastructure changes, and CI configurations <https://opendev.org/explore/repos>`_
id: Tekan dan uji kode, dokumen, perubahan infrastruktur, dan konfigurasi CI<https://opendev.org/explore/repos>`_
ko_kr: `코드, 문서, 인프라 변경 및 CI 구성 <https://opendev.org/explore/repos>`_ 을 푸시 및 테스트합니다.

source: Read through the presented individual member terms of service and our `Community Code of Conduct <https://www.openstack.org/legal/community-code-of-conduct/>`_.
de: Lesen Sie die vorliegenden individuellen Nutzungsbedingungen für Mitglieder und unseren `Verhaltenskodex der Gemeinschaft <https://www.openstack.org/legal/community-code-of-conduct/>`_.
id: Baca melalui persyaratan layanan anggota individual yang disajikan dan kami `Community Code of Conduct <https://www.openstack.org/legal/community-code-of-conduct/>`_.
ko_kr: 제시된 개인 구성원 서비스 약관 및 `Community Code of Conduct <https://www.openstack.org/legal/community-code-of-conduct/>`_ 전반을 읽어봅니다.

source: Reference
de: Referenz
id: Referensi
ko_kr: 참조

source: Register Your Nick Name
de: Registrieren Sie Ihren Nick-Namen
id: Daftarkan Nama Panggilan Anda
ko_kr: 닉네임을 등록

source: Release Models
de: Freigabemodelle
id: Model Rilis
ko_kr: 릴리즈 모델

source: Release Schedule and Planning
de: Release-Terminplan und Planung
id: Jadwal dan Perencanaan Rilis
ko_kr: 릴리즈 계획과 스케줄

source: Releases
de: Veröffentlichungen
id: Rilis
ko_kr: 릴리즈

source: Report bugs
de: Fehler melden
id: Laporkan bug
ko_kr: 버그 보고

source: Requirements for the official OpenStack projects are listed `in the wiki of the Technical Commitee <https://governance.openstack.org/tc/reference/new-projects-requirements.html>`_.
de: Die Anforderungen für die offiziellen OpenStack-Projekte sind `im Wiki des Technical Commitee <https://governance.openstack.org/tc/reference/new-projects-requirements.html>`_ aufgeführt.
id: Persyaratan untuk proyek OpenStack resmi terdaftar `in the wiki of the Technical Commitee <https://governance.openstack.org/tc/reference/new-projects-requirements.html>`_.
ko_kr: 공식 OpenStack 프로젝트의 요구사항은 `기술 위원회 <https://governance.openstack.org/tc/reference/new-projects-requirements.html>`_ 의 위키에 나열되어 있습니다.

source: Reviewing bug reports and deciding about their priority
de: Überprüfung von Fehlerberichten und Entscheidung über deren Priorität
id: Meninjau laporan bug dan memutuskan tentang prioritasnya
ko_kr: 버그 보고서를 검토하고 우선 순위를 결정합니다.

source: Reviewing changes and approving them when it meets the design and coding or documentation standards of the project
de: Überprüfung und Genehmigung von Änderungen, wenn sie den Design-, Programmier- oder Dokumentationsstandards des Projekts entsprechen
id: Meninjau perubahan dan menyetujuinya ketika memenuhi desain dan standar pengkodean atau dokumentasi proyek
ko_kr: 프로젝트의 설계 및 코딩 또는 문서화 표준을 충족하는 경우 변경 사항을 검토하고 승인합니다.

source: Roles
de: Rollen
id: Peran (Roles)
ko_kr: 역할

source: Run for elected positions in the OpenStack project.
de: Laufen Sie für gewählte Positionen im OpenStack-Projekt.
id: Jalankan untuk posisi terpilih dalam proyek OpenStack.
ko_kr: OpenStack 프로젝트에서 선출 가능한 자리에 지원.

source: SSH keys are always generated in pairs:
de: SSH-Schlüssel werden immer paarweise generiert:
id: Kunci SSH selalu dibuat berpasangan:
ko_kr: SSH 키는 항상 쌍으로 생성됩니다.

source: Set up IRC on Linux & Windows
de: IRC unter Linux & Windows einrichten
id: Atur IRC di Linux & Windows
ko_kr: Linux & Windows에서 IRC를 설정합니다.

source: Set up IRC on Mac OS
de: IRC auf Mac OS einrichten
id: Atur IRC pada Mac OS
ko_kr: Mac OS에서 IRC를 설정합니다.

source: Setting Up Your Gerrit Account
de: Einrichten Ihres Gerrit-Kontos
id: Menyiapkan Akun Gerrit Anda
ko_kr: Gerrit 계정 설정

source: Setup IRC
de: IRC einrichten
id: Pengaturan IRC
ko_kr: IRC 설치

source: Setup SSH Keys
de: Einrichten von SSH-Schlüsseln
id: Atur Kunci SSH
ko_kr: SSH 키 설정

source: Setup Your Task Tracker Account
de: Einrichten Ihres Task Tracker-Kontos
id: Siapkan akun Task Tracker Anda
ko_kr: 작업 추적기 계정을 설정합니다.

source: Setup and Learn GIT
de: Einrichten und Erlernen von GIT
id: Siapkan dan Pelajari GIT
ko_kr: 설정과 GIT 배우기

source: Sign Up
de: Registrieren
id: Sign Up (mendaftar)
ko_kr: 회원가입

source: Signing it
de: Unterzeichnung
id: Menandatanganinya
ko_kr: 서명

source: Similar to being a mentor, the first thing you'll want to do is sign up using this `mentee form <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_menteess>`_. This will help us know who is participating and what their goals are.
de: Ähnlich wie ein Mentor zu sein, ist das erste, was Sie tun möchten, sich mit diesem `Formular anzumelden <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_menteess>`_. Dies wird uns helfen zu wissen, wer teilnimmt und was seine Ziele sind.
id: Mirip dengan menjadi seorang mentor, hal pertama yang ingin Anda lakukan adalah mendaftar menggunakan ini `mentee form <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_menteess>`_. Ini akan membantu kami mengetahui siapa yang berpartisipasi dan apa tujuan mereka.
ko_kr: 멘토가 되는 것과 비슷하게, 여러분이 가장 먼저 하고 싶은 일은 `멘티 양식 <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_menteess>`_ 을 사용하여 등록하는 것입니다. 이것은 누가 참여하고 있고 그들의 목표가 무엇인지 아는 데 도움이 될 것입니다.

source: Software
id: Software (perangkat lunak)
ko_kr: 소프트웨어

source: Some people choose to use one SSH key pair to access many systems while others prefer to use separate key pairs. Both options are covered in the following sections.
de: Einige Leute entscheiden sich dafür, ein SSH-Schlüsselpaar für den Zugriff auf viele Systeme zu verwenden, während andere es vorziehen, separate Schlüsselpaare zu verwenden. Beide Optionen werden in den folgenden Abschnitten behandelt.
id: Beberapa orang memilih untuk menggunakan satu pasangan kunci SSH untuk mengakses banyak sistem sementara yang lain lebih suka menggunakan pasangan kunci yang terpisah. Kedua opsi dibahas di bagian berikut.
ko_kr: 많은 시스템에 액세스하기 위해 SSH 키 쌍을 사용하는 사람도 있고 별도의 키 쌍을 사용하는 사람도 있습니다. 두 가지 옵션은 모두 다음 절에서 다룹니다.

source: Some projects also have different dates through a release cycles as internal, project-specific deadlines, like spec-freeze or code-freeze. You need to make sure you are aware of the freeze dates which you can find on the `release schedule page <https://releases.openstack.org>`_.
de: Einige Projekte haben auch unterschiedliche Termine durch einen Release-Zyklus als interne, projektspezifische Termine, wie Spec-Freeze oder Code-Freeze. Sie müssen sicherstellen, dass Sie über die Einfrierdaten informiert sind, die Sie auf der Seite `Release schedule page <https://releases.openstack.org>`_ finden.
id: Beberapa proyek juga memiliki tanggal yang berbeda melalui siklus rilis sebagai tenggat waktu internal dan spesifik proyek, seperti pembekuan spesifikasi atau pembekuan kode. Anda harus memastikan bahwa Anda mengetahui tanggal pembekuan yang dapat Anda temukan di halaman jadwal rilis <https://releases.openstack.org>`_.
ko_kr: 또한 일부 프로젝트에는 내부 프로젝트별 마감 시한(예: 사양 동결 또는 코드 동결)으로 릴리스 주기를 통과하는 날짜가 다릅니다. 당신은 당신이 `release schedule page <https://releases.openstack.org>`_ 에서 찾을 수 있는 동결 날짜를 알고 있어야 합니다.

source: Special Interest Groups
de: Besondere Interessengruppen (SIG)
id: Kelompok Minat Khusus (Special Interest Groups)
ko_kr: 특별한 그룹

source: Stable Branches
ko_kr: 안정화 버전

source: Stable branches are kept as a safe source of fixes for high impact bugs and security issues which have been fixed, on master, since the release occurred. Given the stable nature of these branches, backports to stable branches undergo additional scrutiny when they are proposed. Proposed changes should:
id: Stable branch disimpan sebagai sumber perbaikan yang aman untuk bug berdampak tinggi dan masalah keamanan yang telah diperbaiki, pada master, sejak rilis terjadi. Mengingat sifat stabil dari cabang-cabang ini, backport ke cabang-cabang stabil mengalami pengawasan tambahan ketika diusulkan. Perubahan yang diajukan harus:
ko_kr: 안정적인 분기는 릴리스 발생 이후 마스터에 고정된 높은 영향의 버그 및 보안 문제에 대한 안전한 해결책으로 유지됩니다. 이러한 지점의 안정적인 특성을 고려할 때, 안정적인 지점에 대한 백포트는 제안될 때 추가적인 정밀 조사를 받습니다. 제안된 변경 사항은 다음과 같습니다.
