Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: Can publish to `docs.openstack.org <https://docs.openstack.org/>`_ and `developer.openstack.org <https://developer.openstack.org/>`_
de: Kann unter `docs.openstack.org <https://docs.openstack.org/>`_ und `developer.openstack.org <https://developer.openstack.org/>`_ veröffentlichen
id: Dapat mempublikasikan ke `docs.openstack.org <https://docs.openstack.org/>`_ dan `developer.openstack.org <https://developer.openstack.org/>`_
ko_kr: `docs.openstack.org <https://docs.openstack.org/>`_ 에 게시할 수 있습니다. `developer.openstack.org <https://developer.openstack.org/>`_ 에 게시할 수 있습니다.

source: Changes in the gate pipeline are prioritized but also serialized. If a change fails, all tests for changes behind that failing change have to be restarted. If restarts after restarts happen, then resources are never freed up for the check pipeline.
id: Perubahan dalam pipeline gerbang diprioritaskan tetapi juga di-serialkan. Jika perubahan gagal, semua tes untuk perubahan di belakang perubahan yang gagal harus dimulai kembali. Jika restart setelah restart terjadi, maka sumber daya tidak pernah dibebaskan untuk pipeline pemeriksaan.
ko_kr: 게이트 파이프라인의 변경사항이 우선시되지만 직렬화되기도 합니다. 변경에 실패하면 해당 변경 실패 뒤의 변경에 대한 모든 테스트를 다시 시작해야 합니다. 재시작 후 재시작할 경우 체크 파이프라인을 위해 리소스가 확보되지 않습니다.

source: Check For Existing Keys
de: Auf vorhandene Schlüssel prüfen
id: Periksa Untuk Kunci Yang Ada
ko_kr: 기존 키를 확인합니다.

source: Checking Status in Zuul
de: Status in Zuul prüfen
id: Memeriksa Status di Zuul
ko_kr: Zuul에서 상태를 확인

source: Choose a project where you want to contribute with translating. Usually there is a translation plan with priorities on the start page.
de: Wählen Sie ein Projekt, bei dem Sie mit der Übersetzung einen Beitrag leisten möchten. In der Regel gibt es auf der Startseite einen Übersetzungsplan mit Prioritäten.
id: Pilih proyek di mana Anda ingin berkontribusi dengan menerjemahkan. Biasanya ada rencana terjemahan dengan prioritas di halaman awal.
ko_kr: 번역에 기여할 프로젝트를 선택합니다. 보통 시작 페이지에 우선순위가 있는 번역 계획이 있습니다.

source: Choose and type your username carefully. Once it is set, you cannot change the username.
de: Wählen und tippen Sie Ihren Benutzernamen sorgfältig ein. Sobald es einmal eingestellt ist, können Sie den Benutzernamen nicht mehr ändern.
id: Pilih dan ketikkan nama pengguna Anda dengan cermat. Setelah diatur, Anda tidak dapat mengubah nama pengguna.
ko_kr: 사용자 이름을 신중하게 선택하고 입력합니다. 일단 설정되면 사용자 이름을 변경할 수 없습니다.

source: Click the 'Add Key' button.
de: Klicken Sie auf die Schaltfläche "Schlüssel hinzufügen".
id: Klik tombol 'Add Key'.
ko_kr: '키 추가' 버튼을 클릭합니다.

source: Click the **edit** button and
de: Klicken Sie auf die Schaltfläche **bearbeiten** und
id: Klik tombol **edit** dan
ko_kr: **edit** 버튼을 클릭합니다.

source: Code review
de: Codeüberprüfung
id: Code review (ulasan kode)
ko_kr: 코드 검토

source: Commit Messages
de: Commit-Meldungen
id: Pesan Komit
ko_kr: 커밋 메시지

source: Commit messsages are the first things a reviewer sees and are used as descriptions in the git log. They provide a description of the history of changes in a repository. Commit messages cannot be modified once the patch is merged.
de: Commit-Meldungen sind die ersten Dinge, die ein Reviewer sieht und werden als Beschreibungen im Git-Log verwendet. Sie liefern eine Beschreibung der Historie der Änderungen in einem Repository. Commit-Nachrichten können nach dem Zusammenführen des Patches nicht mehr geändert werden.
id: Pesan komit adalah hal pertama yang dilihat oleh pengulas dan digunakan sebagai deskripsi di git log. Mereka memberikan deskripsi tentang sejarah perubahan dalam repositori. Pesan komit tidak dapat diubah setelah patch digabungkan.
ko_kr: 커밋 메시는 검토자가 가장 먼저 보고 git 로그의 설명으로 사용됩니다. 저장소의 변경 내역에 대한 설명을 제공합니다. 패치가 병합된 후에는 커밋 메시지를 수정할 수 없습니다.

source: Committees
de: Gremien
id: Komite
ko_kr: 위원회

source: Communicate with project teams, technical committee, SIGs, and other Working Groups.
de: Kommunikation mit Projektteams, Technical Committee, SIGs und anderen Arbeitsgruppen.
id: Berkomunikasi dengan tim proyek, komite teknis, SIG, dan Kelompok Kerja lainnya.
ko_kr: 프로젝트 팀, 기술 위원회, SIG 및 기타 작업 그룹과 커뮤니케이션할 수 있습니다.

source: Communication
de: Kommunikation
id: Komunikasi
ko_kr: 소통

source: Community
de: Gemeinschaft
id: Masyarakat
ko_kr: 커뮤니티

source: Community members who have engaged in community functions listed in the `related section of the User Committee Charter <https://governance.openstack.org/uc/reference/charter.html#active-user-contributors-auc>`_ are considered to be Active User Contributors.
de: Community-Mitglieder, die sich an Gemeinschaftsfunktionen beteiligt haben, die im `bezogenen Abschnitt der Charta des User Committee <https://governance.openstack.org/uc/reference/charter.html#active-user-contributors-auc>`_ aufgeführt sind, gelten als aktive Nutzer-Mitwirkende.
id: Anggota masyarakat yang telah terlibat dalam fungsi masyarakat yang tercantum dalam `related section of the User Committee Charter <https://governance.openstack.org/uc/reference/charter.html#active-user-contributors-auc>`_ dianggap sebagai Kontributor Pengguna Aktif.
ko_kr: `사용자 위원회 헌장 <https://governance.openstack.org/uc/reference/charter.html#active-user-contributors-auc>`_ 의 관련 섹션에 열거된 커뮤니티 기능에 종사해 온 커뮤니티 구성원은 적극적인 사용자 기여자로 간주됩니다.

source: Community-organized Events
de: Von der Gemeinschaft organisierte Veranstaltungen
id: Acara yang diselenggarakan masyarakat
ko_kr: 커뮤니티가 주관하는 이벤트입니다.

source: Conference
de: Liga
id: Konferensi
ko_kr: 컨퍼런스

source: Configuration
de: Konfiguration
id: Konfigurasi
ko_kr: 설정

source: Configure Git
de: Git konfigurieren
id: Konfigurasikan Git
ko_kr: GIT 설정

source: Contribute as a Translator
de: Als Übersetzer mitwirken
id: Berkontribusi sebagai Penerjemah
ko_kr: 번역가로서 기여

source: Contributors From a Company or Organization
de: Mitwirkende eines Unternehmens oder einer Organisation
id: Kontributor Dari Perusahaan atau Organisasi
ko_kr: 회사 또는 조직의 기여자

source: Contributors From the U.S. Government
de: Mitwirkende der US-Regierung
id: Kontributor Dari Pemerintah A.S.
ko_kr: 미국 정부의 기여자

source: Contributors get to vote in the Technical Committee election
de: Die Mitwirkenden dürfen bei der Wahl des Technischen Komitees abstimmen
id: Kontributor dapat memilih dalam pemilihan Komite Teknis
ko_kr: 기고자들은 기술 위원회 선거에서 투표할 수 있습니다.

source: Copy Public Key
de: Öffentlichen Schlüssel kopieren
id: Salin Kunci Publik
ko_kr: 공개 키를 복사합니다.

source: Core Reviewer
id: Core Reviewer (peninjau inti)
ko_kr: 코드 리뷰어

source: Core reviewers are responsible for:
de: Die Core Reviewer sind verantwortlich für:
id: Peninjau inti bertanggung jawab untuk:
ko_kr: 핵심 검토자는 다음을 담당합니다.

source: Core reviewers have '+/-2' and 'W+1' rights in Gerrit that is required for blocking or approving a patch.
de: Core Reviewer haben die Rechte '+/-2' und 'W+1' an Gerrit, die für die Blockierung oder Genehmigung eines Patches erforderlich sind.
id: Core reviewers memiliki hak '+/-2' and 'W+1' di Gerrit yang diperlukan untuk memblokir atau menyetujui patch.
ko_kr: 핵심 검토자는 Gerritt에서 패치를 차단하거나 승인하는 데 필요한 '+/-2' 및 'W+1' 권한을 가집니다.

source: Create stories for new features (Process varies per project)
de: Erstellen von Stories für neue Features (Prozess variiert projektbezogen)
id: Buat cerita untuk fitur baru (Proses bervariasi per proyek)
ko_kr: 새로운 기능에 대한 사례 작성(프로세스마다 다릅니다)

source: Defining and maintaining the project mission
de: Definition und Aufrechterhaltung der Projektaufgabe
id: Menentukan dan memelihara misi proyek
ko_kr: 프로젝트 미션을 정의하고 유지합니다.

source: Depending on what time zone you are based in there might be more traffic on some channels than others. Have a little patience when waiting for people to respond.
id: Tergantung pada zona waktu tempat Anda berada, mungkin ada lebih banyak lalu lintas di beberapa saluran daripada yang lain. Memiliki sedikit kesabaran ketika menunggu orang merespons.
ko_kr: 현재 사용 중인 시간대에 따라 일부 채널의 트래픽이 다른 채널보다 많을 수 있습니다. 사람들이 반응하기를 기다릴 때 약간의 인내심을 가지세요.

source: Deploy your first Cloud: Mentors will provide assistance to mentees deploying OpenStack for the first time. This could involve analysis of available deployment tools, configuration, or troubleshooting.
de: Stellen Sie Ihre erste Cloud bereit: Mentoren unterstützen Mentees, die OpenStack zum ersten Mal einsetzen. Dies kann die Analyse der verfügbaren Bereitstellungstools, die Konfiguration oder die Fehlersuche beinhalten.
id: Sebarkan Cloud pertama Anda: Mentor akan memberikan bantuan kepada mentees yang menyebarkan OpenStack untuk pertama kalinya. Ini bisa melibatkan analisis alat penyebaran yang tersedia, konfigurasi, atau pemecahan masalah.
ko_kr: 첫 번째 클라우드 구축: 멘토들은 OpenStack을 처음 구현하는 멘티에게 도움을 제공합니다. 여기에는 사용 가능한 배포 도구, 구성 또는 문제 해결의 분석이 포함될 수 있습니다.

source: Documentation
de: Dokumentation
id: Dokumentasi
ko_kr: 문서화

source: Documentation is very important for the community so you can find guidelines about how to install and use the services developed by the project teams on the `documentation website for OpenStack <https://docs.openstack.org>`_.
de: Die Dokumentation ist für die Community sehr wichtig, daher finden Sie Richtlinien zur Installation und Nutzung der von den Projektteams entwickelten Dienste auf der `Dokumentations-Website für OpenStack <https://docs.openstack.org>`_.
id: Dokumentasi sangat penting bagi masyarakat sehingga Anda dapat menemukan pedoman tentang cara menginstal dan menggunakan layanan yang dikembangkan oleh tim proyek di `documentation website for OpenStack <https://docs.openstack.org>`_.
ko_kr: 문서화는 커뮤니티에 매우 중요하므로 프로젝트 팀이 개발한 `Openstack을 위한 서비스를 설치하고 사용하는 방법에 대한 지침을 <https://docs.openstack.org>`_ 웹 사이트에서 찾을 수 있습니다.

source: Done
de: Erledigt
ko_kr: 완료

source: Each project and working group has its own IRC channel. The common syntax for naming the IRC channels is: #openstack-<name-of-project>. See the `list of OpenStack-related IRC channels <http://eavesdrop.openstack.org/#channels>`__.
de: Jedes Projekt und jede Arbeitsgruppe hat ihren eigenen IRC-Kanal. Die gebräuchliche Syntax für die Benennung der IRC-Kanäle lautet: #openstack-<name-of-project>. Siehe die `Liste der OpenStack-bezogenen IRC-Kanäle <http://eavesdrop.openstack.org/#channels>`__.
id: Setiap proyek dan kelompok kerja memiliki saluran IRC sendiri. Sintaks umum untuk menamai saluran IRC adalah: #openstack-<name-of-project>. Lihat `list of OpenStack-related IRC channels <http://eavesdrop.openstack.org/#channels>`__.
ko_kr: 각 프로젝트와 작업 그룹에는 자체 IRC 채널이 있습니다. IRC 채널의 이름을 지정하는 일반적인 구문은 #openstack-<name-of-project>입니다. `OpenStack 관련 IRC 채널 목록 <http://eavesdrop.openstack.org/#channels>`_ 을 참조하세요.

source: Each project and working group has its own `wiki page <https://wiki.openstack.org/wiki/Main_Page>`__. Wiki pages are a secondary source of information. They hold information that is subject to more change than the info provided in the project's documentation i.e. meeting agendas, team members, etc.
de: Jedes Projekt und jede Arbeitsgruppe hat ihre eigene `Wiki-Seite <https://wiki.openstack.org/wiki/Main_Page>`__. Wiki-Seiten sind eine sekundäre Informationsquelle. Sie verfügen über Informationen, die mehr geändert werden können als die in der Projektdokumentation angegebenen Informationen, z.B. Sitzungspläne, Teammitglieder usw.
id: Setiap proyek dan kelompok kerja memiliki sendiri `wiki page <https://wiki.openstack.org/wiki/Main_Page>`__. Halaman wiki adalah sumber informasi sekunder. Mereka menyimpan informasi yang dapat berubah lebih banyak daripada info yang disediakan dalam dokumentasi proyek, misal. agenda rapat, anggota tim, dll.
ko_kr: 각 프로젝트와 작업 그룹에는 각각 `wiki 페이지 <https://wiki.openstack.org/wiki/Main_Page>`_ 가 있습니다. 위키 페이지는 보조 정보 소스입니다. 이들은 프로젝트 문서에 제공된 정보(예: 회의 안건, 팀 구성원 등)보다 더 많은 변경 사항이 적용되는 정보를 보유합니다.

source: Each project is different in the process of reporting bugs and planning new features. There are however two main tools that projects use: Launchpad and Storyboard.
de: Jedes Projekt ist anders, wenn es darum geht, Fehler zu melden und neue Funktionen zu planen. Es gibt jedoch zwei Hauptwerkzeuge, die Projekte verwenden: Launchpad und Storyboard.
id: Setiap proyek berbeda dalam proses pelaporan bug dan perencanaan fitur baru. Namun ada dua alat utama yang digunakan proyek: Launchpad dan Storyboard.
ko_kr: 프로젝트마다 버그를 보고하고 새로운 기능을 계획하는 프로세스가 다릅니다. 그러나 프로젝트에서 사용하는 두 가지 주요 도구가 있습니다. Launchpad와 Storyboard입니다.

source: Edit Nick Name Settings
de: Bearbeiten der Einstellungen für den Nick-Namen
id: Edit Pengaturan Nama Nick
ko_kr: 닉네임 설정을 편집

source: Edit Server Settings
de: Servereinstellungen bearbeiten
id: Edit Pengaturan Server
ko_kr: 서버 설정 편집

source: Eligibility to Vote in Elections
id: Eligibility to Vote in Elections (Kelayakan Memilih di Pemilu)
ko_kr: 선거에서 투표할 자격

source: Employers can update the list of authorized employees by filling out and signing an `Updated Schedule A Form <https://openstack.echosign.com/public/hostedForm?formid=56JUVP6K4Z6P4C>`_.
de: Arbeitgeber können die Liste der autorisierten Mitarbeiter aktualisieren, indem sie ein `Updated Schedule A Form <https://openstack.echosign.com/public/hostedForm?formid=56JUVP6K4Z6P4C>`_ ausfüllen und unterschreiben.
id: Pengusaha dapat memperbarui daftar karyawan resmi dengan mengisi dan menandatangani `Updated Schedule A Form <https://openstack.echosign.com/public/hostedForm?formid=56JUVP6K4Z6P4C>`_.
ko_kr: 고용주는 `업데이트된 일정 A 양식 <https://openstack.echosign.com/public/hostedForm?formid=56JUVP6K4Z6P4C>`_ 을 작성하여 서명함으로써 공인된 직원의 목록을 업데이트할 수 있습니다.

source: Empty line
de: Leere Zeile
ko_kr: 공백

source: End of Life (EOL)
ko_kr: 생명끝(EOL)

source: Ethercalc is a simple collaborative spreadsheet. It works in a similar way as Etherpad, but it is more useful to facilitate distributed booking or scheduling of resources. The starting page of OpenStack Ethercalc is `here <https://ethercalc.openstack.org/>`_.
de: Ethercalc ist eine einfache kollaborative Tabellenkalkulation. Es funktioniert ähnlich wie Etherpad, aber es ist nützlicher, die verteilte Buchung oder Planung von Ressourcen zu erleichtern. Die Startseite von OpenStack Ethercalc ist `hier <https://ethercalc.openstack.org/>`_.
id: Ethercalc adalah spreadsheet kolaboratif sederhana. Ini bekerja dengan cara yang mirip dengan Etherpad, tetapi lebih berguna untuk memfasilitasi pemesanan atau penjadwalan sumber daya yang didistribusikan. Halaman awal OpenStack Ethercalc adalah `here <https://ethercalc.openstack.org/>`_.
ko_kr: Ethercalcul은 간단한 협업 스프레드시트입니다. Etherpad와 유사한 방식으로 작동하지만 분산 예약 또는 자원 스케줄링을 용이하게 하는 것이 더 유용합니다. OpenStack Ethercalck의 시작 페이지는 `여기 <https://ethercalc.openstack.org/>`_ 입니다.

source: Etherpad is a simple collaborative text editor. It is used as a common place to have people in a project collaborate on larger projects and planning of events. There is no master list of etherpads - it is harder to find what you are looking for without having looked at it before or without asking for the URL. It is recommended to bookmark the important etherpads for later reference. The starting page of the OpenStack Etherpad is `this <https://etherpad.openstack.org>`_.
de: Etherpad ist ein einfacher, kollaborativer Texteditor. Es wird als gemeinsamer Ort genutzt, an dem Menschen in einem Projekt an größeren Projekten und der Planung von Veranstaltungen zusammenarbeiten. Es gibt keine Masterliste von Etherpads - es ist schwieriger, das Gesuchte zu finden, ohne es vorher angesehen zu haben oder ohne nach der URL zu fragen. Es wird empfohlen, die wichtigen Etherpads zur späteren Verwendung mit einem Lesezeichen zu versehen. Die Startseite des OpenStack Etherpad ist `diese <https://etherpad.openstack.org>`_.
id: Etherpad adalah editor teks kolaboratif sederhana. Ini digunakan sebagai tempat umum untuk mengajak orang-orang dalam suatu proyek berkolaborasi pada proyek yang lebih besar dan perencanaan acara. Tidak ada daftar induk etherpads - lebih sulit untuk menemukan apa yang Anda cari tanpa melihatnya sebelum atau tanpa meminta URL. Disarankan untuk menandai etherpads penting untuk referensi nanti. Halaman awal OpenStack Etherpad is `this <https://etherpad.openstack.org>`_.
ko_kr: Etherpad는 간단한 협업 텍스트 편집기입니다. 프로젝트의 사람들이 더 큰 프로젝트 및 이벤트 계획에서 공동 작업을 수행하는 일반적인 장소로 사용됩니다. 에테르패드의 마스터 목록이 없습니다. URL을 요청하지 않고 또는 이전에 살펴보지 않고 찾고 있는 항목을 찾기가 더 어렵습니다. 나중에 참조할 수 있도록 중요한 에테르패드를 즐겨찾기에 추가하는 것이 좋습니다. OpenStack Etherpad의 시작 페이지는 `this <https://etherpad.openstack.org>`_ 입니다.

source: Etherpads and Ethercalcs
de: Etherpads und Ethercalcs
id: Etherpads dan Ethercalcs
ko_kr: Etherpad와 Ethercalcolcs입니다.

source: Events
de: Veranstaltungen
id: Acara
ko_kr: 이벤트

source: Extended Maintenance
ko_kr: 확장 유지보수

source: Fill in your email address, name, password, and accepting the terms of services.
de: Geben Sie Ihre E-Mail-Adresse, Ihren Namen, Ihr Passwort und die Bedingungen für die Dienste ein.
id: Isi alamat email Anda, nama, kata sandi, dan terima persyaratan layanan.
ko_kr: 이메일 주소, 이름, 암호 및 서비스 약관을 입력합니다.

source: Fill in your home address. This will be only visible to foundation members.
de: Geben Sie Ihre Privatadresse ein. Dies ist nur für die Foundation-Mitglieder sichtbar.
id: Isi alamat rumah Anda. Ini hanya akan terlihat oleh anggota foundation.
ko_kr: 주소를 기입하세요. 이것은 Foundation 멤버만 볼 수 있습니다.

source: Fill in your name, e-mail address, and gender. Use the same e-mail address at every step of the registration procedure. This address will also be used as your login. Your gender information is available via public API.
de: Geben Sie Ihren Namen, Ihre E-Mail-Adresse und Ihr Geschlecht ein. Verwenden Sie bei jedem Schritt des Registrierungsvorgangs die gleiche E-Mail-Adresse. Diese Adresse wird auch als Login verwendet. Ihre Geschlechterinformationen sind über eine öffentliche API verfügbar.
id: Isi nama Anda, alamat e-mail, dan jenis kelamin. Gunakan alamat e-mail yang sama di setiap langkah prosedur pendaftaran. Alamat ini juga akan digunakan sebagai login Anda. Informasi jenis kelamin Anda tersedia melalui API publik.
ko_kr: 이름, 전자우편 주소, 성별을 입력합니다. 등록 절차의 모든 단계에서 동일한 전자우편 주소를 사용합니다. 이 주소는 로그인으로도 사용됩니다. 성별 정보는 공개 API를 통해 확인할 수 있습니다.

source: Fill in your password and check the box next to 'I'm not a robot'.
de: Geben Sie Ihr Passwort ein und kreuzen Sie das Kästchen neben "Ich bin kein Roboter" an.
id: Isi kata sandi Anda dan centang kotak di sebelah 'I'm not a robot'.
ko_kr: 암호를 입력하고 '나는 로봇이 아니다' 옆의 상자에 체크 표시를 하십시오.

source: Finally you need to tell ssh what host(s) to associate SSH keys with. To do this open "~/.ssh/config" in an editor, create the file if it doesn't exist and add something like::
de: Schließlich müssen Sie ssh mitteilen, mit welchem Host (welchen Hosts) SSH-Schlüssel verknüpft werden sollen. Um dies zu tun, öffnen Sie "~/.ssh/config" in einem Editor, erstellen Sie die Datei, wenn sie nicht existiert, und fügen Sie etwas wie::
id: Terakhir, Anda perlu memberi tahu ssh host apa yang mengaitkan kunci SSH. Untuk melakukan ini buka "~/.ssh/config" di editor, buat file jika tidak ada dan tambahkan sesuatu seperti ::
ko_kr: 마지막으로 SSH 키를 연결할 호스트를 SSH에 알려야 합니다. 이렇게 하려면 편집기에서 "~/.ssh/config"를 열려면 파일이 없는 경우 파일을 만들고 다음과 같은 파일을 추가합니다.

source: First CFP submission or Give your first talk: Mentors will assist mentees with submitting a CFP and preparing to give a talk. This could be for OpenStack Summit, OpenStack Days, a local meetup, or another conference or event.
de: Erste Einreichung der CFP oder Halten Sie Ihren ersten Vortrag: Die Mentoren unterstützen die Mentees bei der Einreichung einer CFP und bei der Vorbereitung eines Vortrags. Dies kann für den OpenStack Summit, die OpenStack Days, ein lokales Treffen oder eine andere Konferenz oder Veranstaltung sein.
id: Pengajuan CFP pertama atau Berikan ceramah pertama Anda: Mentor akan membantu mentees dengan mengirimkan CFP dan bersiap untuk menyampaikan ceramah. Ini bisa untuk OpenStack Summit, OpenStack Days, pertemuan lokal, atau konferensi atau acara lain.
ko_kr: 첫 번째 CFP 제출 또는 첫 번째 강연을 합니다. 멘토들은 멘티들이 CFP를 제출하고 강연을 준비하는데 도움을 줄 것입니다. 이는 OpenStack Summit, OpenStack Days, 로컬 미팅 또는 다른 컨퍼런스 또는 이벤트에 대한 것일 수 있습니다.

source: Footers
ko_kr: 바닥글

source: Footers are lines in the final paragraph of a commit message, used to link the change to other tools.
id: Footer adalah baris di paragraf terakhir dari pesan komit, digunakan untuk menghubungkan perubahan ke alat lain.
ko_kr: 바닥글은 커밋 메시지의 마지막 단락에 있는 선으로, 변경사항을 다른 도구에 연결하는 데 사용됩니다.

source: Footers should be entered one per line with no empty lines between them.
id: Footer harus dimasukkan satu per baris tanpa ada baris kosong di antaranya.
ko_kr: 바닥글 사이에 빈 줄이 없이 한 줄에 하나씩 입력해야 합니다.

source: For Fedora 22 or later open a terminal and type::
de: Für Fedora 22 oder höher öffnen Sie ein Terminal und geben Sie ein::
id: Untuk Fedora 22 atau lebih baru buka terminal dan ketik ::
ko_kr: Fedora 22 이상의 경우 터미널을 열고 다음을 입력하십시오.

source: For SUSE distributions open a terminal and type::
de: Für SUSE-Distributionen öffnen Sie ein Terminal und geben Sie ein::
id: Untuk distribusi SUSE, buka terminal dan ketik ::
ko_kr: SUSE 배포의 경우 터미널을 열고 다음을 입력하십시오.

source: For Windows environment, download latest Hexchat installation binary from `Hexchat download <https://hexchat.github.io/downloads.html>`__ and install it. You will probably also need extra components shown just under Hexchat.
de: Für Windows-Umgebungen laden Sie die neueste Hexchat-Installationsbinärdatei von `Hexchat download <https://hexchat.github.io/downloads.html>`__ herunter und installieren Sie sie. Sie werden wahrscheinlich auch zusätzliche Komponenten benötigen, die direkt unter Hexchat angezeigt werden.
id: Untuk lingkungan Windows, unduh biner instalasi Hexchat terbaru dari `Hexchat download <https://hexchat.github.io/downloads.html>`__ dan pasang. Anda mungkin juga perlu komponen tambahan yang ditampilkan tepat di bawah Hexchat.
ko_kr: Windows 환경의 경우 `Hexchat 다운로드 <https://hexchat.github.io/downloads.html>`_ 에서 최신 Hexchat 설치 바이너리를 다운로드하여 설치합니다. Hexchat 바로 아래에 표시된 추가 구성 요소도 필요할 수 있습니다.

source: For a Linux distributions like Debian, Ubuntu, or Mint open a terminal and type::
de: Für eine Linux-Distribution wie Debian, Ubuntu oder Mint öffnen Sie ein Terminal und geben Sie ein::
id: Untuk distribusi Linux seperti Debian, Ubuntu, atau Mint, buka terminal dan ketik ::
ko_kr: Debian, Ubuntu 또는 Mint와 같은 Linux 배포의 경우 터미널을 열고 다음을 입력합니다.

source: For a Linux distributions like Redhat, Fedora 21 or earlier, or CentOS open a terminal and type::
de: Für eine Linux-Distribution wie Redhat, Fedora 21 oder früher, oder CentOS öffnen Sie ein Terminal und geben Sie ein::
id: Untuk distribusi Linux seperti Redhat, Fedora 21 atau sebelumnya, atau CentOS, buka terminal dan ketik ::
ko_kr: Linux 배포의 경우 Redhat, Fedora 21 이전 버전 또는 Cent를 사용합니다.OS에서 터미널을 열고 다음을 입력합니다.

source: For distributions like Debian, Ubuntu, or Mint open a terminal and type::
de: Für Distributionen wie Debian, Ubuntu oder Mint öffnen Sie ein Terminal und geben Sie ein::
id: Untuk distribusi seperti Debian, Ubuntu, atau Mint buka terminal dan ketik ::
ko_kr: Debian, Ubuntu 또는 Mint와 같은 배포의 경우 터미널을 열고 다음을 입력하십시오.

source: For distributions like RedHat, Fedora 21 or earlier, or CentOS open a terminal and type::
de: Für Distributionen wie RedHat, Fedora 21 oder früher, oder CentOS öffnen Sie ein Terminal und geben Sie ein::
id: Untuk distribusi seperti RedHat, Fedora 21 atau sebelumnya, atau CentOS buka terminal dan ketik ::
ko_kr: RedHat, Fedora 21 이전 또는 Cent와 같은 분포의 경우OS에서 터미널을 열고 다음을 입력하십시오.
