Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: The Open Infrastructure Foundation organizes multiple events per year to bring together the community as well as companies and individuals interested in the technology and to embrace and encourage open collaboration.
id: Open Infrastructure Foundation menyelenggarakan banyak acara per tahun untuk menyatukan komunitas serta perusahaan dan individu yang tertarik dengan teknologi dan untuk merangkul serta mendorong kolaborasi terbuka.

source: The `Summits <https://www.openstack.org/summit/>`_ are annual events with thousands of attendees from all around the globe. The event occasions are alternating somewhere between North America, Europe and Asia.
id: The `Summits <https://www.openstack.org/summit/>`_ adalah acara tahunan dengan ribuan peserta dari seluruh dunia. Acara acara bergantian di suatu tempat antara Amerika Utara, Eropa dan Asia.

source: The teams get space at `Open Infrastructure Summits <https://www.openstack.org/summit/>`_ and `Project Team Gatherings (PTG) <https://www.openstack.org/ptg/>`_
id: Tim mendapatkan ruang di `Open Infrastructure Summits <https://www.openstack.org/summit/>`_ and `Project Team Gatherings (PTG) <https://www.openstack.org/ptg/>`_

source: This section explains how you can install an IRC program called Colloquy.
de: Dieser Abschnitt erklärt, wie Sie ein IRC-Programm namens Colloquy installieren können.
id: Bagian ini menjelaskan bagaimana Anda dapat menginstal program IRC yang disebut Colloquy.

source: To see how OpenStack and further Open Infrastructure Foundation projects are utilized you will find exhibitors at the Market Place area.
id: Untuk melihat bagaimana OpenStack dan proyek Open Infrastructure Foundation selanjutnya digunakan, Anda akan menemukan peserta pameran di area Market Place.

source: Type in a different user/nick name as shown in the previous step.
de: Geben Sie einen anderen Benutzer/Nicknamen ein, wie im vorherigen Schritt gezeigt.
id: Ketikkan nama pengguna / nama panggilan yang berbeda seperti yang ditunjukkan pada langkah sebelumnya.

source: Type the following to register your nick name with nickserv replacing **mysecretpassword** and **test@domain.com** with your own password and email address::
de: Geben Sie Folgendes ein, um Ihren Nicknamen bei nickserv zu registrieren und **mysecretpassword** und **test@domain.com** durch Ihr eigenes Passwort und Ihre eigene E-Mail-Adresse zu ersetzen::
id: Ketikkan yang berikut untuk mendaftarkan nama samaran Anda dengan nickserv yang menggantikan **mysecretpassword** dan **test@domain.com** dengan kata sandi dan alamat email Anda sendiri ::

source: An OpenStack Foundation account allows you to:
de: Mit einem OpenStack Foundation-Konto können Sie:

source: An agreement to clarify intellectual property rights granted with contributions from a person or entity. `Preview the full agreement <https://review.openstack.org/static/cla.html>`_.
de: Eine Vereinbarung zur Klärung der Rechte an geistigem Eigentum, die mit Beiträgen einer natürlichen oder juristischen Person gewährt werden. `Sehen Sie sich die vollständige Vereinbarung an <https://review.openstack.org/static/cla.html>`_.

source: Commit code to OpenStack via Gerrit.
de: Übertragen Sie den Code über Gerrit an OpenStack.

source: For registration and login you need an :doc:`OpenStack Foundation Account <accounts>`. Click on *LogIn* on `translate.openstack.org <https://translate.openstack.org/>`_ and follow the process for applying your Zanata profile.
de: Für die Registrierung und Anmeldung benötigen Sie einen :doc:`OpenStack Foundation Account <accounts>`. Klicken Sie auf *LogIn* auf `translate.openstack.org <https://translate.openstack.org/>`_ und folgen Sie dem Prozess zur Anmeldung Ihres Zanata-Profils.

source: Get marketing from the OpenStack Foundation
de: Erhalten Marketing von der OpenStack Foundation

source: Go to `Gerrit's SSH Public Keys settings <https://review.openstack.org/#/settings/ssh-keys>`_.
de: Gehen Sie zu `Gerrits SSH Public Keys Einstellungen <https://review.openstack.org/#/settings/ssh-keys>`_.

source: Go to the `OpenStack Foundation sign up page <https://www.openstack.org/join>`_.
de: Gehen Sie zur `Anmeldeseite der OpenStack Foundation <https://www.openstack.org/join>`_.

source: If you don't know what your Gerrit username is, you can check the `Gerrit settings <https://review.openstack.org/#/settings/>`_.
de: Wenn Sie nicht wissen, wie Ihr Gerrit-Benutzername lautet, können Sie die `Gerrit-Einstellungen <https://review.openstack.org/#/settings/>`_ überprüfen.

source: In Gerrit's `settings <https://review.openstack.org/#/settings/agreements>`_ click the **New Contributor Agreement** link and sign the agreement.
de: Klicken Sie in Gerrits `settings <https://review.openstack.org/#/settings/agreements>`_ auf den Link **Neue Beitragsvereinbarung** und unterschreiben Sie die Vereinbarung.

source: In Gerrit's `settings <https://review.openstack.org/#/settings/agreements>`_ click the **New Contributor Agreement** link and sign the agreement. You need this to contribute code & documentation. You will not be able to push patches to Gerrit without this.
de: Klicken Sie in Gerrits `settings <https://review.openstack.org/#/settings/agreements>`_ auf den Link **Neue Beitragsvereinbarung** und unterschreiben Sie die Vereinbarung. Sie benötigen dies, um Code und Dokumentation beizutragen. Ohne diese Funktion können Sie keine Patches an Gerrit senden.

source: In order to push things to `Gerrit <https://review.openstack.org>`_ we need to have a way to identify ourselves. We will do this using SSH keys which allows us to have our machine we're pushing a change from to perform a `challenge-response authentication <https://en.wikipedia.org/wiki/Challenge-response_authentication>`_ with the Gerrit server.
de: Um die Dinge zu `Gerrit <https://review.openstack.org>`_ zu bringen, brauchen wir einen Weg, uns zu identifizieren. Wir werden dies mit SSH-Schlüsseln tun, die es uns ermöglichen, unsere Maschine zu haben, von der wir eine Änderung vorantreiben, um eine `Challenge-Response-Authentifizierung <https://en.wikipedia.org/wiki/Challenge-response_authentication>`_ mit dem Gerrit-Server durchzuführen.

source: Look for meet-ups in your area and if you cannot find one you can go ahead and organize!
de: Suchen Sie nach Treffen in Ihrer Nähe und wenn Sie keins finden, können Sie es organisieren!

source: OpenStack/Open Infrastructure Summit
de: OpenStack/Open Infrastruktur Gipfel

source: Push and test `code, docs, infrastructure changes, and CI configurations <https://git.openstack.org/cgit>`_
de: Push und Test von Code, Dokumenten, Infrastrukturänderungen und CI-Konfigurationen <https://git.openstack.org/cgit>`_

source: Setup Your OpenStack Foundation Account
de: Einrichten Ihres OpenStack Foundation-Kontos

source: Someone of authority needs to sign the `U.S. Government Contributor License Agreement <https://wiki.openstack.org/wiki/GovernmentCLA>`_. Contact the `OpenStack Foundation <mailto:communitymngr@openstack.org>`_ to initiate this process.
de: Jemand von der Behörde muss den `Lizenzvertrag für Beitragszahler der US-Regierung unterzeichnen <https://wiki.openstack.org/wiki/GovernmentCLA>`_. Kontaktieren Sie die `OpenStack Foundation <mailto:communitymngr@openstack.org>`_, um diesen Prozess einzuleiten.

source: Tags are references used to link the change to other tools.
de: Tags sind Referenzen, die verwendet werden, um die Änderung mit anderen Werkzeugen zu verknüpfen.

source: Tags should be entered one per line.
de: Tags sollten einmal pro Zeile eingegeben werden.

source: The OpenStack Foundation is a non-profit "whose purpose is to develop, support, protect, and promote" OpenStack. It has a set of `bylaws <https://www.openstack.org/legal/bylaws-of-the-openstack-foundation/>`_ and a board of directors. The Foundation has three types of members, defined by the bylaws. Each of the types -- Platinum, Gold and Individual -- are represented on a Board of Directors. Currently there are 24 directors, eight of each type.
de: Die OpenStack Foundation ist eine gemeinnützige Organisation, "deren Zweck es ist, OpenStack zu entwickeln, zu unterstützen, zu schützen und zu fördern". Es hat eine Reihe von `Statuten <https://www.openstack.org/legal/bylaws-of-the-openstack-foundation/>`_ und einen Vorstand. Die Foundation hat drei Arten von Mitgliedern, die durch die Satzung festgelegt sind. Jeder der Typen Platin, Gold und Einzel sind in einem Board of Directors vertreten. Derzeit gibt es 24 Direktoren, acht von jeder Art.

source: The OpenStack Foundation organizes multiple events per year to bring together the community as well as companies and individuals interested in the technology and to embrace and encourage open collaboration.
de: Die OpenStack Foundation organisiert mehrere Veranstaltungen pro Jahr, um die Community sowie an der Technologie interessierte Unternehmen und Einzelpersonen zusammenzubringen und eine offene Zusammenarbeit zu fördern.

source: The `PTG <https://www.openstack.org/ptg/>`_ is one week long with working sessions organized in parallel tracks. The week is devided between Working Group, SIG, cross-project and project team sessions and further sessions dedicated to operations related discussions.
de: Das `PTG <https://www.openstack.org/ptg/>`_ ist eine Woche lang mit parallel stattfindenden Arbeitssitzungen. Die Woche gliedert sich in Arbeitsgruppen-, SIG-, projektübergreifende und Projektteamsitzungen sowie weitere Sitzungen, die sich mit operativen Diskussionen befassen.

source: The `Summits <https://www.openstack.org/summit/other-summits/>`_ are bi-annual events with thousands of attendees from all around the globe. The event in Spring is located in North America and the Fall occasions are alternating somewhere between Europe and Asia.
de: Die `Summits <https://www.openstack.org/summit/other-summits/>`_ sind halbjährliche Veranstaltungen mit Tausenden von Teilnehmern aus aller Welt. Die Veranstaltung im Frühjahr findet in Nordamerika statt und die Herbstanlässe wechseln irgendwo zwischen Europa und Asien.

source: The ``APIImpact`` tag contains a comment about why the change impacts a public HTTP API. Put APIImpact on a line by itself. Use this tag to indicate that the patch impacts a public HTTP API. When this tag is included in a commit message, the API_Working_Group can use it to help find relevant reviews.
de: Das ``APIImpact`` Tag enthält einen Kommentar, warum die Änderung Auswirkungen auf eine öffentliche HTTP-API hat. Setzen Sie APIImpact auf eine Linie von selbst. Verwenden Sie dieses Tag, um anzuzeigen, dass der Patch Auswirkungen auf eine öffentliche HTTP-API hat. Wenn dieses Tag in einer Commit-Meldung enthalten ist, kann die API_Working_Group es verwenden, um bei der Suche nach relevanten Bewertungen zu helfen.

source: The ``Change-id`` line is a unique hash describing the change, which is generated automatically by a Git commit hook. This should not be changed when rebasing a commit following review feedback, since it is used by Gerrit, to track versions of a patch.
de: Die Zeile ``Change-id`` ist ein eindeutiger Hash, der die Änderung beschreibt, der automatisch durch einen Git Commit-Hook erzeugt wird. Dies sollte beim Rebasieren eines Commits nach einem Review-Feedback nicht geändert werden, da es von Gerrit verwendet wird, um Versionen eines Patches zu verfolgen.

source: The ``Depends-On``: <gerrit-change-url> tag is used to refer to a change the current one depends on. Use the permalink of the change.
de: Das ``Depends-On``: <gerrit-change-url> Tag wird verwendet, um auf eine Änderung hinzuweisen, von der die aktuelle Änderung abhängt. Verwenden Sie den Permalink der Änderung.

source: The ``DocImpact`` tag contains a comment about why the change impacts documentation. Put DocImpact on a line by itself. Use this tag to indicate that documentation is either contained in the patch or has documentation impact. When this tag is included in a commit message, Gerrit creates a bug for the project affected by the change for task tracking, or move to the openstack-api-site as needed.
de: Das Tag ``DocImpact`` enthält einen Kommentar, warum die Änderung die Dokumentation beeinflusst. Setzen Sie DocImpact auf eine Linie von selbst. Verwenden Sie dieses Tag, um anzuzeigen, dass die Dokumentation entweder im Patch enthalten ist oder Auswirkungen auf die Dokumentation hat. Wenn dieses Tag in einer Commit-Nachricht enthalten ist, erstellt Gerrit einen Fehler für das von der Änderung betroffene Projekt zur Aufgabenverfolgung oder wechselt bei Bedarf zur Openstack-api-Site.

source: The ``SecurityImpact`` tag is used to indicate that a change has security implications and should be reviewed by the OpenStack Security Group.
de: Das Tag ``SecurityImpact`` wird verwendet, um anzuzeigen, dass eine Änderung Auswirkungen auf die Sicherheit hat und sollte von der OpenStack Security Group überprüft werden.

source: The ``UpgradeImpact`` tag contains a comment about why the change impacts upgrades. It is used to indicate that a change has upgrade implications for those doing continuous deployment or N to N+1 upgrades. Also consider updating the 'Upgrade Notes' section in the release notes for the affected project.
de: Das Tag ``UpgradeImpact`` enthält einen Kommentar, warum sich die Änderung auf Upgrades auswirkt. Es wird verwendet, um anzuzeigen, dass eine Änderung Auswirkungen auf das Upgrade hat, wenn Sie ein kontinuierliches Deployment oder N auf N+1 Upgrades durchführen. Erwägen Sie auch, den Abschnitt "Upgrade Notes" in den Versionshinweisen für das betroffene Projekt zu aktualisieren.

source: The event is occasionally co-located with the OpenStack Summit, in which case it is accessible to Summit attendees as well as a standalone event.
de: Die Veranstaltung findet gelegentlich in Verbindung mit dem OpenStack Summit statt, in diesem Fall ist sie für die Teilnehmer des Gipfels zugänglich und als eigenständige Veranstaltung konzipiert.

source: The following tags are optional; however, their use is recommended if they are applicable to the patch:
de: Die folgenden Tags sind optional; ihre Verwendung wird jedoch empfohlen, wenn sie auf den Patch anwendbar sind:

source: The following tags are required:
de: Die folgenden Tags sind erforderlich:

source: The teams get space at `OpenStack Summits <https://www.openstack.org/summit/>`_ and `Project Team Gatherings (PTG) <https://www.openstack.org/ptg/>`_
de: Die Teams erhalten Platz bei `OpenStack Summits <https://www.openstack.org/summit/>`_ und `Project Team Gatherings (PTG) <https://www.openstack.org/ptg/>`_

source: To see how OpenStack and further OpenStack Foundation projects are utilized you will find exhibitors at the Market Place area.
de: Um zu sehen, wie OpenStack und weitere Projekte der OpenStack Foundation genutzt werden, finden Sie Aussteller im Bereich Marktplatz.

source: Under individual members, click the **Foundation Member** button.
de: Klicken Sie unter den einzelnen Mitgliedern auf die Schaltfläche **Foundation Member**.

source: Visit `OpenStack's Gerrit page <https://review.openstack.org>`_ and click the **sign in** link.
de: Besuchen Sie die `Gerrit-Seite von OpenStack <https://review.openstack.org>`_ und klicken Sie auf den Link **sign in**.

source: When you have changes in an OpenStack project repository, you can use this sub-command to have the changes posted to `Gerrit <https://review.openstack.org/>`__ so that they can be reviewed.
de: Wenn Sie Änderungen in einem OpenStack-Projekt-Repository haben, können Sie mit diesem Unterbefehl die Änderungen auf `Gerrit <https://review.openstack.org/>`__ posten lassen, damit sie überprüft werden können.

source: While working with OpenStack, IRC is the best way to get real time help or support others. Details of how to get on IRC are described in :ref:`setup-irc`.
de: Während der Zusammenarbeit mit OpenStack ist IRC der beste Weg, um Hilfe in Echtzeit zu erhalten oder andere zu unterstützen. Details zur Nutzung des IRC sind in :ref:`setup-irc` beschrieben.

source: `Ask OpenStack <https://ask.openstack.org/>`__ is a question and answer site for OpenStack users and developers. It provides answer to almost every question a new contributor can run into. It is possible to collect karma points by asking or answering questions. The questions are moderated by Ask OpenStack users with high Karma points. More info about Ask OpenStack is available on its `about page <https://ask.openstack.org/en/about/>`__ and on the `ask moderators wiki <https://wiki.openstack.org/wiki/Community/AskModerators>`__.
de: `Ask OpenStack <https://ask.openstack.org/>`__ ist eine Frage- und Antwortseite für OpenStack-Anwender und -Entwickler. Es gibt Antworten auf fast jede Frage, auf die ein neuer Mitwirkender stoßen kann. Es ist möglich, Karma-Punkte zu sammeln, indem man Fragen stellt oder beantwortet. Die Fragen werden von Ask OpenStack-Anwendern mit hohen Karma-Punkten moderiert. Weitere Informationen über Ask OpenStack finden Sie auf der `Übersichtsseite <https://ask.openstack.org/en/about/>`__ und im `ask Moderatoren-Wiki <https://wiki.openstack.org/wiki/Community/AskModerators>`__.

source: `Code, docs, infrastructure changes, and CI configurations <https://git.openstack.org/cgit>`_
de: `Code, Dokumente, Infrastrukturänderungen und CI-Konfigurationen <https://git.openstack.org/cgit>`_

source: `OpenDev <http://opendevconf.com>`_ is a small event designed for discussing new innovative technologies and use cases that are relevant to open infrastructure like Edge Computing or CI/CD.
de: `OpenDev <http://opendevconf.com>`_ ist eine kleine Veranstaltung zur Diskussion neuer innovativer Technologien und Anwendungsfälle, die für offene Infrastrukturen wie Edge Computing oder CI/CD relevant sind.

source: `OpenStack Days <https://www.openstack.org/community/events/openstackdays>`_ events are similar to the OpenStack Summits that are organized by the local community, users groups and companies.
de: `OpenStack Days <https://www.openstack.org/community/events/openstackdays>`_ Veranstaltungen ähneln den OpenStack Summits, die von der lokalen Community, Anwendergruppen und Unternehmen organisiert werden.

source: `Translations <https://git.openstack.org/cgit/openstack/i18n/tree/>`_
de: `Übersetzungen <https://git.openstack.org/cgit/openstack/i18n/tree/>`_

source: ``Implements``: Use this tag if the change fully implements a Launchpad blueprint. Use the name of the blueprint as an ID.
de: ``Implements``: Verwenden Sie dieses Tag, wenn die Änderung einen Launchpad-Blueprints vollständig implementiert. Verwenden Sie den Namen des Blueprints als ID.

source: ``Partial-Implements``: Use this tag if the change partially implements a Launchpad blueprint. Use the name of the blueprint as an ID.
de: ``Partial-Implements``: Verwenden Sie dieses Tag, wenn die Änderung teilweise einen Launchpad-Blueprint implementiert. Verwenden Sie den Namen des Blueprints als ID.

source: ``Story``: 1234567: the number of the story in Storyboard to which the task being implemented belongs.
de: ``Story``: 1234567: die Nummer der Story im Storyboard, zu der die zu implementierende Aufgabe gehört.

source: ``Task``: 1234: the number of the task in Storyboard implemented by the change.
de: ``Task``: 1234: die Nummer der Aufgabe im Storyboard, die durch die Änderung implementiert wurde.
