Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-code-and-documentation.po
Languages: de, id, ko_kr, zh_cn

source: `Unclassified failed integrated gate jobs <http://status.openstack.org/elastic-recheck/data/integrated_gate.html>`_ and `Unclassified failed jobs <http://status.openstack.org/elastic-recheck/data/others.html>`_
de: Nicht klassifizierte fehlgeschlagene integrierte Gate-Jobs <http://status.openstack.org/elastic-recheck/data/integrated_gate.html>``_ und ` Nicht klassifizierte fehlgeschlagene Jobs <http://status.openstack.org/elastic-recheck/data/others.html>``_
id: `Unclassified failed integrated gate jobs <http://status.openstack.org/elastic-recheck/data/integrated_gate.html>`_ dan `Unclassified failed jobs <http://status.openstack.org/elastic-recheck/data/others.html>`_
ko_kr: `분류되지 않은 실패한 통합 게이트 작업 <http://status.openstack.org/elastic-recheck/data/integrated_gate.html>`_ 및 `분류되지 않은 실패한 작업 <http://status.openstack.org/elastic-recheck/data/others.html>`_

source: depending on which jobs you're interested in.
de: je nachdem, für welche Jobs Sie sich interessieren.
id: tergantung pada pekerjaan yang Anda minati.
ko_kr: 어떤 작업에 관심이 있느냐에 따라서.

source: elastic-recheck also has a page to show how many failures were encountered that do not have a matching fingerprint. Typically the more failures that go uncategorized the more unstable the gate is (and OpenStack as a whole).
de: elastic-recheck hat auch eine Seite, die anzeigt, wie viele Fehler aufgetreten sind, die keinen passenden Fingerabdruck haben. Typischerweise ist das Gate umso instabiler, je mehr Fehler nicht kategorisiert werden (und OpenStack als Ganzes).
id: elastic-recheck juga memiliki halaman untuk menunjukkan berapa banyak kegagalan yang ditemui yang tidak memiliki fingerprint yang cocok. Biasanya semakin banyak kegagalan yang tidak dikategorikan, semakin tidak stabil gate tersebut (dan OpenStack secara keseluruhan).
ko_kr: elastic-recheck에는 일치하는 지문이없는 오류가 발생한 횟수를 보여주는 페이지도 있습니다. 일반적으로 분류되지 않은 실패가 많을수록 게이트나 OpenStack이 더 불안정합니다.

source: elastic-recheck is a tool used to track failures in test jobs. It keeps a repository of fingerprints for known bugs that are affecting jobs in the gate. It is then used to both track the rates those bugs are being found and also to leave comments in gerrit and in IRC when it has found a known bug fingerprint in a failure.
de: Der Elasticitätsnachweis ist ein Werkzeug zur Verfolgung von Fehlern bei Prüfaufträgen. Es speichert ein Repository mit Fingerabdrücken für bekannte Fehler, die sich auf Jobs im Gate auswirken. Es wird dann verwendet, um sowohl die Rate zu verfolgen, mit der diese Fehler gefunden werden, als auch um Kommentare in Gerrit und im IRC zu hinterlassen, wenn es bei einem Fehler einen bekannten Fehler-Fingerabdruck gefunden hat.
id: elastic-recheck adalah alat yang digunakan untuk melacak kegagalan dalam pekerjaan pengujian. Itu menyimpan repositori fingerprint untuk bug yang diketahui yang mempengaruhi pekerjaan di gate. Kemudian digunakan untuk melacak tingkat bug yang ditemukan dan juga untuk meninggalkan komentar di gerrit dan di IRC ketika telah menemukan bug fingerprint yang diketahui gagal.
ko_kr: elastic-recheck는 테스트 작업의 실패를 추적하는 데 사용되는 도구입니다. 게이트의 작업에 영향을 미치는 알려진 버그에 대한 지문 저장소를 유지합니다. 그런 다음 버그가 발견되는 비율을 추적하고 오류에서 알려진 버그 지문을 발견 한 경우 gerrit 및 IRC에 코멘트를 남기는 데 사용됩니다.

source: elastic-recheck is built on top of an ELK (`Elastic Search <https://github.com/elastic/elasticsearch>`_, `Logstash <https://github.com/elastic/logstash>`_, `Kibana <https://github.com/elastic/kibana>`_) stack where we use Logstash to store all logs from CI jobs in an Elastic Search cluster. We also host a `Kibana dashboard <http://logstash.openstack.org/>`_ which can be used to run queries on the cluster and interacts with the data. elastic-recheck queries the elastic-search cluster for the fingerprints.
id: elastic-recheck dibangun di atas ELK (`Elastic Search <https://github.com/elastic/elasticsearch>`_, `Logstash <https://github.com/elastic/logstash>` _, `Kibana <https://github.com/elastic/kibana> `_) stack di mana kami menggunakan Logstash untuk menyimpan semua log dari pekerjaan CI dalam sebuah cluster Elastic Search. Kami juga meng-host `Kibana dashboard <http://logstash.openstack.org/>` _ yang dapat digunakan untuk menjalankan kueri pada cluster dan berinteraksi dengan data. elastic-search kembali permintaan pencarian elastis untuk sidik jari.
ko_kr: elastic-recheck는 ELK `Elastic Search <https://github.com/elastic/elasticsearch>`_ , `Logstash <https://github.com/elastic/logstash>`_ , `Kibana <https://github.com/elastic/kibana>`_ 스택에서 Logstash를 사용하여 Elastic Search 클러스터에 CI 작업의 모든 로그를 저장합니다. 또한 클러스터에서 쿼리를 실행하고 데이터와 상호 작용하는 데 사용할 수있는 `Kibana 대시 보드 <http://logstash.openstack.org/>`_ 를 호스팅합니다. elastic-recheck는 Elastic-search 클러스터에 지문을 쿼리합니다.

source: etc.
de: ``/etc/glance`` und ``/var/log/glance`` folgen den gleichen Regeln wie ihre nova-Pendants.
ko_kr: 기타.
zh_cn: 等等

source: mysql and rabbitmq are configured
de: mysql und rabbitmq sind konfiguriert.
id: mysql dan rabbitmq dikonfigurasi
ko_kr: mysql 및 rabbitmq가 구성됩니다
zh_cn: 配置mysql和rabbitmq

source: A detailed description of the documentation tools and processes can be found in the `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`_.
de: Eine detaillierte Beschreibung der Dokumentationswerkzeuge und -prozesse finden Sie im `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>``_.
id: Penjelasan terperinci tentang alat dan proses dokumentasi dapat ditemukan di `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`_.

source: There is a `Sandbox project <https://launchpad.net/openstack-dev-sandbox>`_ available there which is created to track bugs and issues related to the openstack-dev/sandbox repository.
de: Es gibt dort ein `Sandbox-Projekt <https://launchpad.net/openstack-dev-sandbox>``_, das erstellt wurde, um Fehler und Probleme im Zusammenhang mit dem openstack-dev/sandbox-Repository zu verfolgen.
id: Ada proyek `Sandbox project <https://launchpad.net/openstack-dev-sandbox>`_ tersedia di sana yang dibuat untuk melacak bug dan masalah yang berkaitan dengan repositori openstack-dev/sandbox.

source: This is a quick start version. For a more in depth description of how to clone, create a patch and push the change, directions can be `found here <https://docs.openstack.org/infra/manual/developers.html#starting-work-on-a-new-project>`_
de: Dies ist eine Schnellstartversion. Für eine ausführlichere Beschreibung, wie man klont, einen Patch erstellt und die Änderung vorantreibt, finden Sie hier eine `Wegbeschreibung <https://docs.openstack.org/infra/manual/developers.html#starting-work-on-a-new-project>`_.
id: Ini adalah versi mulai cepat. Untuk deskripsi yang lebih mendalam tentang cara mengkloning, membuat patch dan mendorong perubahan, arah bisa ditemukan disini `found here <https://docs.openstack.org/infra/manual/developers.html#starting-work-on-a-new-project>`_

source: This tutorial walks through a simple scenario of developing multiple change sets in a series on the same branch. If you wish, you can follow along, using the `sandbox repository <https://opendev.org/openstack-dev/sandbox/>`_, executing the commands exactly as they're laid out.
id: Tutorial ini membahas skenario sederhana untuk mengembangkan beberapa set perubahan dalam seri di cabang yang sama. Jika Anda mau, Anda bisa mengikuti, menggunakan `sandbox repository <https://opendev.org/openstack-dev/sandbox/>` _, menjalankan perintah persis seperti yang mereka buat.

source: To get DevStack you will need to clone it from the ``devstack`` repository under ``openstack-dev``.
de: Um DevStack zu erhalten, müssen Sie es aus dem ``devstack``Repository unter ``openstack-dev`` kopieren.
id: Untuk mendapatkan DevStack Anda harus mengkloningnya dari repositori ``devstack`` di bawah ``openstack-dev``.

source: You can find a `sandbox Git repository <https://opendev.org/openstack-dev/sandbox>`_ where you can practice the Git commands before you put together a patch to resolve a bug or implement a new functionality.
id: Anda dapat menemukan repositori `sandbox Git <https://opendev.org/openstack-dev/sandbox>` _ di mana Anda dapat mempraktikkan perintah Git sebelum Anda membuat patch untuk menyelesaikan bug atau mengimplementasikan fungsionalitas baru.

source: After proposing changes, you can track them at `Code Review <https://review.openstack.org>`_. After logging in, you will see a dashboard of "Outgoing reviews" for changes you have proposed, "Incoming reviews" for changes you are reviewing, and "Recently closed" changes for which you were either a reviewer or owner.
de: Nachdem Sie Änderungen vorgeschlagen haben, können Sie diese unter `Code Review <https://review.openstack.org>``_ verfolgen. Nach dem Einloggen sehen Sie ein Dashboard mit "Outgoing reviews" für Änderungen, die Sie vorgeschlagen haben, "Ingoing reviews" für Änderungen, die Sie überprüfen, und "Recently closed", für die Sie entweder Reviewer oder Eigentümer waren.

source: It is possible to check out other contributors' patches from Gerrit and even `make changes to them`_; however, you should always discuss any changes with the contributor before you start working on their patch.
de: Es ist möglich, die Patches anderer Mitwirkender von Gerrit auszulesen und sogar Änderungen an ihnen vorzunehmen; jedoch sollten Sie alle Änderungen immer mit dem Mitwirkenden besprechen, bevor Sie mit der Arbeit an ihrem Patch beginnen.

source: Launchpad is deprecated and will be superseeded by StoryBoard.
de: Das Launchpad ist veraltet und wird vom StoryBoard ersetzt.

source: Most often, some deadline has passed and since no more changes are being accepted till the new release development begins, the patch is `being held`.
de: Meistens ist eine Frist verstrichen und da bis zum Beginn der Entwicklung des neuen Releases keine Änderungen mehr akzeptiert werden, wird der Patch `gehalten`.

source: Once you've identified a message in the logs that can be used for fingerprinting you need to turn that into an elastic-search query. You can use any of the existing fingerprints as an example: `openstack-infra/elastic-recheck <https://git.openstack.org/cgit/openstack-infra/elastic-recheck/tree/queries>`_
de: Sobald Sie eine Nachricht in den Protokollen identifiziert haben, die für den Fingerabdruck verwendet werden kann, müssen Sie diese in eine elastische Suchanfrage umwandeln. Sie können jeden der vorhandenen Fingerabdrücke als Beispiel verwenden: `openstack-infra/elastic-recheck <https://git.openstack.org/cgit/openstack-infra/elastic-recheck/tree/queries>``_

source: Reviewing changes is often suggested as a way to get started on a project. Whether this is how you choose to get started or not, it's an important community activity. See `How to Review Changes the OpenStack Way`_ for more detailed guidance on when to use which votes on a change review.
de: Die Überprüfung von Änderungen wird oft als Einstieg in ein Projekt vorgeschlagen. Egal, ob Sie sich so entscheiden, loszulegen oder nicht, es ist eine wichtige Gemeinschaftsaktivität. Siehe "How to Review Changes the OpenStack Way`_" für detailliertere Informationen darüber, wann welche Stimmen für eine Änderungsprüfung verwendet werden sollen.

source: SandBox Project on Launchpad
de: SandBox-Projekt auf Launchpad

source: The `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`_ describes how to contribute to OpenStack documentation. It contains information on `writing <https://docs.openstack.org/doc-contrib-guide/writing-docs.html>`_, `building <https://docs.openstack.org/doc-contrib-guide/docs-builds.html>`_, and `reviewing <https://docs.openstack.org/doc-contrib-guide/docs-review.html>`_ documents, as well as best practices and `API documentation guidelines <https://docs.openstack.org/doc-contrib-guide/api-guides.html>`_`.
de: Das `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>``_ beschreibt, wie Sie zur OpenStack-Dokumentation beitragen können. Es enthält Informationen über das `Schreiben <https://docs.openstack.org/doc-contrib-guide/writing-docs.html>`_, `Bauen <https://docs.openstack.org/doc-contrib-guide/docs-builds.html>``_ und `Überprüfen <https://docs.openstack.org/doc-contrib-guide/docs-review.html>``_ von Dokumenten, sowie Best Practices und `API-Dokumentationsrichtlinien <https://docs.openstack.org/doc-contrib-guide/api-guides.html>``_`.

source: You can find a `sandbox Git repository <https://git.openstack.org/cgit/openstack-dev/sandbox>`_ where you can practice the Git commands before you put together a patch to resolve a bug or implement a new functionality.
de: Sie finden ein `sandbox Git-Repository <https://git.openstack.org/cgit/openstack-dev/sandbox>``_, wo Sie die Git-Befehle üben können, bevor Sie einen Patch zusammenstellen, um einen Fehler zu beheben oder eine neue Funktionalität zu implementieren.

source: You can find the same respositories using the search function here: `OpenStack git repository browser <https://git.openstack.org/cgit>`_
de: Sie können die gleichen Repositories über die Suchfunktion hier finden: `OpenStack git Repository Browser <https://git.openstack.org/cgit>``_

source: You need as many '^' as the number of the patch you want to edit first from the top of the chain. Gerrit also provides you options to edit the patch itself or only the commit message and a few more for more advanced changes, like modifying the author.
de: Sie benötigen so viele '^' wie die Nummer des Patches, den Sie zuerst von oben in der Kette bearbeiten möchten. Gerrit bietet Ihnen auch die Möglichkeit, den Patch selbst zu bearbeiten oder nur die Commit-Meldung und ein paar weitere für weiterführende Änderungen, wie z.B. die Änderung des Autors.

source: `Tales From the Gate: How Debugging the Gate Helps Your Enterprise <https://www.openstack.org/videos/vancouver-2015/tales-from-the-gate-how-debugging-the-gate-helps-your-enterprise>`_
de: Geschichten vom Gate: Wie das Debuggen des Gates Ihrem Unternehmen hilft <https://www.openstack.org/videos/vancouver-2015/tales-from-the-gate-how-debugging-the-gate-helps-your-enterprise>`_

source: `elastic-recheck queries <https://docs.openstack.org/infra/elastic-recheck/readme.html#queries>`_
de: `elastische Überprüfungsabfragen <https://docs.openstack.org/infra/elastic-recheck/readme.html#queries>``_

source: elastic-recheck is built on top of an ELK (`Elastic Search`_, `Logstash`_, `Kibana`_) stack where we use Logstash to store all logs from CI jobs in an Elastic Search cluster. We also host a `Kibana dashboard`_ which can be used to run queries on the cluster and interacts with the data. elastic-recheck queries the elastic-search cluster for the fingerprints.
de: elastic-recheck basiert auf einem ELK (`Elastic Search`_, `Logstash`_, `Kibana`_) Stapel, in dem wir Logstash verwenden, um alle Protokolle von CI-Aufträgen in einem Elastic Search Cluster zu speichern. Wir hosten auch ein `Kibana Dashboard`_, das verwendet werden kann, um Abfragen auf dem Cluster auszuführen und mit den Daten zu interagieren. elastic-recheck fragt den elastischen Suchcluster nach den Fingerabdrücken ab.
