Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: In OpenStack all the meetings are happening either on generic meeting channels channels like #openstack-meeting, or on specific project channels. Check the `list of meetings <http://eavesdrop.openstack.org/#meetings>`__ for meetings times, IRC channels, and archives of meetings.
de: In OpenStack finden alle Meetings entweder über generische Meeting-Kanäle, wie #openstack-meeting oder über bestimmte Projektkanäle statt. In der `Liste der Meetings <http://eavesdrop.openstack.org/#meetings>`__ finden Sie die Sitzungszeiten, die IRC-Kanäle und die Archive der Meetings.
id: Di OpenStack semua pertemuan terjadi baik pada saluran saluran rapat umum seperti #openstack-meeting, atau pada saluran proyek tertentu. Periksalah `list of meetings <http://eavesdrop.openstack.org/#meetings>`__ untuk waktu rapat, saluran IRC, dan arsip rapat.
ko_kr: OpenStack에서는 #openstack-meeting과 같은 일반적인 미팅 채널이나 특정 프로젝트 채널에서 모든 미팅이 이루어집니다. `회의 시간, IRC 채널, 회의 기록 보관에 대해서는 <http://eavesdrop.openstack.org/#meetings>`_ 를 확인하세요.

source: In a terminal type::
de: In einem Terminal geben Sie ein::
id: Di terminal ketik::
ko_kr: 터미널에서 다음을 입력합니다.

source: In open source projects a contribution can be anything which helps the project to accomplish its mission. In addition to code contribution it can be testing, documentation, requirements gathering, bug reporting and so forth.
de: In Open-Source-Projekten kann ein Beitrag alles sein, was dem Projekt hilft, seine Mission zu erfüllen. Zusätzlich zum Codebeitrag kann es sich um Tests, Dokumentation, Anforderungserfassung, Fehlerberichte und so weiter handeln.
id: Dalam proyek open source, kontribusi dapat berupa apa saja yang membantu proyek untuk mencapai misinya. Selain kontribusi kode dapat berupa pengujian, dokumentasi, pengumpulan persyaratan, pelaporan bug, dan sebagainya.
ko_kr: 오픈 소스 프로젝트에서 기여는 프로젝트가 임무를 완수하는 데 도움이 되는 모든 것이 될 수 있습니다. 코드 기여 외에도 테스트, 문서화, 요구사항 수집, 버그 보고 등이 있습니다.

source: In order to identify yourselves that you own the nick name upon logging in, you need to tell Hexchat to communicate your password upon connecting.
de: Um sich zu identifizieren, dass Sie den Nicknamen beim Einloggen besitzen, müssen Sie Hexchat sagen, dass Hexchat Ihr Passwort beim Verbinden mitteilen soll.
id: Untuk mengidentifikasi diri Anda bahwa Anda memiliki nama panggilan saat masuk, Anda perlu memberi tahu Hexchat untuk mengomunikasikan kata sandi Anda saat menyambungkan.
ko_kr: 로그인할 때 닉네임을 소유한다는 것을 확인하려면 Hexchat에게 연결 시 암호를 전달하도록 지시해야 합니다.

source: In order to push things to `Gerrit <https://review.opendev.org>`_ we need to have a way to identify ourselves. We will do this using SSH keys which allows us to have our machine we're pushing a change from to perform a `challenge-response authentication <https://en.wikipedia.org/wiki/Challenge-response_authentication>`_ with the Gerrit server.
id: Untuk mendorong semuanya ke `Gerrit <https://review.opendev.org>` _ kita perlu memiliki cara untuk mengidentifikasi diri kita sendiri. Kami akan melakukan ini menggunakan kunci SSH yang memungkinkan kami untuk memiliki mesin kami, kami mendorong perubahan dari untuk melakukan `challenge-response authentication <https://en.wikipedia.org/wiki/Challenge-response_authentication>` _ dengan Server Gerrit.
ko_kr: `Gerrit <https://review.opendev.org>`_ 으로 일을 추진하기 위해서는 우리 자신을 확인할 수 있는 방법이 필요합니다. 이 작업은 SSH 키를 사용하여 수행할 것이며, 이를 통해 Gerritt 서버에서 `host-response 인증 <https://en.wikipedia.org/wiki/Challenge-response_authentication>`_ 을 수행하도록 변경하고자 합니다.

source: In some cases there are training sessions and workshops as well and you may see the `OpenStack Upstream Institute <https://docs.openstack.org/upstream-training/>`_ training on the agenda as well.
de: In einigen Fällen gibt es auch Schulungen und Workshops, und Sie können auch das `OpenStack Upstream Institute <https://docs.openstack.org/upstream-training/>`_ Training auf der Agenda sehen.
id: Dalam beberapa kasus ada sesi pelatihan dan lokakarya juga dan Anda mungkin melihat `OpenStack Upstream Institute <https://docs.openstack.org/upstream-training/>`_ pelatihan agenda juga.
ko_kr: 경우에 따라 교육 세션과 워크샵도 진행되며, `OpenStack Upperat Institute <https://docs.openstack.org/upstream-training/>`_ 교육도 의제에 포함될 수 있습니다.

source: In specific cases you can apply for an exception to become an ATC, for further information please see the `relevant section of the Technical Committee Charter <https://governance.openstack.org/tc/reference/charter.html#voters-for-tc-seats-atc>`_.
de: In Einzelfällen können Sie eine Ausnahme als ATC beantragen, weitere Informationen finden Sie im entsprechenden Abschnitt der Satzung des Technical Committee <https://governance.openstack.org/tc/reference/charter.html#voters-for-tc-seats-atc>`_.
id: Dalam kasus tertentu, Anda dapat mengajukan pengecualian untuk menjadi ATC, untuk informasi lebih lanjut silakan lihat `relevant section of the Technical Committee Charter <https://governance.openstack.org/tc/reference/charter.html#voters-for-tc-seats-atc>`_.
ko_kr: 구체적인 경우, ATC가 되기 위한 예외를 신청할 수 있습니다. `자세한 내용은 기술위원회 헌장 <https://governance.openstack.org/tc/reference/charter.html#voters-for-tc-seats-atc>`_ 의 안내 섹션을 참조하십시오.

source: In summary, you will be generating a SSH key pair, and providing the Gerrit server with your public key. With your system holding the private key, it will have no problem replying to Gerrit during the challenge-response authentication.
de: Zusammenfassend lässt sich sagen, dass Sie ein SSH-Schlüsselpaar erzeugen und den Gerrit-Server mit Ihrem öffentlichen Schlüssel versorgen. Da Ihr System den privaten Schlüssel hält, wird es kein Problem haben, Gerrit während der Challenge-Response-Authentifizierung zu antworten.
id: Singkatnya, Anda akan membuat pasangan kunci SSH, dan memberikan server kunci Gerrit kepada Anda. Dengan sistem Anda yang memegang kunci privat, tidak akan ada masalah untuk membalas Gerrit selama otentikasi challenge-response.
ko_kr: 요약하면 SSH 키 쌍을 생성하고 Gerritt 서버에 공용 키를 제공합니다. 시스템에서 개인 키를 보관하면 질문-응답 인증 시 Gerritt에 응답하는 데 문제가 없습니다.

source: In the **Password** put in the password you picked in the previous step and click close.
de: Geben Sie im **Passwort** das im vorherigen Schritt gewählte Passwort ein und klicken Sie auf Schließen.
id: Dalam **Password** masukkan kata sandi yang Anda pilih pada langkah sebelumnya dan klik tutup.
ko_kr: **Password** 에서 이전 단계에서 선택한 암호를 입력하고 close(닫기)를 클릭합니다.

source: Individual Contributor License Agreement
de: Lizenzvereinbarung für einzelne Mitwirkende
id: Individual Contributor License Agreement (perjanjian lisensi kontributor individu)
ko_kr: 개별 기부자 사용권 계약서입니다.

source: Individual Contributors
de: Individuelle Mitwirkende
id: Kontributor Perorangan
ko_kr: 개인 기여자

source: Individual Members of the Foundation who have contributed to any of the official OpenStack project repositories over the last two 6-month release cycles are automatically considered as ATCs.
de: Einzelne Mitglieder der Foundation, die in den letzten beiden 6-monatigen Release-Zyklen an einem der offiziellen OpenStack-Projektablagen mitgewirkt haben, werden automatisch als ATCs betrachtet.
id: Individual Members of the Foundation yang telah berkontribusi pada salah satu repositori proyek OpenStack resmi selama dua siklus rilis 6 bulan terakhir secara otomatis dianggap sebagai ATC.
ko_kr: 지난 2회의 6개월 동안 공식 OpenStack 프로젝트 리포지토리에 기여한 재단의 개별 구성원은 자동으로 ATC로 간주됩니다.

source: Individual members of the foundation vote once a year (usually near the start of the calendar year) for the individual directors. Individuals who wish to join the Foundation can learn more at :ref:`foundation account`.
de: Die einzelnen Mitglieder der Foundation wählen einmal im Jahr (in der Regel zu Beginn des Kalenderjahres) die einzelnen Vorstandsmitglieder. Personen, die der Foundation beitreten möchten, können mehr unter :ref:`foundation account` erfahren.
id: Anggota individu dari foundation memberikan suara setahun sekali (biasanya menjelang awal tahun kalender) untuk masing-masing direktur. Individu yang ingin bergabung dengan Foundation dapat belajar lebih banyak di :ref:`foundation account`.
ko_kr: 재단의 개별 구성원은 1년에 한 번(보통 연도가 시작될 무렵) 개별 이사에게 투표합니다. 재단에 가입하고자 하는 사람은 :ref:`foundation account` 에서 더 많은 것을 배울 수 있습니다.

source: Install an IRC Program
de: Ein IRC-Programm installieren
id: Instal Program IRC
ko_kr: IRC 프로그램을 설치

source: Installation
id: Instalasi
ko_kr: 설치

source: Internet Relay Chat (IRC)
ko_kr: 인터넷 릴레이 채팅(IRC)입니다.

source: Introduction
de: Einführung
id: Pengantar
ko_kr: 소개

source: It also helps with approving changes that had been sitting around with a 6-month-old passing check.
id: Ini juga membantu menyetujui perubahan yang telah berlangsung dengan lulus pemeriksaan 6 bulan.
ko_kr: 또한 6개월의 기간 동안 진행되어 온 변경 사항을 승인하는 데도 도움이 됩니다.

source: It is a good idea to check back on the bug routinely if you aren't actively working on solving it to make sure people haven't asked for more information about the issue. If someone has commented on the bug, try to respond with the details they need.
de: Es ist eine gute Idee, den Fehler regelmäßig zu überprüfen, wenn Sie nicht aktiv an der Lösung arbeiten, um sicherzustellen, dass die Leute nicht nach mehr Informationen über das Problem gefragt haben. Wenn jemand den Fehler kommentiert hat, versuchen Sie, mit den Details zu antworten, die Sie benötigen.
id: Merupakan ide bagus untuk memeriksa kembali bug secara rutin jika Anda tidak secara aktif bekerja menyelesaikannya untuk memastikan orang tidak meminta informasi lebih lanjut tentang masalah ini. Jika seseorang mengomentari bug, cobalah untuk menanggapi dengan detail yang mereka butuhkan.
ko_kr: 사람들이 이 문제에 대해 더 많은 정보를 요청하지 않았는지 확인하기 위해 이 버그를 해결하는 데 적극적으로 노력하지 않는 경우 정기적으로 다시 확인하는 것이 좋습니다. 버그에 대한 주석을 받은 경우 필요한 세부 정보를 사용하여 응답합니다.

source: It is possible to update all of this information except the name and title after the blueprint is registered. When you have finished filling out all of the information you care to include, it is good to communicate with the project team lead that you have filed a blueprint.
de: Es ist möglich, alle diese Informationen mit Ausnahme von Name und Titel nach der Registrierung des Plans zu aktualisieren. Wenn Sie alle Informationen, die Sie angeben möchten, ausgefüllt haben, ist es gut, mit dem Leiter des Projektteams zu kommunizieren, dass Sie einen Blueprint eingereicht haben.
id: Dimungkinkan untuk memperbarui semua informasi ini kecuali nama dan judul setelah cetak biru terdaftar. Ketika Anda telah selesai mengisi semua informasi yang ingin Anda sertakan, ada baiknya berkomunikasi dengan pimpinan tim proyek bahwa Anda telah mengajukan cetak biru.
ko_kr: Blueprint를 등록한 후 이름과 제목을 제외한 모든 정보를 업데이트할 수 있습니다. 포함할 모든 정보를 작성했으면 Blueprint를 작성한 프로젝트 팀 리더와 통신하는 것이 좋습니다.

source: It's also important to note that given that the majority of contributors reside in the United States, channels will likely be quieter outside of United States work hours and it might be a while before they respond.
de: Es ist auch wichtig zu beachten, dass die Kanäle außerhalb der Arbeitszeiten der Vereinigten Staaten ruhiger sein werden, da die Mehrheit der Teilnehmer ihren Wohnsitz in den Vereinigten Staaten hat, und es könnte eine Weile dauern, bis sie reagieren.
id: Penting juga untuk dicatat bahwa mengingat sebagian besar kontributor berada di Amerika Serikat, saluran kemungkinan akan lebih tenang di luar jam kerja Amerika Serikat dan mungkin perlu beberapa saat sebelum mereka merespons.
ko_kr: 또한 기고자의 대다수가 미국에 거주하고 있다는 점을 감안할 때, 미국 이외의 지역에서는 채널이 더 조용해질 가능성이 높고 응답하기까지 시간이 좀 걸릴 수 있다는 점을 유념해야 합니다.

source: Its activities are under the oversight of the Technical Committee
de: Seine Aktivitäten stehen unter der Aufsicht des Technischen Komitees
id: Kegiatannya berada di bawah pengawasan Komite Teknis
ko_kr: 활동은 기술 위원회의 지도를 받을 수 있습니다.

source: Join the Mailing List & IRC Channel
de: Werden Sie Mitglied der Mailingliste & des IRC-Channels
id: Bergabunglah dengan Mailing List & IRC Channel
ko_kr: 메일링 리스트 & IRC 채널에 가입하세요.

source: Know how to participate in groups that interest you and influence the future of OpenStack
de: Wissen, wie man in Gruppen mitwirkt, die Sie interessieren und die Zukunft von OpenStack beeinflussen
id: Ketahui cara berpartisipasi dalam grup yang menarik minat Anda dan memengaruhi masa depan OpenStack
ko_kr: OpenStack의 미래에 관심을 갖고 영향을 미치는 그룹에 참여하는 방법을 배웁니다.

source: Know how to report bugs and propose features
de: Wissen, wie man Fehler meldet und Funktionen vorschlägt
id: Ketahui cara melaporkan bug dan mengusulkan fitur
ko_kr: 버그를 보고하고 기능을 제안하는 방법을 배웁니다.

source: Know the structure of the different release models and how to work effectively in those to influence the future of OpenStack
de: Kennen Sie die Struktur der verschiedenen Release-Modelle und wie Sie effektiv darin arbeiten können, um die Zukunft von OpenStack zu beeinflussen
id: Ketahui struktur dari model rilis yang berbeda dan cara bekerja secara efektif pada mereka untuk mempengaruhi masa depan OpenStack
ko_kr: 다양한 릴리스 모델의 구조와 이러한 모델에서 효과적으로 작동하여 OpenStack의 미래에 영향을 미치는 방법을 알 수 있습니다.

source: Know which events are valuable to you
de: Wissen Sie, welche Ereignisse für Sie wertvoll sind
id: Ketahui acara mana yang berharga bagi Anda
ko_kr: 어떤 이벤트가 귀하에게 소중한지 알 수 있습니다.

source: Launchpad
ko_kr: 런치패드

source: Launchpad is the original task tracker used by OpenStack projects to organize and target work to milestones and releases. It uses UbuntuOne for authentication as it is managed by Canonical. Items tracked are either bugs or blueprints.
de: Launchpad ist der ursprüngliche Task-Tracker, der von OpenStack-Projekten verwendet wird, um Arbeiten zu organisieren und auf Meilensteine und Releases auszurichten. Es verwendet UbuntuOne zur Authentifizierung, da es von Canonical verwaltet wird. Verfolgte Elemente sind entweder Bugs oder Blueprints.
id: Launchpad adalah pelacak tugas asli yang digunakan oleh proyek OpenStack untuk mengatur dan menargetkan pekerjaan hingga tonggak dan rilis. Ia menggunakan UbuntuOne untuk otentikasi karena dikelola oleh Canonical. Item yang dilacak adalah bug atau cetak biru.
ko_kr: Launchpad는 OpenStack 프로젝트에서 마일스톤 및 릴리스에 맞게 작업을 구성하고 대상으로 지정하는 데 사용되는 원래 작업 추적기입니다. 캐논컬에서 관리하는 만큼 인증에 UbuntuOne을 사용합니다. 추적된 항목은 버그 또는 Blueprint입니다.

source: Launchpad specific footers:
ko_kr: 런치패드별 바닥글은 다음과 같습니다.

source: Learning Git
de: Git erlernen
id: Belajar Git
ko_kr: GIT 학습

source: Lets first fill out the **Nick name** and **User name** field with our choice of a nickname:
de: Lassen Sie uns zuerst das Feld **Spitzname** und **Benutzername** mit unserer Wahl eines Spitznamens ausfüllen:
id: Pertama-tama mari kita mengisi bidang **Nick name** dan **User name** dengan nama panggilan kami:
ko_kr: 먼저 **Nick name** 및 **User name** 필드를 선택한 닉네임으로 채우겠습니다.

source: Linux
ko_kr: 리눅스

source: Look for `meetups in your area <http://meetup.com/pro/osf>`_ and if you cannot find one you are welcome to organize one yourself!
id: Carilah `meetups in your area <http://meetup.com/pro/osf>` _ dan jika Anda tidak dapat menemukannya, Anda dapat mengaturnya sendiri!
ko_kr: `당신의 지역 <http://meetup.com/pro/osf>`_ 에 있는 잡동사니들을 찾아보세요. 만약 여러분이 그것을 찾을 수 없다면, 여러분은 스스로 그것을 조직하는 것을 환영해요!

source: Mac OS & Linux
ko_kr: 맥 OS & 리눅스

source: Mac OS X El Capitan and Mac OS Sierra users might see an error message like "Operation not permitted" when installing with the command. In this case, there are two options to successfully install git-review.
de: Benutzer von Mac OS X El Capitan und Mac OS Sierra sehen möglicherweise eine Fehlermeldung wie "Operation not permitted" bei der Installation mit dem Befehl. In diesem Fall gibt es zwei Möglichkeiten, um git-review erfolgreich zu installieren.
id: Pengguna Mac OS X El Capitan dan Mac OS Sierra mungkin melihat pesan kesalahan seperti "Operation not permitted" saat menginstal dengan perintah. Dalam hal ini, ada dua opsi untuk berhasil menginstal git-review.
ko_kr: Mac OS X El Capitan 및 Mac OS Sierra 사용자는 명령을 사용하여 설치할 때 "Operation not callowed"와 같은 오류 메시지가 표시될 수 있습니다. 이 경우 git-review를 성공적으로 설치하는 두 가지 옵션이 있습니다.

source: Mailing Lists (ML)
de: Mailinglisten (ML)
ko_kr: 메일링 목록(ML)

source: Maintained
ko_kr: 유지 관리

source: Make sure that **Use SSL for all the servers on this network** is checked.
de: Stellen Sie sicher, dass **SSL für alle Server in diesem Netzwerk verwenden** aktiviert ist.
id: Pastikan **Use SSL for all the servers on this network** dicentang.
ko_kr: **이 네트워크의 모든 서버에 대해 SSL 사용** 이 선택되어 있는지 확인합니다.

source: Make sure to use the same email address you'll want to use for code contributions since it's important later that these match up.
de: Achten Sie darauf, dass Sie die gleiche E-Mail-Adresse verwenden, die Sie für Codebeiträge verwenden möchten, da es später wichtig ist, dass diese übereinstimmen.
id: Pastikan untuk menggunakan alamat email yang sama Anda akan ingin menggunakan untuk kontribusi kode karena itu penting kemudian bahwa ini ada kecocokan.
ko_kr: 코드 컨트리뷰션에 사용하고자 하는 이메일 주소와 동일한 주소를 사용하는지 확인합니다. 서로 일치시키는 것이 나중에 중요해 집니다.

source: Map of OpenStack projects
de: Karte der OpenStack-Projekte
id: Peta proyek OpenStack
ko_kr: OpenStack 프로젝트 맵

source: Meet-ups
id: Pertemuan
ko_kr: 밋업

source: Meet-ups are organized by local user groups with different cadences. They are a few hours long with a few presentations, discussion topics and some snacks.
de: Meet-ups werden von lokalen Benutzergruppen mit unterschiedlichen Kadenzen organisiert. Sie sind ein paar Stunden lang mit ein paar Präsentationen, Diskussionsthemen und einigen Snacks.
id: Pertemuan diselenggarakan oleh kelompok pengguna lokal dengan irama (cadence) yang berbeda. Mereka berdurasi beberapa jam dengan beberapa presentasi, topik diskusi dan beberapa makanan ringan.
ko_kr: 미팅은 서로 다른 자격증을 가진 로컬 사용자 그룹에 의해 구성됩니다. 프리젠테이션, 토론 주제 및 간식을 몇 시간 동안 사용할 수 있습니다.

source: Mentoring
id: Mentoring (pendampingan)
ko_kr: 멘토링

source: Mentoring Mailing List
de: Mentoring Mailingliste
ko_kr: 메일링 리스트를 멘토링합니다.

source: Monitor your patches as they get tested by Zuul
de: Überwachen Sie Ihre Patches, während sie von Zuul getestet werden
id: Pantau patch Anda saat diuji oleh Zuul
ko_kr: Zuul이 패치를 테스트할 때 패치를 모니터링합니다.

source: Most IRC channels are archived, you can read the logs on `eavesdrop <http://eavesdrop.openstack.org/irclogs/>`__.
de: Die meisten IRC-Kanäle werden archiviert, Sie können die Protokolle auf `Eavesdrop <http://eavesdrop.openstack.org/irclogs/>`__ lesen.
id: Sebagian besar saluran IRC diarsipkan, Anda dapat membaca log on `eavesdrop <http://eavesdrop.openstack.org/irclogs/>`__.
ko_kr: 대부분의 IRC 채널은 아카이브되어 있으며, `eavesdrop <http://eavesdrop.openstack.org/irclogs/>`_ 의 로그를 읽을 수 있습니다.

source: N/A
ko_kr: 없음

source: New core reviewers are nominated by someone from the existing team on the Discuss Mailing List and/or in Gerrit and elected by voting from the members of the core team of the project.
de: Neue Core Reviewer werden von jemandem aus dem bestehenden Team auf der Discuss Mailing List und/oder in Gerrit nominiert und durch Abstimmung mit den Mitgliedern des Kernteams des Projekts gewählt.
id: Core reviewer baru dicalonkan oleh seseorang dari tim yang ada di Diskusi Mailing List dan / atau di Gerrit dan dipilih dengan memilih dari anggota tim inti proyek.
ko_kr: 새로운 핵심 검토자는 기존 팀의 누군가가 메일링 토론 목록 및/또는 게리트로 지명하고 프로젝트 핵심 팀의 구성원으로부터 투표하여 선출합니다.

source: Not all projects use the blueprints feature of Launchpad, you should contact the project to see how they handle feature requests. For details on how to contact a project check the `project list <https://governance.openstack.org/tc/reference/projects/index.html>`_.
de: Nicht alle Projekte verwenden die Blueprints-Funktion von Lauchpad, Sie sollten sich an das Projekt wenden, um zu sehen, wie es mit Feature-Anfragen umgeht. Details zur Kontaktaufnahme mit einem Projekt finden Sie in der `Projektliste <https://governance.openstack.org/tc/reference/projects/index.html>`_.
id: Tidak semua proyek menggunakan fitur blueprint Launchpad, Anda harus menghubungi proyek untuk melihat bagaimana mereka menangani permintaan fitur. Untuk detail tentang cara menghubungi proyek, periksa `project list <https://governance.openstack.org/tc/reference/projects/index.html>`_.
ko_kr: 모든 프로젝트가 실행 패드의 Blueprint 기능을 사용하는 것은 아닙니다. 프로젝트에 문의하여 기능 요청을 처리하는 방법을 확인해야 합니다. 프로젝트에 연락하는 방법에 대한 자세한 내용은 `프로젝트 리스트 <https://governance.openstack.org/tc/reference/projects/index.html>`_ 을 확인하세요.

source: Not used
de: Nicht verwendet
id: Tidak digunakan
ko_kr: 사용되지 않습니다.

source: Now open the hexchat program just like you would for any Linux program.
de: Öffnen Sie nun das Hexchat-Programm wie bei jedem Linux-Programm.
id: Sekarang buka program hexchat seperti yang Anda lakukan untuk program Linux apa pun.
ko_kr: 이제 다른 리눅스 프로그램에 대해와 마찬가지로 헥스챗 프로그램을 엽니다.

source: Official OpenStack projects
de: Offizielle OpenStack-Projekte
id: Proyek OpenStack resmi
ko_kr: 공식 OpenStack 프로젝트

source: Official OpenStack projects are the projects under the governance of the Technical Commitee. Official OpenStack projects are listed in the `OpenStack Project Teams page <https://governance.openstack.org/tc/reference/projects/index.html>`_. Most well-known official OpenStack projects are listed in the `project navigator <https://www.openstack.org/software/project-navigator>`_. It is not mandatory for a project to become an official OpenStack project.
de: Offizielle OpenStack-Projekte sind die Projekte unter der Leitung des Technischen Komitees. Offizielle OpenStack-Projekte sind auf der Seite `OpenStack Project Teams page <https://governance.openstack.org/tc/reference/projects/index.html>`_ aufgeführt. Die bekanntesten offiziellen OpenStack-Projekte sind im `Projektnavigator <https://www.openstack.org/software/project-navigator>`_ aufgelistet. Es ist nicht zwingend erforderlich, dass ein Projekt ein offizielles OpenStack-Projekt wird.
id: Proyek OpenStack resmi adalah proyek di bawah tata kelola Komite Teknis. Proyek OpenStack resmi terdaftar di `OpenStack Project Teams page <https://governance.openstack.org/tc/reference/projects/index.html>`_. Sebagian besar proyek OpenStack resmi terkenal terdaftar di `project navigator <https://www.openstack.org/software/project-navigator>`_. Tidak wajib bagi proyek untuk menjadi proyek OpenStack resmi.
ko_kr: 공식 OpenStack 프로젝트는 Technical Committee가 관리하는 프로젝트입니다. 공식 OpenStack 프로젝트는 `OpenStack 프로젝트 팀 페이지 <https://governance.openstack.org/tc/reference/projects/index.html>`_ 에 나열되어 있습니다. 가장 잘 알려진 OpenStack 프로젝트는 `프로젝트 네비게이터 <https://www.openstack.org/software/project-navigator>`_ 에 나열되어 있습니다. 프로젝트가 공식 OpenStack 프로젝트가 되는 것은 의무 사항이 아닙니다.

source: Official OpenStack projects have a project team consisting of core reviewers and contributors.
de: Offizielle OpenStack-Projekte verfügen über ein Projektteam, das aus Core Reviewer und Mitwirkenden besteht.
id: Proyek OpenStack resmi memiliki tim proyek yang terdiri dari pengulas inti dan kontributor.
ko_kr: 공식 OpenStack 프로젝트에는 핵심 검토자와 기여자로 구성된 프로젝트 팀이 있습니다.
