Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-code-and-documentation.po
Languages: de, id, ko_kr, zh_cn

source: The basic set of values contributors have to vote with on a patch is: -1, 0, or +1. These values correspond to a relatively simple system.
de: Der grundlegende Satz von Werten, mit denen Mitwirkende bei einem Patch abstimmen müssen, ist: -1, 0 oder +1. Diese Werte entsprechen einem relativ einfachen System.
id: Rangkaian nilai dasar yang harus dipilih oleh kontributor pada patch adalah: -1, 0, atau +1. Nilai-nilai ini sesuai dengan sistem yang relatif sederhana.
ko_kr: 기여자가 패치에 대해 투표해야 하는 기본 가치 집합은 -1, 0 또는 +1입니다. 이러한 값은 비교적 간단한 시스템에 해당합니다
zh_cn: 贡献者必须对补丁进行投票的基本值的集合是：-1、0或+1。 这些值对应了一个相对简单的系统。

source: The cardinal rule for creating good commits is to ensure there is only one "logical change" per commit. There are many reasons why this is an important rule:
ko_kr: 좋은 커밋을 만들기 위한 기본 규칙은 커밋당 오직 하나의 "논리적 변경"이 있는지 확인하는 것입니다. 이것이 중요한 규칙인 데에는 여러가지 이유가 있습니다.

source: The change ID can be found on the web UI of Gerrit:
de: Die Änderungs-ID finden Sie auf der Web-Oberfläche von Gerrit:
id: ID perubahan dapat ditemukan di UI web Gerrit:
ko_kr: 변경 ID는 Gerrit의 웹 UI에서 확인할 수 있습니다.
zh_cn: 更改ID可以在gerrit的网络界面找到：

source: The change ID is the same as in the previous case.
de: Die Änderungs-ID ist die gleiche wie im vorherigen Fall.
id: ID perubahan sama seperti pada kasus sebelumnya.
ko_kr: 변경 ID는 이전과 동일합니다.
zh_cn: 更改ID则和前面的情况是一致的。

source: The contributor guide can be found in the ``contributor`` directory. It contains project-specific information on contributing to the project and on team management. This guide appears only in the project's documentation.
ko_kr: 컨트리뷰터 가이드는 ``contributor`` 디렉토리에서 찾을 수 있습니다. 여기에는 프로젝트 기여 및 팀 관리에 대한 프로젝트 별 정보가 포함되어 있습니다. 이 가이드는 프로젝트 문서에만 나타납니다.
zh_cn: 贡献者指南可在 ``contributor`` 目录中找到。 它包含有关项目贡献和团队管理的特定于项目的信息。 贡献者指南仅出现在项目的文档中。

source: The documentation directory structure is the following::
ko_kr: 문서 디렉토리 구조는 다음과 같습니다.
zh_cn: 文档目录结构如下::

source: The following command needs to be run as a user with sudo access and NOPASSWD configured.
de: Der folgende Befehl muss als Benutzer mit sudo-Zugriff und NOPASSWD-Konfiguration ausgeführt werden.
id: Perintah berikut perlu dijalankan sebagai pengguna dengan akses sudo dan NOPASSWD dikonfigurasi.
ko_kr: 다음 명령어를 sudo 액세스가 있고 NOPASSWD가 구성된 사용자로 실행할 필요가 있습니다.
zh_cn: 以下命令需要以具有sudo访问权限和NOPASSWD配置的用户身份运行。

source: The heart of open source is the people who are participating in a community and it is no different in case of OpenStack either.
de: Das Herzstück von Open Source sind die Menschen, die an einer Community teilnehmen, und auch bei OpenStack ist es nicht anders.
id: Inti dari open source adalah orang-orang yang berpartisipasi dalam suatu komunitas dan tidak ada bedanya dengan OpenStack.
ko_kr: 오픈 소스의 핵심은 커뮤니티에 참여하는 사람들이며 OpenStack의 경우에도 다르지 않습니다.
zh_cn: 开源的核心是参与社区的人们，对于OpenStack来说也是如此。

source: The installation guide can be found in the ``install`` directory. It contains information on anything to do with installing a project from packages, for instance, software necessary for installing the project, like database installation and configuration, or what parameters should be set in the project's config file. If everything is configured properly (described below), the project's installation guide is included in the `OpenStack Installation Guides`_. The installation guide is not intended to be used for production system installations.
ko_kr: 설치 가이드는 ``install`` 디렉토리에 있습니다. 가이드에는 데이터베이스 설치 및 구성과 같이 프로젝트 설치에 필요한 소프트웨어, 또는 프로젝트 구성 파일에서 설정해야 하는 매개 변수 등 패키지로부터 프로젝트를 설치하는 것과 관련된 모든 정보를 담고 있습니다. 만약 모든 것이 적절히 설정되었다면(아래 설명 참조), 프로젝트의 설치 가이드는 `OpenStack Installation Guides`_ 에 포함됩니다. 설치 가이드는 프로덕션 시스템에 설치하기 위해 사용할 목적으로 작성되지 않습니다.
zh_cn: 安装指南可以在 ``install`` 目录中找到。 它包含关于从软件包安装项目的任何信息，例如，安装项目所需的软件，例如数据库安装和配置，或需要在项目的配置文件中设置哪些参数等等。 如果一切都配置正确（如下所述），则项目的安装指南包含在 `OpenStack Installation Guides`_ 中。 本安装指南不适用于生产系统安装。

source: The patch submitted is a duplicate or at odds with another patch submitted.
de: Der eingereichte Patch ist ein Duplikat oder steht im Widerspruch zu einem anderen Patch.
id: Patch yang dikirimkan adalah duplikat atau bertentangan (duplicate or odd) dengan patch lain yang dikirimkan.
ko_kr: 제출된 패치가 중복되거나 제출된 다른 패치와 충돌합니다.
zh_cn: 提交的补丁是重复的，或者与提交的另一个补丁不一致。

source: The smaller the amount of code being changed, the quicker and easier it is to review and identify potential flaws.
ko_kr: 변경되는 코드의 양이 적을수록, 잠재적인 결함을 더 쉽고 빠르게 검토하고 식별할 수 있습니다.

source: The tag can be applied to patches proposed for the same repository as well. In that case the changes are separate enough to be kept independent which means that if you need to fix changes from review comments you can do it on a per patch basis. It is also true for rebasing each patch.
de: Das Tag kann auch auf Patches angewendet werden, die für das gleiche Repository vorgeschlagen werden. In diesem Fall sind die Änderungen getrennt genug, um unabhängig voneinander gehalten zu werden, was bedeutet, dass Sie, wenn Sie Änderungen durch Review-Kommentare korrigieren müssen, dies auf Patch-Basis tun können. Dies gilt auch für die Umbasierung jedes Patches.
id: Tag dapat diterapkan ke tambalan yang diusulkan untuk repositori yang sama juga. Dalam hal ini perubahannya cukup terpisah untuk tetap independen yang berarti bahwa jika Anda perlu memperbaiki perubahan dari komentar ulasan Anda dapat melakukannya berdasarkan setiap patch. Hal ini juga berlaku untuk rebasing setiap patch.
ko_kr: 태그는 동일한 저장소에 대해 제안된 패치에도 적용할 수 있습니다. 이 경우 변경 사항은 독립적으로 유지될 수 있을 만큼 분리되어 있으므로 리뷰 코멘트에서 변경 사항을 수정해야 하는 경우 패치별로 수행할 수 있습니다. 각 패치를 리베이스하는 경우에도 마찬가지입니다.
zh_cn: 该标签也可以应用于为同一项目仓库建议的补丁。 在这种情况下，更改是可以彼此分隔，独立维护的。这意味着，如果您需要修复评论注释中的更改，则可以在每个补丁的基础上进行更改。 对于为每个补丁重新设置基准代码也是同样适用。

source: The tools that we are using in the community can look complicated if you are not familiar with them. To help you practice before you use them in action we are providing sandbox environments for you where you can practice all the steps we describe in this guide.
de: Die Tools, die wir in der Community verwenden, können kompliziert aussehen, wenn man sie nicht kennt. Um Ihnen beim Üben zu helfen, bevor Sie sie in Betrieb nehmen, stellen wir Ihnen Sandbox-Umgebungen zur Verfügung, in denen Sie alle Schritte üben können, die wir in diesem Handbuch beschreiben.
id: Alat yang kami gunakan di komunitas bisa terlihat rumit jika Anda tidak terbiasa dengannya. Untuk membantu Anda berlatih sebelum menggunakannya dalam aksi, kami menyediakan lingkungan sandbox untuk Anda tempat Anda dapat mempraktikkan semua langkah yang kami jelaskan dalam panduan ini.
ko_kr: 커뮤니티에서 사용하는 도구는 익숙하지 않은 경우 복잡해 보일 수 있습니다. 이 가이드에서는 모든 단계를 연습할 수 있는 샌드박스 환경을 제공하므로 실제 사용하기 전에 연습해 보십시오.
zh_cn: 如果不熟悉社区中使用的工具，它们可能会看起来很复杂。 为了帮助您在实际使用它们之前进行练习，我们为您提供了沙箱环境，您可以在其中练习本指南中介绍的所有步骤。

source: There are multiple options to choose from depending on the structure of your design. You can either organize the changes in patch chains or you can use the 'Depends-On' tag.
de: Abhängig von der Struktur Ihres Designs stehen Ihnen mehrere Optionen zur Verfügung. Sie können die Änderungen entweder in Patchketten organisieren oder das Tag'Depends-On' verwenden.
id: Ada beberapa opsi untuk dipilih tergantung pada struktur desain Anda. Anda dapat mengatur perubahan dalam rantai patch atau Anda dapat menggunakan tag 'Depends-On'.
ko_kr: 디자인 구조에 따라 선택할 수 있는 여러 옵션이 있습니다. 패치 체인의 변경사항을 구성하거나 'Depends-On' 태그를 사용할 수 있습니다.
zh_cn: 根据设计的结构，有多种选择。 您可以在补丁链中组织你的更改，也可以使用'Depends-On'标签。

source: There is a `Sandbox project <https://launchpad.net/openstack-dev-sandbox>`_ available there which is created to track bugs and issues related to the opendev/sandbox repository.
ko_kr: 그곳에는 opendev/sandbox 리포지토리와 관련된 버그와 이슈를 추적하기 위해 만들어진 `샌드박스 프로젝트 <https://launchpad.net/openstack-dev-sandbox>`_ 가 있습니다.

source: There is an issue with the approach taken in the patch and it needs to be discussed with a larger group, likely in a meeting.
de: Es gibt ein Problem mit dem im Patch gewählten Ansatz, und er muss mit einer größeren Gruppe diskutiert werden, wahrscheinlich in einem Meeting.
id: Ada masalah dengan pendekatan yang diambil dalam patch dan perlu didiskusikan dengan kelompok yang lebih besar, kemungkinan dalam pertemuan.
ko_kr: 패치의 접근 방식에 문제가 있으며, 미팅에서 더 큰 그룹과 논의해야 합니다.
zh_cn: 补丁中采用的方法存在问题，需要与更大的小组讨论，例如在会议中。

source: This chapter will guide you through of all the tools and processes that we are using to develop, test, maintain, and document the projects in OpenStack.
de: Dieses Kapitel führt Sie durch alle Tools und Prozesse, mit denen wir die Projekte in OpenStack entwickeln, testen, warten und dokumentieren.
id: Bab ini akan memandu Anda melalui semua alat dan proses yang kami gunakan untuk mengembangkan, menguji, memelihara, dan mendokumentasikan proyek di OpenStack.
ko_kr: 이번 챕터에서는 OpenStack에서 프로젝트를 개발, 테스트, 유지 관리 및 문서화하는 데 사용하는 모든 도구 및 프로세스를 안내합니다.
zh_cn: 本章将指导您了解所有用于开发，测试，维护和记录OpenStack中项目的工具和过程。

source: This command cleans up the OpenStack installation that was performed on the node. This includes:
de: Mit diesem Befehl wird die OpenStack-Installation bereinigt, die auf dem Knoten ausgeführt wurde. Dazu gehören:
id: Perintah ini membersihkan instalasi OpenStack yang dilakukan pada node. Ini termasuk:
ko_kr: 이 명령은 노드에서 수행 된 OpenStack 설치를 정리합니다. 여기에는 다음이 포함됩니다.
zh_cn: 此命令清除在节点上执行的OpenStack安装。 这包括：

source: This guide is to list the minimal steps you need to do to push your first patch in OpenStack.
ko_kr: 이 가이드는 OpenStack에서 첫 패치를 푸시하는데 필요한 최소한의 단계를 나열합니다.

source: This guide won't go into the details of tracing through the logs of a run and finding a good fingerprint, since that's quite involved, dependent on the job you're looking at, and already documented in a few places including:
de: Dieser Leitfaden wird nicht auf die Details der Verfolgung der Protokolle eines Laufs und der Suche nach einem guten Fingerabdruck eingehen, da dies sehr aufwändig ist, abhängig von der Aufgabe, die Sie gerade ausführen, und bereits an einigen Stellen dokumentiert ist:
id: Panduan ini tidak akan membahas rincian penelusuran log dan menemukan fingerprint yang baik, karena cukup terlibat, tergantung pada pekerjaan yang Anda lihat, dan sudah didokumentasikan di beberapa tempat termasuk:
ko_kr: 이 가이드에서는 실행 로그를 추적하고 좋은 지문을 찾는 방법에 대해 자세히 설명하지 않을 것입니다. 작업에 따라 다르고 다음과 같은 몇 군데에 이미 문서화되어 있기 때문입니다.

source: This is a good way to help tracking related changes, let that be a feature implementation, bugfix or documentation work.
de: Dies ist eine gute Möglichkeit, um die Verfolgung von Änderungen zu erleichtern, z.B. bei der Implementierung von Funktionen, Bugfixes oder Dokumentationsarbeiten.
id: Ini adalah cara yang baik untuk membantu melacak perubahan terkait, biarkan itu menjadi implementasi fitur, perbaikan bug atau pekerjaan dokumentasi.
ko_kr: 이렇게 하면 기능 구현, 버그 수정 또는 문서화 작업을 비롯하여 관련 변경 사항을 추적할 수 있습니다.
zh_cn: 这是帮助跟踪相关更改的好方法，可以将其用作功能实现，错误修复或文档工作。

source: This is a quick start version. For a more in depth description of how to clone, create a patch and push the change, directions can be `found here <https://docs.opendev.org/opendev/infra-manual/latest/developers.html#starting-work-on-a-new-project>`_
ko_kr: 이것은 빠른 시작 버전입니다. 복제 방법, 패치 생성 및 변경 사항에 대한 보다 심층적인 설명을 위해 여기서 `찾아보기 <https://docs.opendev.org/opendev/infra-manual/latest/developers.html#starting-work-on-a-new-project>`_ 를 참조할 수 있습니다.

source: This pops me into an editor showing me all the commits between wherever I am and the main branch (now they're in top-first order):
id: Ini memunculkan saya ke dalam editor yang menunjukkan kepada saya semua komitmen antara di mana pun saya berada dan cabang utama (sekarang mereka berada di urutan pertama atas):
ko_kr: 이렇게 하면 편집기에서 제가 있는 곳과 메인 지점 사이의 모든 커밋을 보여 줍니다(지금은 그 커밋이 상위 순서가 됩니다).
zh_cn: 这使我进入编辑器，向我显示任何我所处位置与主分支之间的所有提交（现在，它们处于最高优先顺序）：

source: This section allows you to:
de: In diesem Abschnitt können Sie:
id: Bagian ini memungkinkan Anda untuk:
ko_kr: 이 섹션에서는 다음을 수행 할 수 있습니다:
zh_cn: 本章节允许您：

source: This section assumes you have completed :doc:`../common/setup-gerrit` guide.
de: Dieser Abschnitt geht davon aus, dass Sie die Anleitung :doc:`../common/setup-gerrit` abgeschlossen haben.
id: Bagian ini menganggap Anda telah menyelesaikan panduan :doc:`../common/setup-gerrit`.
ko_kr: 이 섹션에서는 :doc:`../common/setup-gerrit` 안내서를 완료했다고 가정합니다
zh_cn: 本章节假设您已完成 :doc:`../common/setup-gerrit` 指南。

source: This section assumes you have completed :doc:`/common/zuul-status`
de: Dieser Abschnitt geht davon aus, dass Sie :doc:`/common/common/zuul-status` abgeschlossen haben.
id: Bagian ini menganggap Anda telah menyelesaikan :doc:`/common/zuul-status`
ko_kr: 이 섹션에서는 :doc:`/common/zuul-status` 섹션을 완료했다고 가정합니다.
zh_cn: 本部分假设您已完成 :doc:`/common/zuul-status`

source: This section contains information necessary to contributing to OpenStack documentation.
ko_kr: 이 섹션은 오픈스택 문서에 기여하기 위해 필요한 정보를 담고 있습니다.
zh_cn: 本部分包含有助于OpenStack文档的信息。

source: This section will guide you through how to create patches that people will want to review.
de: In diesem Abschnitt erfahren Sie, wie Sie Patches erstellen, die von Personen überprüft werden sollen.
id: Bagian ini akan memandu Anda melalui cara membuat patch yang ingin ditinjau orang.
ko_kr: 이 섹션에서는 사람들이 리뷰하고 싶은 패치를 만드는 방법을 안내합니다.
zh_cn: 本节将指导您了解如何创建人们想查看的补丁。

source: This tutorial walks through a simple scenario of developing multiple change sets in a series on the same branch. If you wish, you can follow along, using the `sandbox repository <https://opendev.org/opendev/sandbox/>`_, executing the commands exactly as they're laid out.
ko_kr: 이 자습서에서는 동일한 분기의 시리즈에서 여러 변경 세트를 개발하는 간단한 시나리오를 설명합니다. 원하는 경우 `sandbox 저장소 <https://opendev.org/opendev/sandbox/>`_ 을 사용하여 명령을 배치한 그대로 실행하면 됩니다.

source: This will commit the changes under the same set of changes you issued earlier. Notice that in order to send your latest version for review, you will still need to call::
de: Dadurch werden die Änderungen unter dem gleichen Satz von Änderungen, die Sie zuvor vorgenommen haben, übernommen. Beachten Sie, dass Sie, um Ihre neueste Version zur Überprüfung zu senden, immer noch anrufen müssen::
id: Ini akan melakukan perubahan di bawah set perubahan yang sama yang Anda keluarkan sebelumnya. Perhatikan bahwa untuk mengirim versi terbaru Anda untuk ditinjau, Anda masih perlu call::
ko_kr: 이렇게 하면 이전에 실행한 변경사항 집합에서 변경사항이 커밋됩니다. 검토를 위해 최신 버전을 보내려면 다음 연락처로 전화해야 합니다.
zh_cn: 这将在您之前发起的同一组更改下提交更改。 请注意，要发送最新版本以供审核，您仍然需要调用::

source: To access the Gerrit Web Editor click on the icon that looks like a pencil writing on paper next to the patch set number at the top of a Gerrit Code Review page for a file.
de: Um den Gerrit Web Editor aufzurufen, klicken Sie auf das Symbol, das wie eine Bleistiftschrift auf Papier neben der Patch-Set-Nummer oben auf einer Gerrit Code Review-Seite für eine Datei aussieht.
id: Untuk mengakses Gerrit Web Editor klik pada ikon yang terlihat seperti pensil yang menulis di atas kertas di sebelah nomor set patch di bagian atas halaman Gerrit Code Review untuk sebuah file.
ko_kr: Gerrit 웹 편집기에 액세스하려면 파일에 대한 Gerrit Code Review 페이지 상단에 있는 패치 세트 번호 옆에 있는 종이에 연필로 쓰는 것처럼 보이는 아이콘을 클릭합니다.
zh_cn: 要访问Gerrit网络编辑器以编辑文件，请单击Gerrit Code Review页面顶部的补丁集编号旁边的看起来像铅笔在纸上写字的那个图标。

source: To check the differences between your branch and the repository::
de: Um die Unterschiede zwischen Ihrem Zweig und dem Repository zu überprüfen::
id: Untuk memeriksa perbedaan antara cabang Anda dan repository::
ko_kr: 분기와 리포지토리 간의 차이를 확인하려면 다음을 수행합니다.
zh_cn: 要检查您的分支和仓库之间的差异::

source: To check the files that have been updated in your branch::
de: So überprüfen Sie die Dateien, die in Ihrem Zweig aktualisiert wurden::
id: Untuk memeriksa file yang telah diperbarui di branch:: Anda.
ko_kr: 분기에서 업데이트된 파일을 확인하려면 다음을 수행합니다.
zh_cn: 要检查您的分支中已更新的文件::

source: To clone a copy of some repository::
de: Um eine Kopie eines Repositories zu klonen::
id: Untuk mengkloning beberapa repositori ::
ko_kr: 일부 리포지토리의 복사본을 복제하려면 다음을 수행합니다.
zh_cn: 克隆某个仓库的拷贝::

source: To create your development branch (substitute branch_name for a name of your choice). It's better to create a new branch for each patch than working from master::
de: Um Ihren Entwicklungszweig zu erstellen (ersetzen Sie branch_name durch einen Namen Ihrer Wahl). Es ist besser, für jeden Patch einen neuen Zweig zu erstellen, als vom Master aus zu arbeiten::
id: Untuk membuat cabang pengembangan Anda (gantikan branch_name dengan nama pilihan Anda). Lebih baik membuat cabang baru untuk setiap patch daripada bekerja dari master::
ko_kr: 개발 분기를 작성합니다(선택한 이름으로 대체 분기_이름). 마스터에서 작업하는 것보다 각 패치에 대해 새 분기를 만드는 것이 좋습니다.
zh_cn: 创建您的开发分支（用您选择的名称替换branch_name）。 最好为每个补丁创建一个新分支，而不是使用主分支::

source: To download the full chain you need to download the top patch and Git will automatically download all the dependent patches in the chain.
de: Um die gesamte Kette herunterzuladen, müssen Sie den Top-Patch herunterladen und Git lädt automatisch alle abhängigen Patches in der Kette herunter.
id: Untuk mengunduh rantai penuh, Anda perlu mengunduh patch teratas dan Git akan secara otomatis mengunduh semua patch dependen dalam rantai.
ko_kr: 전체 체인을 다운로드하려면 상단 패치를 다운로드해야 하며 Git은 체인의 모든 종속 패치를 자동으로 다운로드합니다.
zh_cn: 要下载完整的补丁链，您需要下载顶层补丁，Git会自动下载补丁链中的所有相关补丁。

source: To get DevStack you will need to clone it from the ``devstack`` repository under ``openstack``.
ko_kr: DevStack을 가져오기 위해서는 ``openstack-dev`` 아래에 있는 ``devstack`` 저장소를 클론할 필요가 있습니다.

source: To get started, first setup required accounts.
ko_kr: 시작하려면 먼저 필요한 계정을 설정하십시오.

source: To make sure everything is set up correctly or to understand the workflow without trying it on actual projects, you can practice in a Sandbox using the :doc:`sandbox-house-rules` Guide.
ko_kr: 모든 것이 올바르게 설정되었는지 확인하거나 실제 프로젝트에서 시도하지 않고 워크플로우를 이해하려면 :doc:`sandbox-house-rules` 가이드를 사용하여 샌드박스에서 연습할 수 있습니다.

source: To modify a patch within a chain you will need to use interactive rebase:
de: Um einen Patch innerhalb einer Kette zu ändern, müssen Sie eine interaktive Datenbank verwenden:
id: Untuk memodifikasi patch dalam rantai Anda perlu menggunakan rebase interaktif:
ko_kr: 체인 내에서 패치를 수정하려면 interactive rebase를 사용해야합니다:
zh_cn: 要修改补丁链中的补丁，您将需要使用交互式复位基础（rebase）：

source: To shutdown a DevStack instance running on a node the following command should be used:
de: Um eine DevStack-Instanz, die auf einem Knoten läuft, herunterzufahren, sollte der folgende Befehl verwendet werden:
id: Untuk mematikan instance DevStack yang berjalan pada node, perintah berikut harus digunakan:
ko_kr: 노드에서 실행 중인 DevStack 인스턴스를 종료하려면 다음 명령을 입력하세요:
zh_cn: 要关闭在节点上运行的DevStack实例，应使用以下命令：

source: To simplify future interaction with your deployment you will want to set the following variables:
de: Um die zukünftige Interaktion mit Ihrer Bereitstellung zu vereinfachen, sollten Sie die folgenden Variablen festlegen:
id: Untuk menyederhanakan interaksi di masa depan dengan penyebaran Anda, Anda ingin mengatur variabel berikut:
ko_kr: 향후 배포 환경과 상호작용을 간략화하기 위해 다음 (환경) 변수를 설정하는 것이 좋습니다:
zh_cn: 为了简化将来与部署的交互，您将需要设置以下变量：

source: Tracking a new bug in elastic-recheck
de: Aufspüren eines neuen Fehlers beim elastic-recheck
id: Melacak bug baru di elastic-recheck
ko_kr: elastic-recheck에서 새로운 버그 트래킹 하기

source: Tracking your Changes
de: Nachverfolgung Ihrer Änderungen
id: Melacak Perubahan Anda
ko_kr: 변경 사항을 추적합니다.
zh_cn: 跟踪您的更改

source: Tutorial: Developing Changes In A Series
ko_kr: 튜토리얼 : 시리즈에서 변경 사항 개발
zh_cn: 教程：开发一系列变更

source: Until you click 'Reply' and vote on the patch, any inline comments you've made exist as drafts.
de: Bis Sie auf 'Reply' klicken und über den Patch abstimmen, existieren alle Inline-Kommentare, die Sie gemacht haben, als Entwürfe.
id: Sampai Anda mengklik 'Reply' dan memberi suara pada patch, setiap komentar sebaris yang Anda buat ada sebagai konsep.
ko_kr: '응답'을 클릭하고 패치에 투표하기 전까지는 사용자가 작성한 모든 인라인 코멘트가 초안으로 존재합니다.
zh_cn: 在您单击“答复”并对补丁进行投票之前，您所做的任何行内评论都将作为草稿存在。

source: User guide
ko_kr: 사용자 가이드
zh_cn: 用户指南

source: Using DevStack to develop and test changes is easy. Development can be done in the project clones under ``/opt/stack/<project name>``. Since the projects are clones of the project's git repository a branch can be made and development can take place.
de: Mit DevStack Änderungen zu entwickeln und zu testen ist einfach. Die Entwicklung kann in den Projektklonen unter ``/opt/stack/<project name>``` erfolgen. Da es sich bei den Projekten um Klone des Git-Repositorys des Projekts handelt, kann ein Zweig erstellt werden und die Entwicklung kann stattfinden.
id: Menggunakan DevStack untuk mengembangkan dan menguji perubahan itu mudah. Pengembangan dapat dilakukan di klon proyek di bawah ``/opt/stack/<project name>``. Karena proyek adalah klon dari repositori git proyek, cabang dapat dibuat dan pengembangan dapat dilakukan.
ko_kr: DevStack을 사용하여 변경 사항을 개발 및 테스트하는 방법은 쉽습니다. ``/opt/stack/<project name>`` 아래에 클론된 프로젝트 안에서 개발을 할 수 있습니다. 프로젝트들은 해당 프로젝트에 대한 git 저장소를 클론한 것이기에 브랜치를 만들 수 있으며 개발을 할 수 있습니다.
zh_cn: 使用DevStack开发和测试更改很容易。 可以在项目克隆中的 ``/opt/stack/<project name>`` 下进行开发。 考虑到项目是项目git仓库的克隆，因此可以创建分支并进行开发。

source: Using Elastic Recheck
de: Verwendung von Elastic Recheck
id: Menggunakan Elastic Recheck
ko_kr: Elastic Recheck 사용
zh_cn: 使用Elastic Recheck

source: Using Gerrit
de: Verwendung von Gerrit
id: Menggunakan Gerrit
ko_kr: Gerrit 사용
zh_cn: 使用Gerrit

source: Verifying Your DevStack Deployment
de: Überprüfen der DevStack-Bereitstellung
id: Memverifikasi DevStack Deployment Anda
ko_kr: DevStack 배포 검증
zh_cn: 验证您的DevStack部署

source: We do not differentiate between the different types of contributions such as code or documentation therefore you will find guidance in this chapter for all types.
de: Wir unterscheiden nicht zwischen den verschiedenen Arten von Beiträgen wie Code oder Dokumentation, daher finden Sie in diesem Kapitel Hinweise für alle Arten.
id: Kami tidak membedakan antara berbagai jenis kontribusi seperti kode atau dokumentasi karena itu Anda akan menemukan panduan dalam bab ini untuk semua jenis kontribusi.
ko_kr: 코드 또는 문서와 같은 다양한 유형의 컨트리뷰션을 구별하지 않으므로, 이번 챕터에서 모든 유형에 대한 지침을 찾을 수 있습니다.
zh_cn: 我们不会区分代码或文档等不同类型的贡献，因此您将在本章中找到所有类型的贡献指南。

source: What is DevStack
de: Was ist DevStack?
id: Apa itu DevStack
ko_kr: DevStack이란
zh_cn: 什么是DevStack

source: What is elastic-recheck
de: Was ist eine elastic-recheck?
id: Apa itu elastic-recheck
ko_kr: Elastic-Recheck이란?

source: What to do if a test job fails
de: Was tun, wenn ein Testauftrag fehlschlägt?
id: Apa yang harus dilakukan jika pekerjaan uji gagal
ko_kr: 테스트 작업이 실패 할 경우 수행 할 작업
zh_cn: 如果测试作业失败该怎么办

source: When browsing history using ``git annotate`` or ``git blame``, small well defined changes also aid in isolating exactly where and why a piece of code came from.
ko_kr: ``git annotate``나 ``git blame``을 사용하여 커밋 히스토리를 검색할 때, 변경 사항을 작은 단위로 잘 정의하는 것은 코드 조각이 어디서부터 왔고 왜 작성 되었는지 정확하게 분리해내는 데 도움이 됩니다.

source: When troubleshooting problems using Git's bisect capability, small well defined changes will aid in isolating exactly where the code problem was introduced.
ko_kr: Git의 Bisect 기능을 사용하여 문제를 해결할 때, 작은 단위로 잘 정의된 변경 사항은 코드 문제가 발생한 정확한 위치를 분리해내는 데 도움이 됩니다.
