Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: For information on how to use storyboard, please see `the user interface manual <https://docs.openstack.org/infra/storyboard/gui/tasks_stories_tags.html>`_.
de: Informationen zur Verwendung des Storyboards finden Sie im Handbuch zur Benutzeroberfläche <https://docs.openstack.org/infra/storyboard/gui/tasks_stories_tags.html>`_.
id: Untuk informasi tentang cara menggunakan storyboard, silakan lihat `the user interface manual <https://docs.openstack.org/infra/storyboard/gui/tasks_stories_tags.html>`_.
ko_kr: 스토리보드 사용법은 `사용자 인터페이스 매뉴얼 <https://docs.openstack.org/infra/storyboard/gui/tasks_stories_tags.html>`_ 을 참조하시기 바랍니다.

source: For more detailed information on Stable Branches and their maintenance phases see the `Stable Branches <https://docs.openstack.org/project-team-guide/stable-branches.html>`_ page.
id: Untuk informasi lebih lanjut tentang Stable Branches dan fase pemeliharaannya lihat halaman `Stable Branches <https://docs.openstack.org/project-team-guide/stable-branches.html> halaman` _.
ko_kr: 안정화 지점 및 유지 관리 단계에 대한 자세한 내용은 `안정화 지점 <https://docs.openstack.org/project-team-guide/stable-branches.html>`_ 페이지를 참조하시기 바랍니다.

source: For more information please visit the `OpenStack I18n Guide <https://docs.openstack.org/i18n/latest/index.html>`_. This guide is also translatable.
de: Für weitere Informationen besuchen Sie bitte den `OpenStack I18n Guide <https://docs.openstack.org/i18n/latest/index.html>`_. Diese Anleitung ist auch übersetzbar.
id: Untuk informasi lebih lanjut silakan kunjungi `OpenStack I18n Guide <https://docs.openstack.org/i18n/latest/index.html>`_. Panduan ini juga dapat diterjemahkan.
ko_kr: 더 많은 정보를 원하시면 `OpenStack I18n Guide <https://docs.openstack.org/i18n/latest/index.html>`_ 을 방문해 주십시오. 이 안내서는 번역도 가능합니다.

source: For other information about the project itself, please check out `their documentation <https://docs.openstack.org/infra/storyboard/>`_.
de: Weitere Informationen über das Projekt selbst finden Sie in `ihrer Dokumentation <https://docs.openstack.org/infra/storyboard/>`_.
id: Untuk informasi lain tentang proyek itu sendiri, silakan periksa `their documentation <https://docs.openstack.org/infra/storyboard/>`_.
ko_kr: 프로젝트 자체에 대한 기타 정보는 `문서 <https://docs.openstack.org/infra/storyboard/>`_ 을 참조해 주세요.

source: For reference, use the `Git Reference and Cheat Sheet <https://git-scm.com/doc>`_.
de: Als Referenz verwenden Sie das `Git Reference and Cheat Sheet <https://git-scm.com/doc>`_.
id: Untuk referensi, gunakan `Git Reference and Cheat Sheet <https://git-scm.com/doc>`_.
ko_kr: 참고로 `Git Reference and Cheat Sheet <https://git-scm.com/doc>`_ 을 사용합니다.

source: Format:
ko_kr: 포맷:

source: Forum
ko_kr: 포럼

source: Foundation Board of Directors
id: Dewan Direksi Foundation
ko_kr: 재단 이사회

source: Foundation Membership makes you eligible to vote in elections, for full details see the `individual member policy <https://www.openstack.org/legal/individual-member-policy/>`__.
id: Foundation Membership membuat Anda memenuhi syarat untuk memilih dalam pemilihan, untuk detail lengkapnya lihat`individual member policy <https://www.openstack.org/legal/individual-member-policy/>`__.
ko_kr: 재단 멤버십은 당신이 선거에서 투표할 수 있도록 해주며, 자세한 내용은 `개별 회원 정책 <https://www.openstack.org/legal/individual-member-policy/>`_ 을 참조하십시오.

source: From here on out when you sign into Gerrit, you'll be prompted to enter your Launchpad login info. This is because Gerrit uses it as an OpenID single sign on.
de: Von nun an, wenn Sie sich bei Gerrit anmelden, werden Sie aufgefordert, Ihre Launchpad-Login-Informationen einzugeben. Das liegt daran, dass Gerrit es als OpenID Single Sign On verwendet.
id: Mulai saat ini ketika Anda masuk ke Gerrit, Anda akan diminta untuk memasukkan info login Launchpad Anda. Ini karena Gerrit menggunakannya sebagai sistem masuk tunggal OpenID.
ko_kr: 지금부터 Gerrit에 로그인하면 Launchpad 로그인 정보를 입력하라는 메시지가 표시됩니다. 게리트가 오픈으로 사용하기 때문입니다.ID가 싱글 사인온입니다.

source: From your terminal type::
de: Von Ihrem Terminaltyp::
id: Dari jenis terminal Anda ::
ko_kr: 터미널 유형에서 다음을 수행합니다.

source: General Information
de: Allgemeine Informationen
id: Informasi Umum
ko_kr: 일반 정보

source: Generate SSH Key Pairs
de: SSH-Schlüsselpaare generieren
id: Hasilkan (generate) Pasangan Kunci SSH
ko_kr: SSH 키 쌍을 생성합니다.

source: Generating A Separate Key Pair For OpenStack Gerrit (optional)
de: Generierung eines separaten Schlüsselpaares für OpenStack Gerrit (optional)
id: Membuat Pasangan Kunci Terpisah Untuk OpenStack Gerrit (opsional)
ko_kr: OpenStack Gerritt에 대해 별도의 키 쌍을 생성하고 있습니다(옵션).

source: Generating The Default Or Initial SSH Key Pair
de: Generierung des Standard oder des ersten SSH-Schlüsselpaares
id: Generating The Default Or Initial SSH Key Pair (Pasangan Kunci SSH Atau Awal atau Default)
ko_kr: 기본 또는 초기 SSH 키 쌍을 생성하고 있습니다.

source: Gerrit allows you to review:
de: Gerrit ermöglicht es Ihnen, die Daten zu überprüfen:
id: Gerrit memungkinkan Anda meninjau:
ko_kr: Gerrit을 사용하면 다음을 검토할 수 있습니다.

source: Get guidance from community members and leaders
de: Lassen Sie sich von Community-Mitgliedern und Führungskräften beraten
id: Dapatkan panduan dari anggota dan pemimpin komunitas
ko_kr: 커뮤니티 구성원 및 리더로부터 지도를 받습니다.

source: Get your first patch merged: Mentors will assist mentees with crafting a change, understanding and adhering to the Developers Guide, submitting to Gerrit, responding to reviews, and ultimately having their change accepted.
de: Lassen Sie Ihren ersten Patch zusammenführen: Mentoren unterstützen Mentees bei der Gestaltung einer Änderung, dem Verständnis und der Einhaltung des Developers Guide, der Einreichung bei Gerrit, der Beantwortung von Bewertungen und der endgültigen Annahme ihrer Änderung.
id: Dapatkan patch pertama Anda digabungkan: Mentor akan membantu mentees dengan menyusun perubahan, memahami dan mematuhi Developers Guide, mengirimkan ke Gerrit, menanggapi ulasan, dan pada akhirnya perubahan mereka diterima.
ko_kr: 첫 번째 패치를 병합합니다. 멘토들은 멘티들이 변화를 만들고, 이해하며, 개발자 가이드에 따르고, gerrit에 제출하고, 리뷰에 응답하고, 궁극적으로 그들의 변화를 받아들이는 것을 도울 것입니다.

source: Git Review
id: Ulasan Git
ko_kr: 깃 리뷰

source: Git allows you to:
de: Git erlaubt es Ihnen:
id: Git memungkinkan Anda untuk:
ko_kr: Git은 다음과 같은 이점을 제공합니다.

source: Git is a free and open source distributed version control system that the OpenStack community uses to manage changes to source code and documentation.
de: Git ist ein kostenloses und quelloffenes verteiltes Versionskontrollsystem, mit dem die OpenStack-Community Änderungen an Quellcode und Dokumentation verwaltet.
id: Git adalah sistem kontrol versi terdistribusi gratis dan open source yang digunakan komunitas OpenStack untuk mengelola perubahan kode sumber dan dokumentasi.
ko_kr: Git은 OpenStack 커뮤니티가 소스 코드 및 설명서의 변경 사항을 관리하는 데 사용하는 무료 오픈 소스 분산 버전 제어 시스템입니다.

source: Git review assumes the user you're running it as is the same as your Gerrit username. If it's not, you can tell it by setting this git config setting::
de: Die Git-Bewertung geht davon aus, dass der Benutzer, den sie ausfüht, mit seinen Gerrit-Benutzernamen identisch ist. Wenn nicht, können Sie es erkennen, indem Sie diese Git-Konfigurationseinstellung setzen::
id: Ulasan Git mengasumsikan pengguna yang Anda jalankan sama dengan nama pengguna Gerrit Anda. Jika tidak, Anda dapat mengetahuinya dengan mengatur pengaturan konfigurasi git ini ::
ko_kr: Git 검토에서는 사용자가 Gerrit 사용자 이름과 동일한 것으로 가정합니다. 그렇지 않은 경우 다음과 같이 git 구성 설정을 지정하여 확인할 수 있습니다.

source: Git review is a tool maintained by the OpenStack community. It adds an additional sub-command to 'git' like so::
de: Git Review ist ein Tool, das von der OpenStack-Community gepflegt wird. Es fügt ein zusätzliches Unterbefehl zu 'git' wie folgt hinzu::
id: Ulasan Git adalah alat yang dikelola oleh komunitas OpenStack. Ia menambahkan sub-command tambahan ke 'git' seperti:
ko_kr: Git Review는 OpenStack 커뮤니티에서 관리하는 툴입니다. 다음과 같이 'git' 에 하위 명령을 추가합니다.

source: Git reviews only needs to be initialized once in a repository.
de: Git-Reviews müssen nur einmal in einem Repository initialisiert werden.
id: Ulasan Git hanya perlu diinisialisasi satu kali dalam repositori.
ko_kr: Git 검토는 리포지토리에서 한 번만 초기화하면 됩니다.

source: Go to `Gerrit's SSH Public Keys settings <https://review.opendev.org/#/settings/ssh-keys>`_.
id: Pergi ke `Gerrit's SSH Public Keys settings <https://review.opendev.org/#/settings/ssh-keys>`_.
ko_kr: `Gerrit의 SSH 공용 키 설정 <https://review.opendev.org/#/settings/ssh-keys>`_ 로 이동합니다.

source: Go to the Git `download page <https://git-scm.com/downloads>`_ and click **Mac OS X**.
de: Gehen Sie zur Git `Download-Seite <https://git-scm.com/downloads>`_ und klicken Sie auf **Mac OS X**.
id: Lihat ke Git `download page <https://git-scm.com/downloads>`_ dan klik **Mac OS X**.
ko_kr: `Git 다운로드 페이지 <https://git-scm.com/downloads>`_ 으로 이동하여 **Mac OS X** 를 클릭합니다.

source: Go to the `storyboard.openstack.org <https://storyboard.openstack.org>`_.
de: Gehen Sie zu `storyboard.openstack.org <https://storyboard.openstack.org>`_.
id: Lihat ke `storyboard.openstack.org <https://storyboard.openstack.org>`_.
ko_kr: `storyboard.openstack.org <https://storyboard.openstack.org>`_ 로 이동하십시오.

source: Groups
de: Gruppen
id: Grup
ko_kr: 그룹

source: Have a low risk of introducing a regression
id: Memiliki risiko rendah untuk memperkenalkan regresi
ko_kr: 회귀할 위험이 낮습니다.

source: Have a user visible benefit
id: Memiliki manfaat yang terlihat oleh pengguna
ko_kr: 사용자에게 가시적인 이점을 제공합니다.

source: Having the main projects following the release cycle ensures that all these projects release at the same time so these can be picked up by downstream teams to package and further distribute.
de: Wenn die Hauptprojekte dem Release-Zyklus folgen, wird sichergestellt, dass alle diese Projekte gleichzeitig freigegeben werden, so dass diese von nachgelagerten Teams aufgegriffen und verpackt und weiterverteilt werden können.
id: Memiliki proyek utama setelah siklus rilis memastikan bahwa semua proyek ini dirilis pada waktu yang sama sehingga ini dapat diambil oleh tim hilir untuk dipaket dan didistribusikan lebih lanjut.
ko_kr: 릴리스 주기에 따라 주요 프로젝트를 수행하면 이러한 모든 프로젝트가 동시에 릴리스되므로 다운스트림 팀이 이러한 프로젝트를 선택하여 패키징하고 추가로 배포할 수 있습니다.

source: Help translate OpenStack, making it more available for users worldwide
de: Unterstützung bei der Übersetzung von OpenStack, damit es für Benutzer weltweit verfügbar ist
id: Bantu menerjemahkan OpenStack, menjadikannya lebih tersedia untuk pengguna di seluruh dunia
ko_kr: OpenStack을 번역할 수 있도록 지원하여 전 세계 사용자가 더욱 편리하게 사용할 수 있도록 합니다.

source: Highlight and copy the output.
de: Markieren und kopieren Sie die Ausgabe.
id: Sorot dan salin hasilnya.
ko_kr: 출력을 강조 표시하고 복사합니다.

source: IRC Archives
de: IRC-Archive
id: Arsip IRC
ko_kr: IRC 아카이브

source: IRC Channels
de: IRC-Kanäle
id: Saluran IRC
ko_kr: IRC 채널

source: IRC Meetings
id: Pertemuan IRC
ko_kr: IRC 미팅

source: IRC allows different programs to listen to the IRC channels and do some actions. These programs are called IRC bots. There are several bots used in the OpenStack IRC channels, this section contains the ones which are useful from the first days of OpenStack development. A more comprehensive list can be found in the `Infrastructure team IRC page <https://docs.openstack.org/infra/system-config/irc.html>`__.
de: IRC ermöglicht es verschiedenen Programmen, die IRC-Kanäle zu hören und einige Aktionen durchzuführen. Diese Programme werden als IRC-Bots bezeichnet. Es gibt mehrere Bots, die in den OpenStack IRC-Kanälen verwendet werden, dieser Abschnitt enthält diejenigen, die ab den ersten Tagen der OpenStack-Entwicklung nützlich sind. Eine umfassendere Liste finden Sie auf der `Infrastruktur-Team IRC-Seite <https://docs.openstack.org/infra/system-config/irc.html>`__.
id: IRC memungkinkan berbagai program mendengarkan saluran IRC dan melakukan beberapa tindakan. Program-program ini disebut IRC bot. Ada beberapa bot yang digunakan dalam saluran IRC OpenStack, bagian ini berisi yang berguna dari hari-hari pertama pengembangan OpenStack. Daftar yang lebih komprehensif dapat ditemukan di `Infrastructure team IRC page <https://docs.openstack.org/infra/system-config/irc.html>`__.
ko_kr: IRC는 여러 프로그램이 IRC 채널을 청취하고 일부 작업을 수행할 수 있도록 허용합니다. 이러한 프로그램을 IRC 봇이라고 합니다. OpenStack IRC 채널에는 여러 개의 봇이 사용되며, 이 섹션에는 OpenStack 개발 첫날부터 유용한 봇이 포함되어 있습니다. 보다 포괄적인 목록은 `인프라팀 IRC 페이지 <https://docs.openstack.org/infra/system-config/irc.html>`_ 에서 확인할 수 있습니다.

source: IRC allows you to:
de: IRC ermöglicht es Ihnen:
id: IRC memungkinkan Anda untuk:
ko_kr: IRC는 다음을 가능하게 합니다.

source: IRC bots
id: Bot IRC
ko_kr: IRC 봇

source: If English is not your native language, you may wish to contribute as a translator. All services and documents that are visible to the user are translated by the I18n team. It does not matter which language you speak. We already have a lot of language teams who are very active. Our claim is more diversity, to support us in our work at I18n.
de: Wenn Englisch nicht Ihre Muttersprache ist, können Sie sich als Übersetzer beteiligen. Alle Dienste und Dokumente, die für den Benutzer sichtbar sind, werden vom I18n-Team übersetzt. Es spielt keine Rolle, welche Sprache Sie sprechen. Wir haben bereits viele Sprachteams, die sehr aktiv sind. Unser Anspruch ist mehr Vielfalt, um uns in unserer Arbeit an der I18n zu unterstützen.
id: Jika bahasa Inggris bukan bahasa ibu Anda, Anda mungkin ingin berkontribusi sebagai penerjemah. Semua layanan dan dokumen yang dapat dilihat oleh pengguna diterjemahkan oleh tim I18n. Tidak masalah bahasa apa yang Anda gunakan. Kami sudah memiliki banyak tim bahasa yang sangat aktif. Klaim kami lebih beragam, untuk mendukung kami dalam pekerjaan kami di I18n.
ko_kr: 영어가 모국어가 아니라면 번역가로서 기여하고 싶을 것입니다. 사용자에게 표시되는 모든 서비스와 문서는 I18n 팀에 의해 번역됩니다. 당신이 어떤 언어를 말하는지는 중요하지 않습니다. 우리는 이미 매우 활동적인 언어 팀을 많이 보유하고 있습니다. 우리의 주장은 I18n에서의 우리의 업무를 지원하기 위한 더 많은 다양성입니다.

source: If all goes well you should receive a message back instantly that the nick name is registered by you and an activation email will be sent to the email address you provided.
de: Wenn alles gut geht, sollten Sie sofort eine Nachricht erhalten, dass der Spitzname von Ihnen registriert ist und eine Aktivierungs-E-Mail an die von Ihnen angegebene E-Mail-Adresse gesendet wird.
id: Jika semuanya berjalan dengan baik, Anda harus menerima pesan kembali secara instan bahwa nama panggilan terdaftar oleh Anda dan email aktivasi akan dikirim ke alamat email yang Anda berikan.
ko_kr: 모든 문제가 해결되면 닉네임이 등록되어 있고 정품 인증 이메일이 제공된 이메일 주소로 전송된다는 메시지를 즉시 수신해야 합니다.

source: If the CCLA only needs to be extended follow `this <https://wiki.openstack.org/wiki/HowToUpdateCorporateCLA>`_ procedure.
de: Wenn die CCLA nur erweitert werden muss, folgen Sie dieser `Prozedur <https://wiki.openstack.org/wiki/HowToUpdateCorporateCLA>`_.
id: Jika CCLA hanya perlu diperpanjang, ikuti `this <https://wiki.openstack.org/wiki/HowToUpdateCorporateCLA>`_ prosedur.
ko_kr: `CCLA만 연장하면 되는 경우 <https://wiki.openstack.org/wiki/HowToUpdateCorporateCLA>`_ 절차를 따릅니다.

source: If the bug is related to a security vulnerability it is important to click the box to alert the Vulnerability Management Team to the issue. When you feel you have added all of the information needed, go ahead and submit the bug report. For more information about the full process for reporting security vulnerabilties, please continue reading `this page <https://security.openstack.org/vmt-process.html>`_.
de: Wenn der Fehler mit einer Sicherheitsschwachstelle zusammenhängt, ist es wichtig, das Kontrollkästchen anzuklicken, um das Vulnerability Management Team über das Problem zu informieren. Wenn Sie das Gefühl haben, dass Sie alle erforderlichen Informationen hinzugefügt haben, senden Sie den Fehlerbericht. Weitere Informationen über den gesamten Prozess zur Meldung von Sicherheitsschwachstellen finden Sie unter `dieser Seite <https://security.openstack.org/vmt-process.html>`_.
id: Jika bug terkait dengan kerentanan keamanan, penting untuk mengklik kotak untuk memberi tahu Vulnerability Management Team terhadap masalah tersebut. Ketika Anda merasa telah menambahkan semua informasi yang diperlukan, silakan dan kirim laporan bug. Untuk informasi lebih lanjut tentang proses lengkap untuk melaporkan kerentanan keamanan, silakan lanjutkan membaca `this page <https://security.openstack.org/vmt-process.html>`_.
ko_kr: 버그가 보안 취약성과 관련된 경우 이 상자를 클릭하여 취약성 관리 팀에 이 문제를 알리는 것이 중요합니다. 필요한 모든 정보를 추가했다고 생각되면 버그 보고서를 제출합니다. 보안 취약점을 보고하기 위한 전체 프로세스에 대한 자세한 내용은 `이 페이지 <https://security.openstack.org/vmt-process.html>`_ 을 계속 읽어 주십시오.

source: If there is a topic you are interested in mentoring someone in, or being mentored in, the organizers are always looking for new ideas! Please fill out the form below that corresponds to your roll and let them know!
de: Wenn es ein Thema gibt, in dem Sie interessiert sind, jemanden zu betreuen oder betreut zu werden, sind die Organisatoren immer auf der Suche nach neuen Ideen! Bitte füllen Sie das untenstehende Formular aus, das Ihrer Rolle entspricht, und teilen Sie es ihnen mit!
id: Jika ada topik yang Anda minati dalam membimbing seseorang, atau dibimbing, penyelenggara selalu mencari ide baru! Silakan isi formulir di bawah ini yang sesuai dengan gulungan Anda dan beri tahu mereka!
ko_kr: 만약 여러분이 누군가를 멘토링하거나 멘토링하는 데 관심이 있는 주제가 있다면, 주최자들은 항상 새로운 아이디어를 찾고 있습니다! 당신의 롤에 해당하는 아래 양식을 작성해서 알려주세요!

source: If you already have an Ubuntu One Account, you can just login.
de: Wenn Sie bereits ein Ubuntu One-Konto haben, können Sie sich einfach anmelden.
id: Jika Anda sudah memiliki Akun Ubuntu One, Anda bisa masuk.
ko_kr: Ubuntu One 계정이 이미 있는 경우 로그인하기만 하면 됩니다.

source: If you are contributing on behalf of a company or organization.
de: Wenn Sie im Namen eines Unternehmens oder einer Organisation einen Beitrag leisten.
id: Jika Anda berkontribusi atas nama perusahaan atau organisasi.
ko_kr: 회사나 단체를 대표하여 기여하고 있는 경우입니다.

source: If you don't have a Ubuntu One Account, click the **I am a new Ubuntu One user**.
de: Wenn Sie kein Ubuntu One-Konto haben, klicken Sie auf **Ich bin ein neuer Ubuntu One-Benutzer**.
id: Jika Anda tidak memiliki Akun Ubuntu One, klik **I am a new Ubuntu One user**.
ko_kr: Ubuntu One 계정이 없는 경우 **I am a new Ubuntu One user** 를 클릭합니다.

source: If you don't have pip installed already, follow the `installation documentation <https://pip.pypa.io/en/stable/installing/#installing-with-get-pip-py>`_ for pip.
de: Wenn Sie pip noch nicht installiert haben, folgen Sie der `Installationsdokumentation <https://pip.pypa.io/en/stable/installing/#installing-with-get-pip-py>`_ für pip.
id: Jika Anda belum menginstal pip, ikuti `installation documentation <https://pip.pypa.io/en/stable/installing/#installing-with-get-pip-py>`_ untuk pip.
ko_kr: pip을 아직 설치하지 않은 경우, pip에 대한 `pip 설명서 <https://pip.pypa.io/en/stable/installing/#installing-with-get-pip-py>`_ 에 따릅니다.

source: If you don't know what your Gerrit username is, you can check the `Gerrit settings <https://review.opendev.org/#/settings/>`_.
id: Jika Anda tidak tahu apa nama pengguna Gerrit Anda, Anda dapat memeriksa `Gerrit settings <https://review.opendev.org/#/settings/>`_.
ko_kr: Gerrit 사용자 이름이 무엇인지 모르는 경우 `Gerrit 설정 <https://review.opendev.org/#/settings/>`_ 을 확인할 수 있습니다.

source: If you don't see .pub extension file or want to generate a specific set for OpenStack Gerrit, you need to generate keys.
de: Wenn Sie die Erweiterungsdatei .pub nicht sehen oder ein bestimmtes Set für OpenStack Gerrit generieren möchten, müssen Sie Schlüssel generieren.
id: Jika Anda tidak melihat file ekstensi .pub atau ingin membuat kumpulan spesifik untuk OpenStack Gerrit, Anda perlu membuat kunci.
ko_kr: .pub 확장 파일이 표시되지 않거나 OpenStack Gerrit에 대한 특정 집합을 생성하려면 키를 생성해야 합니다.

source: If you get a notice that the nick name is already taken, quit and go back to the first set of steps to pick a different nickname.
de: Wenn Sie eine Nachricht erhalten, dass der Spitzname bereits vergeben ist, beenden Sie das Programm und gehen Sie zurück zum ersten Schritt, um einen anderen Spitznamen auszuwählen.
id: Jika Anda mendapat pemberitahuan bahwa nama samaran sudah diambil, keluar dan kembali ke langkah pertama untuk memilih nama panggilan yang berbeda.
ko_kr: 닉네임이 이미 사용되었다는 메시지가 표시되면 종료한 후 첫 번째 단계로 돌아가 다른 닉네임을 선택합니다.

source: If you have the ATC status, in the official OpenStack project where you contributed over the last two 6-month release cycles you are considered to be an Active Project Contributor.
de: Wenn Sie den ATC-Status haben, werden Sie im offiziellen OpenStack-Projekt, in dem Sie in den letzten beiden 6-monatigen Release-Zyklen beigetragen haben, als aktiver Projektmitarbeiter betrachtet.
id: Jika Anda memiliki status ATC, dalam proyek OpenStack resmi tempat Anda berkontribusi selama dua siklus rilis 6 bulan terakhir, Anda dianggap sebagai Kontributor Proyek Aktif.
ko_kr: ATC 상태일 경우, 지난 2회의 6개월 릴리즈 주기 동안 기여했던 공식 OpenStack 프로젝트에서는 적극적 프로젝트 기여자로 간주됩니다.

source: If you use the package manager `Homebrew <http://brew.sh>`_, open a terminal and type::
de: Wenn Sie den Paketmanager `Homebrew <http://brew.sh>`_ verwenden, öffnen Sie ein Terminal und geben Sie ein::
id: Jika Anda menggunakan manajer paket `Homebrew <http://brew.sh>` _, buka terminal dan ketik ::
ko_kr: 패키지 관리자 `Homebrew <http://brew.sh>`_ 을 사용하는 경우 터미널을 열고 다음을 입력하십시오.

source: If your change fails in the gate, then there is an increased chance it is introducing non-deterministic failure behavior. Forcing it to go through check again helps make that more apparent.
id: Jika perubahan Anda gagal di gerbang, maka ada kemungkinan peningkatan itu memperkenalkan perilaku kegagalan non-deterministik. Memaksanya melewati pemeriksaan lagi membantu membuatnya lebih jelas.
ko_kr: 게이트에서 변경에 실패하면 비결정적 실패 동작을 도입할 가능성이 높아집니다. 검사를 다시 거치도록 강제하는 것은 이 점을 더욱 명확히 하는 데 도움이 됩니다.

source: Import Public Key Into Gerrit
de: Öffentlichen Schlüssel in Gerrit importieren
id: Impor Kunci Publik Ke Gerrit
ko_kr: 공용 키를 Gerrit 으로 가져옵니다.

source: In Gerrit's `settings <https://review.opendev.org/#/settings/agreements>`_ click the **New Contributor Agreement** link and sign the agreement.
id: Dalam Gerrit's `settings <https://review.opendev.org/#/settings/agreements>`_ klik tautan **New Contributor Agreement** dan tandatangani perjanjian.
ko_kr: `Gerrit의 설정에서 <https://review.opendev.org/#/settings/agreements>`_ 에서 **새 기부자 계약** 링크를 클릭하고 계약서에 서명합니다.

source: In Gerrit's `settings <https://review.opendev.org/#/settings/agreements>`_ click the **New Contributor Agreement** link and sign the agreement. You need this to contribute code & documentation. You will not be able to push patches to Gerrit without this.
id: Dalam `setelan <Gerps's <https://review.opendev.org/#/settings/agreements>` _ klik tautan **New Contributor Agreement** dan tandatangani perjanjian. Anda memerlukan ini untuk berkontribusi kode & dokumentasi. Anda tidak akan bisa mendorong patch ke Gerrit tanpa ini.
ko_kr: `Gerrit 설정 <https://review.opendev.org/#/settings/agreements>`_ 에서 **새 기부자 계약** 링크를 클릭하고 계약서에 서명합니다. 코드와 문서를 작성하려면 이 정보가 필요합니다. 이것 없이는 게리트에 패치를 푸시할 수 없습니다.

source: In Launchpad, a new feature is called a blueprint. To file a new blueprint, click the 'Register a blueprint' button on the right.
de: Im Launchpad wird ein neues Feature als Blueprint bezeichnet. Um einen neuen Blueprint einzureichen, klicken Sie auf die Schaltfläche "Einen Blueprint registrieren" auf der rechten Seite.
id: Di Launchpad, fitur baru disebut cetak biru. Untuk mengajukan cetak biru baru, klik tombol 'Register a blueprint' di sebelah kanan.
ko_kr: 런치패드에서 새 기능을 Blueprint라고 합니다. 새 Blueprint를 제출하려면 오른쪽의 'Blueprint 등록' 버튼을 클릭합니다.
