Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-code-and-documentation.po
Languages: de, id, ko_kr, zh_cn

source: **Inline Comments**
de: **Inline-Kommentare**
ko_kr: **인라인 코멘트**
zh_cn: **行内评论**

source: **Reviewing Best Practices**
de: **Überprüfung Best Practices**
ko_kr: **리뷰 모범 사례**
zh_cn: **审阅最佳实践**

source: +W: Approved. This patch will now be run through a final round of checks before it is merged into the repository.
de: +W: Genehmigt. Dieser Patch wird nun einer letzten Runde von Prüfungen unterzogen, bevor er in das Repository eingemischt wird.
id: +W: Disetujui. Patch ini sekarang akan dijalankan melalui putaran pemeriksaan terakhir sebelum digabungkan ke dalam repositori.
ko_kr: +W: 승인되었습니다. 이제 이 패치는 리포지토리에 병합되기 전에 최종 검사 과정을 통해 실행됩니다.
zh_cn: +W：已批准。 现在，在将补丁合并到软件仓库之前，将对其进行最后一轮检查。

source: ...and *amend* the current commit
id: ... dan *amend* komit saat ini
ko_kr: ...및 현재 커밋을 *수정(amend)* 합니다.
zh_cn: ...和*修正（amend）*当前提交

source: ...and tell ``git-restack`` to proceed
id: ... dan beri tahu ``git-restack`` untuk melanjutkan
ko_kr: ...그리고 ``git-restack`` 에게 진행하라고 말합니다.
zh_cn: ...然后告诉 ``git-restack`` 继续

source: :ref:`launchpad` is one of the task tracking tools that the community is using.
de: :ref:`launchpad` ist eines der Task-Tracking-Tools, die die Community verwendet.
id: :ref:`launchpad` adalah salah satu alat pelacak tugas yang digunakan komunitas.
ko_kr: :ref:`launchpad` 는 커뮤니티에서 사용하고 있는 태스크 추적 도구 중 하나입니다.
zh_cn: :ref:`launchpad` 是社区正在使用的任务跟踪工具之一。

source: :ref:`storyboard` is a community-developed task tracking tool. The community-wide adoption of the tool is in progress, you will find more and more projects who migrated over to using StoryBoard already.
de: :ref:`storyboard` ist ein von der Community entwickeltes Tool zur Aufgabenverfolgung. Die gemeindeweite Einführung des Tools ist im Gange, Sie werden immer mehr Projekte finden, die bereits auf StoryBoard umgestellt wurden.
id: :ref:`storyboard` adalah alat pelacak tugas yang dikembangkan masyarakat. Adopsi alat di seluruh komunitas sedang berlangsung, Anda akan menemukan semakin banyak proyek yang bermigrasi untuk menggunakan StoryBoard.
ko_kr: :ref:`storyboard` 는 커뮤니티에서 개발한 작업 추적 도구입니다. 현재 커뮤니티 전반에 걸쳐 도구를 채택하고 있으며, 이미 StoryBoard를 사용하여 마이그레이션한 프로젝트도 늘어나고 있습니다.
zh_cn: :ref:`storyboard` 是社区开发的一个任务跟踪工具。 该工具正在社区范围内采用，您将发现越来越多的项目已迁移到使用StoryBoard工具中来。

source: A ``clean.sh`` run does the steps for ``unstack.sh`` plus additional cleaning:
de: Ein ``clean.sh`` Lauf führt die Schritte für ``unstack.sh`` plus zusätzliche Reinigung durch:
id: Jalankan ``clean.sh`` melakukan langkah-langkah untuk ``unstack.sh`` plus pembersihan tambahan:
ko_kr: ``clean.sh`` 실행은 ``unstack.sh`` 단계와 추가 정리를 수행합니다.
zh_cn: ``clean.sh`` 运行执行 ``unstack.sh`` 的步骤以及其他清理工作：

source: A log of the stack.sh run is kept in ``/opt/stack/logs/stack.sh.log``.
de: Ein Protokoll des stack.sh-Laufs wird in ``/opt/stack/stack/logs/stack.sh.log`` geführt.
id: Log run stack.sh disimpan ``/opt/stack/logs/stack.sh.log``.
ko_kr: stack.sh 실행에 대한 로그가 ``/opt/stack/logs/stack.sh.log`` 에 저장됩니다
zh_cn: stack.sh运行的日志会保存在/opt/stack/logs/stack.sh.log中。

source: A more complete reference of using systemd to interact with DevStack can be found on the `Using Systemd in DevStack <https://docs.openstack.org/devstack/latest/systemd.html>`_ page.
de: Eine umfassendere Referenz zur Verwendung von systemd zur Interaktion mit DevStack finden Sie auf der Seite `Using Systemd in DevStack <https://docs.openstack.org/devstack/latest/systemd.html>``_.
id: Referensi yang lebih lengkap tentang penggunaan systemd untuk berinteraksi dengan DevStack dapat ditemukan di halaman `Using Systemd in DevStack <https://docs.openstack.org/devstack/latest/systemd.html>`_.
ko_kr: DevStack과 상호작용하기 위한 systemd 활용 전체 레퍼런스는 `Using Systemd in DevStack <https://docs.openstack.org/devstack/latest/systemd.html>`_ 페이지에서 찾을 수 있습니다.
zh_cn: 可以在 `Using Systemd in DevStack <https://docs.openstack.org/devstack/latest/systemd.html>`_ 页面上找到有关使用systemd与DevStack进行交互的更完整参考。

source: A patch chain is easy to handle if you keep in mind a few recommendations:
de: Eine Patchkette ist einfach zu handhaben, wenn man ein paar Empfehlungen beachtet:
id: Rantai patch mudah ditangani jika Anda mengingat beberapa rekomendasi:
ko_kr: 몇가지 권장 사항을 염두해두면 패치 체인을 다루기 쉬울 것입니다:
zh_cn: 如果您牢记下面一些建议，则修补链很容易处理：

source: Adding Reviewers
de: Hinzufügen von Reviewern
id: Menambahkan Reviewer
ko_kr: 검토자 추가
zh_cn: 添加审核人员

source: Administrator guide
ko_kr: 관리자 가이드
zh_cn: 管理员指南

source: After checking out the patch, you will be switched to a new branch automatically, on which you can make your changes.
de: Nach dem Auschecken des Patches werden Sie automatisch zu einem neuen Zweig gewechselt, an dem Sie Ihre Änderungen vornehmen können.
id: Setelah memeriksa patch, Anda akan beralih ke cabang baru secara otomatis, tempat Anda dapat melakukan perubahan.
ko_kr: 패치를 체크아웃하면 자동으로 새 분기로 전환되어 변경 작업을 수행할 수 있습니다.
zh_cn: 签出了补丁之后，您会被自动切换到一个新的分支，在这个分支上进行您的修改。

source: After proposing changes, you can track them at `Code Review <https://review.opendev.org>`_. After logging in, you will see a dashboard of "Outgoing reviews" for changes you have proposed, "Incoming reviews" for changes you are reviewing, and "Recently closed" changes for which you were either a reviewer or owner.
id: Setelah mengajukan perubahan, Anda dapat melacaknya di `Code Review <https://review.opendev.org>` _. Setelah masuk, Anda akan melihat dasbor "Outgoing reviews" untuk perubahan yang Anda usulkan, "Incoming reviews" untuk perubahan yang Anda kaji, dan perubahan "Recently closed" di mana Anda menjadi pengulas atau pemilik.
ko_kr: 변경 사항을 제안하면 `코드 리뷰 <https://review.opendev.org>`_ 에서 추적할 수 있습니다. 로그인한 후 제안된 변경사항에 대한 "검토 중" 대시보드, 검토 중인 변경사항에 대한 "검토 중" 대시보드, 검토자 또는 소유자가 된 "최근에 닫힌" 변경사항이 표시됩니다.
zh_cn: 提出更改建议后，您可以在 `Code Review <https://review.opendev.org>`_ 处进行跟踪。 登录后，您将看到总控页面（Dashboard），其中包含您已建议更改的 “即将结束审核(Outgoing reviews）” ，您正在进行审核的 “即将到来审核（Incoming reviews）” 以及您曾经是审核人员或更改拥有者的 “最近关闭” 更改。

source: After you've completed the Setup and Learn GIT section, the following command configures the repository to know about Gerrit and installs the ``Change-Id`` commit hook. You only need to do this once per repository you clone::
de: Nachdem Sie den Abschnitt Setup and Learn GIT abgeschlossen haben, konfiguriert der folgende Befehl das Repository, um mehr über Gerrit zu erfahren, und installiert den Commit-Hook "Change-Id". Sie müssen dies nur einmal pro Repository tun, das Sie klonen::
id: Setelah Anda menyelesaikan bagian Setup dan Learn GIT , perintah berikut mengonfigurasi repositori untuk mengetahui tentang Gerrit dan menginstal commit hook (kait komit) ``Change-Id``. Anda hanya perlu melakukan ini sekali per repositori yang Anda clone::
ko_kr: 설정 및 학습 GIT 섹션을 완료한 후 다음 명령은 리포지토리가 게리트에 대해 알 수 있도록 구성하고 ``Change-Id`` 커밋 후크를 설치합니다. 복제하는 리포지토리에 한 번만 이 작업을 수행하면 됩니다.
zh_cn: 完成了“设置和学习GIT”章节后，以下命令将配置仓库以了解Gerrit并安装 ``Change-Id`` 提交钩子（commit hook）。 您只需为每个克隆的仓库执行一次此操作：

source: All project documentation must follow the same directory structure, which is described on the `Project Guide Setup page`_.
ko_kr: 모든 프로젝트 문서는 `Project Guide Setup page`_ 에 설명 된 것과 동일한 디렉토리 구조를 따라야합니다.
zh_cn: 所有项目文档都必须遵循相同的目录结构，该结构在 `Project Guide Setup page`_ 中进行了描述。

source: All the Sandbox repository and projects are identical to any other active project's resources. You can find the same information and same functionality as well to ensure you can practice everything you need to know about the tool.
de: Alle Sandbox-Repositorys und Projekte sind identisch mit den Ressourcen anderer aktiver Projekte. Sie können die gleichen Informationen und die gleiche Funktionalität finden, um sicherzustellen, dass Sie alles, was Sie über das Tool wissen müssen, üben können.
id: Semua repositori dan proyek Sandbox identik dengan sumber daya proyek aktif lainnya. Anda dapat menemukan informasi yang sama dan fungsi yang sama juga untuk memastikan Anda dapat mempraktikkan semua yang perlu Anda ketahui tentang alat ini.
ko_kr: 모든 샌드박스 리포지토리 및 프로젝트는 다른 활성 프로젝트의 리소스와 동일합니다. 툴에 대해 알아야 할 모든 것을 연습할 수 있도록 동일한 정보와 기능을 찾을 수 있습니다.
zh_cn: 所有沙箱仓库（Sandbox Repo）和项目都与任何其他活跃项目的资源相同。 您还可以找到相同的信息和相同的功能，以确保可以练习所需的有关该工具的所有知识。

source: Allows you to:
de: Wenn Sie mit Ihrer Cloud ein externes Speicher-Plugin oder ein gemeinsam genutztes Dateisystem verwenden, können Sie testen, ob es funktioniert, indem Sie eine zweite Freigabe oder einen zweiten Endpunkt erstellen. So können Sie das System testen, bevor Sie die neue Version Ihrem Speicher anvertrauen.
id: Memungkinkan Anda untuk:
ko_kr: 다음을 수행 할 수 있습니다:
zh_cn: 允许您:

source: Always check the changes you made to each patch and be careful that you applied the changes in the right one as patches still get merged individually and there is no guarantee that the whole chain gets landed at the same time.
de: Überprüfen Sie immer die Änderungen, die Sie an jedem Patch vorgenommen haben, und achten Sie darauf, dass Sie die Änderungen im richtigen Patch vorgenommen haben, da Patches immer noch einzeln zusammengeführt werden und es keine Garantie dafür gibt, dass die gesamte Kette gleichzeitig gelandet wird.
id: Selalu periksa perubahan yang Anda buat untuk setiap patch dan berhati-hatilah bahwa Anda menerapkan perubahan di patch yang tepat karena patch masih dapat digabung secara individual dan tidak ada jaminan bahwa seluruh rantai akan mendarat pada waktu yang sama.
ko_kr: 패치가 개별적으로 병합되고 전체 체인이 동시에 도착한다는 보장이 없으므로 항상 각 패치의 변경 사항을 확인하고 오른쪽 패치의 변경 사항을 적용했는지 확인합니다.
zh_cn: 始终检查对每个补丁所做的更改，并注意将正确的更改应用到正确的位置，因为补丁仍会单独合并，并且不能保证整个补丁链都可以同时合并进去。

source: Always handle a chain as one block of changes by rebasing the whole chain and keep it up to date when you modify a patch to fix review comments or add changes to it.
de: Behandeln Sie eine Kette immer als einen Block von Änderungen, indem Sie die gesamte Kette neu aufbauen und sie auf dem neuesten Stand halten, wenn Sie einen Patch ändern, um Kommentare zur Überprüfung zu korrigieren oder Änderungen hinzuzufügen.
id: Selalu tangani rantai sebagai satu blok perubahan dengan mengubah seluruh rantai dan tetap perbarui saat Anda memodifikasi patch untuk memperbaiki komentar ulasan atau menambahkan perubahan ke dalamnya.
ko_kr: 체인을 항상 전체 체인을 다시 생성하여 하나의 변경 블록으로 처리하고 패치를 수정하여 검토 주석을 수정하거나 체인에 변경사항을 추가할 때 체인을 최신 상태로 유지합니다.
zh_cn: 始终通过重新调整整个补丁链为基础，将补丁链作为一个更改整体来处理，并在修改补丁以修复评论注释或向补丁添加更改时保持最新。

source: Always have a local branch for these changes to ensure that you don't mix it together with changes related to another feature or bug fix.
de: Haben Sie immer einen lokalen Zweig für diese Änderungen, um sicherzustellen, dass Sie sie nicht mit Änderungen im Zusammenhang mit einem anderen Feature oder einer Fehlerbehebung vermischen.
id: Selalu memiliki cabang lokal untuk perubahan ini untuk memastikan bahwa Anda tidak mencampurnya bersama dengan perubahan terkait dengan fitur lain atau perbaikan bug.
ko_kr: 다른 기능이나 버그 수정과 관련된 변경 사항과 함께 혼동하지 않도록 이러한 변경 사항에 대한 로컬 브런치를 항상 확인하십시오.
zh_cn: 始终为这些更改建立一个本地分支（local branch），以确保您不会将其与其他功能或错误修复相关的更改混在一起。

source: Always try to extract as much as you can into other patches, like documentation or logical parts of the functionality that do not depend on common functions in a lower layer.
de: Versuchen Sie immer, so viel wie möglich in andere Patches zu extrahieren, wie z.B. Dokumentation oder logische Teile der Funktionalität, die nicht von gemeinsamen Funktionen in einer unteren Schicht abhängig sind.
id: Selalu mencoba mengekstrak sebanyak yang Anda bisa ke patch lain, seperti dokumentasi atau bagian logis dari fungsi yang tidak bergantung pada fungsi umum di lapisan bawah.
ko_kr: 하위 계층의 공통 기능에 의존하지 않는 기능의 논리적 부분이나 문서와 같은 다른 패치로 가능한 한 많이 추출하십시오.
zh_cn: 始终尝试将尽可能多的变更提取到单独的补丁中，例如文档或功能实现中不依赖于底层通用功能的逻辑部分。

source: An important part of development is, obviously, being able to test changes you develop and ensure that they function properly. In a complicated ecosystem like OpenStack there is a need to also be able to verify the interoperability of your code. You may make a change to Cinder but that change can also impact the way that Nova interacts with Cinder's APIs.
de: Ein wichtiger Teil der Entwicklung ist natürlich die Möglichkeit, von Ihnen entwickelte Änderungen zu testen und sicherzustellen, dass sie ordnungsgemäß funktionieren. In einem komplizierten Ökosystem wie OpenStack ist es notwendig, auch die Interoperabilität Ihres Codes überprüfen zu können. Sie können eine Änderung an Cinder vornehmen, aber diese Änderung kann sich auch auf die Art und Weise auswirken, wie Nova mit den APIs von Cinder interagiert.
id: Bagian penting dari pengembangan, tentu saja, dapat menguji perubahan yang Anda kembangkan dan memastikan bahwa mereka berfungsi dengan baik. Dalam ekosistem yang rumit seperti OpenStack, ada juga kebutuhan untuk dapat memverifikasi interoperabilitas kode Anda. Anda dapat membuat perubahan ke Cinder tetapi perubahan itu juga dapat memengaruhi cara Nova berinteraksi dengan API Cinder.
ko_kr: 개발에서 중요한 부분은 바로 개발한 부분에 대한 변경 사항을 테스트하고 제대로 동작하는지를 검증할 수 있는지에 대한 것입니다. OpenStack과 같은 복잡한 생태계에서는 여러분이 작성한 코드에 대한 상호운용성을 검증할 수 있는지가 필요합니다. Cinder에 변경 사항을 만든다면 해당 변경 사항이 Cinder API를 통해 Nova와 어떻게 상호작용하는지에 대한 영향 또한 줄 수 있을 것입니다.
zh_cn: 显而易见，开发过程中很重要的一部分是能够测试您开发的更改并确保它们正常运行。 在像OpenStack这样的复杂生态系统中，还需要能够验证代码的互操作性。 像是您可能对Cinder进行了更改，但是这个更改可能也会影响Nova与Cinder API交互的方式。

source: Any temporary backing files needed to simulate a system are created in /opt/stack/data
de: Alle temporären Sicherungsdateien, die zur Simulation eines Systems benötigt werden, werden in /opt/stack/data erstellt.
id: File cadangan sementara yang diperlukan untuk mensimulasikan sistem dibuat di /opt/stack/data
ko_kr: 시스템을 시뮬레이션하는데 필요로 하는 임시 백업 파일은 /opt/stack/data 에 생성됩니다
zh_cn: 在/opt/stack/data中创建模拟系统所需的临时后备文件

source: Assuming you have not added new files, you commit all your changes using::
de: Angenommen, Sie haben keine neuen Dateien hinzugefügt, übertragen Sie alle Ihre Änderungen mit::
id: Dengan asumsi Anda belum menambahkan file baru, Anda melakukan semua perubahan Anda using::.
ko_kr: 새 파일을 추가하지 않은 경우 다음을 사용하여 모든 변경 사항을 커밋합니다.
zh_cn: 假设您还尚未添加新文件，则使用以下命令提交所有更改::

source: At this point DevStack takes over preparing your node to function as an OpenStack cloud. The following is done:
id: Pada titik ini DevStack mengambil alih mempersiapkan node Anda berfungsi sebagai cloud OpenStack. Berikut ini dilakukan:
ko_kr: 이 부분에서 DevStack은 대상 노드가 OpenStack 클라우드를 동작시키도록 준비시킬 것입니다. 다음 사항이 완료됩니다:
zh_cn: 此时，DevStack接管了准备将节点用作OpenStack云的任务。 以下操作会被执行完成：

source: At this point, I push my series up to gerrit. Note that it makes me confirm that I really want to push two commits at once.
id: Pada titik ini, saya mendorong seri saya ke gerrit. Perhatikan bahwa itu membuat saya mengonfirmasi bahwa saya benar-benar ingin mendorong dua commit sekaligus.
ko_kr: 이 시점에서, 저는 제 시리즈를 게릿트까지 밀어올립니다. 두 개의 커밋을 한 번에 푸시하고 싶은지 확인하게 됩니다.
zh_cn: 到此处，我将我的一系列提交推到gerrit。 请注意，这使我确认我真的想一次推送两次提交。

source: Beyond this you can also look into the functionality to find smaller building blocks and make your changes smaller. For instance changes to an object can be implemented first that you will use later when you implement new API functionality.
de: Darüber hinaus können Sie auch in die Funktionalität schauen, um kleinere Bausteine zu finden und Ihre Änderungen kleiner zu machen. Beispielsweise können Änderungen an einem Objekt zuerst implementiert werden, die Sie später bei der Implementierung neuer API-Funktionen verwenden werden.
id: Selain itu, Anda juga dapat melihat fungsionalitas untuk menemukan blok bangunan yang lebih kecil dan membuat perubahan Anda lebih kecil. Misalnya perubahan pada suatu objek dapat diimplementasikan terlebih dahulu yang akan Anda gunakan nanti ketika Anda menerapkan fungsionalitas API baru.
ko_kr: 이 외에도 더 작은 빌딩 블록을 찾고 변경 사항을 더 작게 만드는 기능을 살펴볼 수도 있습니다. 예를 들어 나중에 새 API 기능을 구현할 때 사용할 개체 변경 사항을 먼저 구현할 수 있습니다.
zh_cn: 除此之外，您还可以研究该功能以找到更小的构件，并使更改量更小。 例如，可以先实现对对象的更改，然后在实现新的API功能时使用它。

source: But I want to edit ``d76195e``, while leaving ``f17f040`` properly stacked on top of it. Here I use a tool called `git-restack <https://docs.openstack.org/infra/git-restack/>`_ (run ``pip install git-restack`` to install it).
id: Tapi saya ingin mengedit ``d76195e``, sementara meninggalkan ``f17f040`` ditumpuk dengan benar di atasnya. Di sini saya menggunakan alat yang disebut `git-restack <https://docs.openstack.org/infra/git-restack/>` _ (jalankan ``pip install git-restack`` untuk menginstalnya).
ko_kr: 그러나 저는 ``d76195e`` 를 편집하고 그 위에 ``f17f040`` 을 적절히 쌓아두고 싶습니다. 여기서는 `git-restack <https://docs.openstack.org/infra/git-restack/>`_ 이라는 도구를 사용합니다(``pip install git-restack`` 을 실행하십시오.)
zh_cn: 但是我想编辑 ``d76195e`` ，同时将 ``f17f040`` 正确堆叠在上面。 在这里，我使用了一个名为 `git-restack <https://docs.openstack.org/infra/git-restack/>`_ 的工具（运行 ``pip install git-restack`` 进行安装）。

source: But oops, I made a mistake in my first commit. My lower constraint can't be higher than my minimum in ``requirements.txt``. If I still had my branch locally, I could skip this next step, but as a matter of rigor to avoid some common pratfalls, I will pull the whole series afresh from gerrit by asking ``git-review`` to grab the *top* change:
id: Tapi oops, saya melakukan kesalahan pada komit pertama saya. Batasan rendah saya tidak boleh lebih tinggi dari minimum di ``requirement.txt``. Jika saya masih memiliki cabang saya secara lokal, saya bisa melewatkan langkah berikutnya, tetapi sebagai ketelitian untuk menghindari beberapa pratfall umum, saya akan menarik seluruh seri lagi dari gerrit dengan meminta ``git-review`` untuk meraih bagian perubahan *top* :
ko_kr: 하지만 이런, 제가 첫 번째 약속에서 실수를 했군요. 나의 낮은 제약조건은 ``요구사항`` 에서 최소치 이상일 수 없습니다.txt. "만약 제가 아직 현지에 지사를 두고 있다면 다음 단계를 건너뛸 수도 있지만, 흔한 낙상을 피하기 위해 엄중한 문제로서 저는 ``git-review`` 를 요청하여 *상위* 의 변화를 이끌어 내겠습니다.
zh_cn: 但是，糟糕，我在第一次提交时犯了一个错误。 我的下限不能高于 ``requirements.txt`` 中的下限。 如果我仍然在本地拥有分支机构，则可以跳过此下一步，但为避免某些常见的困难，我会通过要求 ``git-review`` 抓住*上层*更改来重新编写整个系列 ：

source: By default, the core services for OpenStack are installed but users can configure additional services to be deployed. All services are installed from source. DevStack will pull the services from git master unless configured to clone from a stable branch (i.e. stable/pike).
de: Standardmäßig sind die Kerndienste für OpenStack installiert, aber Benutzer können zusätzliche Dienste für die Bereitstellung konfigurieren. Alle Dienste werden von der Quelle aus installiert. DevStack zieht die Dienste vom Git-Master, es sei denn, es ist konfiguriert, um von einem stabilen Zweig (z.B. stable/pike) zu klonen.
id: Secara default, layanan inti untuk OpenStack diinstal tetapi pengguna dapat mengonfigurasi layanan tambahan untuk digunakan. Semua layanan diinstal dari sumber. DevStack akan menarik layanan dari git master kecuali jika dikonfigurasikan untuk mengklon dari cabang stabil (misal. stable/pike).
ko_kr: 디폴트로, OpenStack에 대한 핵심 서비스들을 설치하지만, 사용자는 부가적인 서비스들이 배포가 이루어질 수 있도록 구성할 수 있습니다. 모든 서비스들은 소스로부터 설치가 됩니다. DevStack은 stable 브랜치 (예: stable/pike)에서 클론하도록 구성하지 않는 이상 master로부터 git를 통해 서비스를 가져옵니다.
zh_cn: 默认情况下，OpenStack的核心服务会被安装，但用户也可以配置需要部署的其他服务。 所有服务均从源安装。 除非脚本被配置为从稳定分支（stable branch）（比如 stable/pike）克隆，否则DevStack将从git master中拉取核心服务。

source: By grouping the changes per module you can also construct the chain or dependencies by the hierarchy of the components and always keep the API changes last as that will enable the new functionality and that change will depend on everything else you needed to touch for your design.
de: Durch die Gruppierung der Änderungen pro Modul können Sie auch die Kette oder Abhängigkeiten durch die Hierarchie der Komponenten konstruieren und die API-Änderungen immer aufrechterhalten, da dies die neue Funktionalität ermöglicht und diese Änderung von allem abhängt, was Sie sonst noch für Ihr Design benötigen.
id: Dengan mengelompokkan perubahan per modul, Anda juga dapat membuat rantai atau dependensi berdasarkan hierarki komponen dan selalu mempertahankan perubahan API yang terakhir karena itu akan mengaktifkan fungsionalitas baru dan perubahan itu akan bergantung pada segala hal lain yang perlu Anda sentuh untuk desain Anda.
ko_kr: 모듈별 변경사항을 그룹화하여 구성 요소의 계층별로 체인 또는 종속성을 구성하고 API 변경사항을 항상 최신 상태로 유지할 수 있습니다. 따라서 새로운 기능이 활성화되며 이러한 변경사항은 설계에 필요한 다른 모든 항목에 따라 달라집니다.
zh_cn: 通过将每个模块的更改分组，您还可以按照组件的层次结构来构建补丁链或依赖关系，并始终保持API更改的最新状态，因为这将启用新功能，并且更改将取决于您需要进行设计的所有其他方面。

source: CLI reference
ko_kr: CLI 참고서
zh_cn: CLI参考

source: Changes that are not related to any feature implementation or bug report can be uploaded but are less welcomed by reviewers.
de: Änderungen, die nichts mit einer Funktionsimplementierung oder einem Fehlerbericht zu tun haben, können hochgeladen werden, werden aber von den Prüfern weniger begrüßt.
id: Perubahan yang tidak terkait dengan implementasi fitur atau laporan bug dapat diunggah tetapi kurang disambut oleh pengulas.
ko_kr: 기능 구현 또는 버그 보고서와 관련이 없는 변경사항은 업로드할 수 있지만 검토자는 이를 환영하지 않습니다.
zh_cn: 通常来讲，可以上传与任何功能实现或错误报告无关的更改，但审核者不欢迎这些更改。

source: Checking Out Others' Changes
de: Änderungen anderer auschecken
id: Memeriksa Perubahan Lain
ko_kr: 다른 사용자의 변경사항을 체크아웃합니다.
zh_cn: 签出（Check Out）其他人的更改

source: Cherry-picking
ko_kr: 체리 피킹
zh_cn: 拣选（Cherry-picking）

source: Cleaning up iSCSI volumes
de: Bereinigung von iSCSI-Volumes
id: Membersihkan volume iSCSI
ko_kr: iSCSI 볼륨 정리하기
zh_cn: 清理iSCSI卷

source: Clearing temporary LVM mounts
de: Löschen von temporären LVM-Mounts
id: Menghapus mount LVM sementara
ko_kr: 임시 LVM 마운트 제거하기
zh_cn: 清除临时LVM挂载

source: Code & Documentation Contributor Guide
de: Code & Dokumentation Mitwirkende Anleitung
ko_kr: 코드 & 문서 작성자 가이드
zh_cn: 代码与文档贡献者指南

source: Code and Documentation Contributors
de: Code und Dokumentation Mitwirkende
id: Kode dan Kontributor Dokumentasi
ko_kr: 코드 및 문서 컨트리뷰터
zh_cn: 代码与文档贡献者

source: Communication is underrated, but crucial when it comes to participating in an open source community. We have several tools that we use for online and offline communication, which we encourage you to use.
de: Kommunikation wird unterschätzt, ist aber entscheidend, wenn es um die Teilnahme an einer Open-Source-Community geht. Wir haben mehrere Tools, die wir für die Online- und Offline-Kommunikation verwenden und die wir Ihnen empfehlen.
id: Komunikasi diremehkan, tetapi penting dalam hal berpartisipasi dalam komunitas open source. Kami memiliki beberapa alat yang kami gunakan untuk komunikasi online dan offline, yang kami anjurkan untuk Anda gunakan.
ko_kr: 의사소통은 과소 평가되어지만 오픈 소스 커뮤니티에 참여할 때 중요합니다. 온라인 및 오프라인 의사소통에 사용하는 몇 가지 도구가 있으므로 사용을 권장합니다.
zh_cn: 有些情况下交流是被低估的，对于参与开源社区来说它至关重要。 我们有几种在线和离线交流工具，建议您使用。

source: Configuration reference
ko_kr: 구성 참고서
zh_cn: 配置参考

source: Contributor guide
ko_kr: 컨트리뷰터 가이드
zh_cn: 贡献者指南

source: Core reviewers have additional voting choices aside from the basic set. Like the basic set, the numbers map to a simple system of meaning:
de: Die Hauptprüfer haben neben dem Basissatz zusätzliche Wahlmöglichkeiten. Wie die Grundmenge bilden die Zahlen ein einfaches Bedeutungssystem ab:
id: Peninjau inti memiliki pilihan suara tambahan selain dari perangkat dasar. Seperti himpunan dasar, angka memetakan ke sistem makna yang sederhana:
ko_kr: 핵심 검토자는 기본 세트 외에 추가 투표 선택권이 있습니다. 기본 집합과 마찬가지로, 숫자는 단순한 의미 시스템에 매핑됩니다.
zh_cn: 核心审阅者除了基本设置外，还有其他投票选择。 像基本值的集合一样，这些数字反映了一个简单的意义系统：

source: Database clean-up
de: Datenbankbereinigung
id: Pembersihan basis data
ko_kr: 데이터베이스 정리
zh_cn: 清理数据库

source: Depends-On Tag
ko_kr: 종속(Depends-On) 태그
zh_cn: Depends-On标签

source: Deploying DevStack
de: Bereitstellung von DevStack
id: Pengerahan DevStack
ko_kr: DevStack 배포하기
zh_cn: 部署DevStack
