Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributing.po
Languages: de, id

source: Adding/Updating Content
de: Hinzufügen/Aktualisieren von Inhalten
id: Menambah / Memperbarui Konten

source: After running ``tox -e docs``, the guide will be available for viewing in HTML format in the ``doc/build/`` directory.
de: Nach der Ausführung von ``tox -e docs`` steht der Leitfaden im HTML-Format im Verzeichnis ``doc/build/`` zur Verfügung.
id: Setelah menjalankan ``tox -e docs``, panduan ini akan tersedia untuk dilihat dalam format HTML di direktori ``doc/build/``.

source: As the Contributor Guide is meant to be general so everyone can use it, here are some helpful examples of what should be contributed. Examples of things that are **not** common should be in your project team's specific documentation which will be listed in the Contributor Portal.
de: Da das Contributor Guide allgemein gehalten ist, so dass jeder es benutzen kann, sind hier einige hilfreiche Beispiele dafür, was beigetragen werden soll. Beispiele für Dinge, die **nicht** üblich sind, sollten in der spezifischen Dokumentation Ihres Projektteams enthalten sein, die im Contributor Portal aufgelistet wird.
id: Karena Panduan Kontributor dimaksudkan bersifat umum sehingga semua orang dapat menggunakannya, berikut adalah beberapa contoh bermanfaat tentang apa yang harus dikontribusikan. Contoh hal yang ** not ** umum harus ada dalam dokumentasi spesifik tim proyek Anda yang akan dicantumkan di Portal Kontributor.

source: At various OpenStack events, the Contributor Guide is used to help various on-boarding programs:
de: Bei verschiedenen OpenStack-Veranstaltungen wird das Contributor Guide verwendet, um verschiedene On-Boarding-Programme zu unterstützen:
id: Di berbagai acara OpenStack, Panduan Kontributor digunakan untuk membantu berbagai program on-boarding:

source: Avoid covering every issue that can be hit along the way. Case by case basis will be accepted depending on how common it is.
de: Vermeiden Sie es, jedes Problem zu behandeln, das unterwegs auftreten kann. Je nachdem, wie verbreitet es ist, wird es von Fall zu Fall akzeptiert.
id: Hindari membahas setiap masalah yang bisa kena sepanjang jalan. Kasus per kasus akan diterima tergantung pada seberapa umum itu.

source: Before you modify or add new content first get familiar with OpenStack's code/documentation practices. You can read the :doc:`/code-and-documentation/index` for getting started.
de: Bevor Sie neue Inhalte ändern oder hinzufügen, machen Sie sich zunächst mit den Code-/Dokumentationsrichtlinien von OpenStack vertraut. Sie können die :doc:`/code-and-documentation/index` für den Einstieg lesen.
id: Sebelum Anda memodifikasi atau menambahkan konten baru, kenali dulu praktik kode / dokumentasi OpenStack. Anda dapat membaca :doc:`/code-and-documentation/index` untuk memulai.

source: Bug reports and tasks are all recorded in `Storyboard <https://storyboard.openstack.org/#!/project/913>`_. If something isn't assigned, it's available for you to take.
de: Fehlerberichte und Aufgaben werden alle in `Storyboard <https://storyboard.openstack.org/#!/project/913>`_ aufgezeichnet. Wenn etwas nicht zugeordnet ist, steht es Ihnen zur Verfügung.
id: Laporan dan tugas bug semuanya dicatat dalam `Storyboard <https://storyboard.openstack.org/#!/project/913>`_. Jika sesuatu tidak ditugaskan, tersedia untuk Anda ambil.

source: Common Content Only
de: Nur allgemeine Inhalte
id: Hanya Konten Umum

source: Content Guidelines
de: Inhaltsrichtlinien
id: Pedoman Konten

source: Contributing to the Contributor Guide
de: Mitwirkung am Mitwirkendenleitfaden
id: Berkontribusi pada Panduan Kontributor

source: Documentation: https://docs.openstack.org/contributors
de: Dokumentation: https://docs.openstack.org/contributors
id: Dokumentasi: https://docs.openstack.org/contributors

source: Examples of Common Documentation
de: Beispiele für gängige Dokumentation
id: Contoh Dokumentasi Umum

source: Examples of Documentation that's NOT Common
de: Beispiele für Dokumentation, die nicht üblich ist.
id: Contoh Dokumentasi yang TIDAK Umum

source: Examples of Good Documentation
de: Beispiele für eine gute Dokumentation
id: Contoh Dokumentasi yang Baik

source: Experienced contributors can find helpful reference links listed here too.
de: Erfahrene Mitwirkende finden hier ebenfalls hilfreiche Links.
id: Kontributor berpengalaman dapat menemukan tautan referensi bermanfaat yang tercantum di sini juga.

source: First it's important to note that we're not just talking about code projects. OpenStack contributions come in different forms such as running meet ups, identifying use cases (Product Working Group), documentation, testing, etc. Our goal is to have these contributions valued equally.
de: Zuerst ist es wichtig zu beachten, dass es sich nicht nur um Codeprojekte handelt. OpenStack-Beiträge gibt es in verschiedenen Formen wie z.B. Meetups abhalten, Identifizierung von Use Cases (Product Working Group), Dokumentation, Testing, etc. Unser Ziel ist es, diese Beiträge gleichwertig zu bewerten.
id: Pertama, penting untuk dicatat bahwa kita tidak hanya berbicara tentang proyek kode. Kontribusi OpenStack datang dalam berbagai bentuk seperti menjalankan pertemuan, mengidentifikasi kasus penggunaan (Product Working Group), dokumentasi, pengujian, dll. Tujuan kami adalah agar kontribusi ini dihargai sama.

source: Free software: Apache license
de: Kostenlose Software: Apache Lizenz
id: Perangkat lunak bebas: lisensi Apache

source: Get Help Contributing
de: Hilfe beim Beitragen erhalten
id: Dapatkan Bantuan Berkontribusi

source: Having the common documentation worked on by various projects will better help prevent duplicated efforts, inconsistent documentation, and will also provide more accurate information. Projects that have zero/outdated documentation can also just use the Contributor Guide.
de: Die gemeinsame Dokumentation, an der verschiedene Projekte arbeiten, wird besser dazu beitragen, doppelten Aufwand und inkonsistente Dokumentation zu vermeiden und genauere Informationen zu liefern. Projekte, die keine/veraltete Dokumentation haben, können auch einfach den Contributor Guide verwenden.
id: Memiliki dokumentasi umum yang dikerjakan oleh berbagai proyek akan lebih baik membantu mencegah upaya duplikasi, dokumentasi tidak konsisten, dan juga akan memberikan informasi yang lebih akurat. Proyek yang memiliki dokumentasi zero/outdated juga dapat menggunakan Panduan Kontributor.

source: How Can I Start Helping?
de: Wie kann ich mit der Hilfe beginnen?
id: Bagaimana Saya Mulai Membantu?

source: How to vote in elections.
de: Wie man bei Wahlen abstimmt.
id: Cara memilih dalam pemilihan.

source: Introduction and Goals
de: Einführung und Ziele
id: Pengantar dan Tujuan

source: No videos please. They're way too complicated to keep updated.
de: Bitte keine Videos. Sie sind viel zu kompliziert, um auf dem Laufenden zu bleiben.
id: Tidak ada video. Mereka terlalu rumit untuk terus diperbarui.

source: No wall of text. The reader should feel like they can finish things on the page in five minutes, instead of having yet another forgotten tab that they'll never get back to.
de: Keine Textwand. Der Leser sollte das Gefühl haben, dass er die Dinge auf der Seite in fünf Minuten erledigen kann, anstatt noch eine weitere vergessene Registerkarte zu haben, auf die er nie zurückkommen wird.
id: Tidak ada dinding teks (No wall of text). Pembaca harus merasa bahwa mereka dapat menyelesaikan hal-hal di halaman dalam lima menit, alih-alih memiliki tab lain yang lupa bahwa mereka tidak akan pernah kembali.

source: Once you've read through the guide, use git to clone the Contributor Guide repository::
de: Nachdem Sie die Anleitung gelesen haben, verwenden Sie git, um das Contributor Guide Repository zu kopieren::
id: Setelah Anda membaca panduan ini, gunakan git untuk mengkloning repositori Panduan Kontributor ::

source: Project Specific Contributor Guides
de: Projektspezifische Leitfäden für Mitwirkende
id: Panduan Kontributor Khusus Proyek

source: Project team on-boarding sessions
de: On-Boarding-Sitzungen des Projektteams
id: Sesi on-boarding tim proyek

source: Project teams should still have their own contributor documentation to cover things listed under `Examples of Documentation that's NOT Common`_. A couple examples of project team specific contributor guides are the `Nova team's <https://docs.openstack.org/nova/latest/contributor/index.html>`_ and the `Documentation team's <https://docs.openstack.org/doc-contrib-guide/>`_.
de: Projektteams sollten immer noch über eine eigene Mitwirkenden-Dokumentation verfügen, um Dinge abzudecken, die unter `Beispiele für Dokumentation, die nicht üblich ist`_ aufgeführt sind. Ein paar Beispiele für projektteamspezifische Mitwirkenden Guides sind die `des Nova Teams <https://docs.openstack.org/nova/latest/contributor/index.html>`_ und die des `Dokumentationsteams <https://docs.openstack.org/doc-contrib-guide/>`_ .
id: Tim proyek masih harus memiliki dokumentasi kontributor mereka sendiri untuk mencakup hal-hal yang tercantum di bawah `Examples of Documentation that's NOT Common`_. Beberapa contoh panduan kontributor khusus tim proyek adalah `Nova team's <https://docs.openstack.org/nova/latest/contributor/index.html>`_ dan `Documentation team's <https://docs.openstack.org/doc-contrib-guide/>`_.

source: Proposing a New Contribution Category
de: Vorschlag für eine neue Beitragskategorie
id: Mengusulkan Kategori Kontribusi Baru

source: Proposing a Project Team Under Code & Documentation
de: Vorschlag eines Projektteams unter Code & Dokumentation
id: Mengusulkan Tim Proyek Berdasarkan Kode dan Dokumentasi

source: Release Notes: https://docs.openstack.org/releasenotes/openstack-manuals/
de: Versionshinweise: https://docs.openstack.org/releasenotes/openstack-manuals/
id: Catatan Rilis: https://docs.openstack.org/releasenotes/openstack-manuals/

source: Send your proposal to the `OpenStack Discuss List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ with the email subject prefixed with [contributor-portal]. This will start discussions on accepting the new contribution category.
de: Senden Sie Ihren Vorschlag an die `OpenStack Diskussionsliste <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ mit [contributor-portal] dem Betreff der E-Mail vorangestellt. Damit werden Diskussionen über die Akzeptanz der neuen Beitragskategorie eingeleitet.
id: Kirim proposal Anda ke `OpenStack Discuss List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ dengan subjek email diawali dengan [contributor-portal]. Ini akan memulai diskusi tentang penerimaan kategori kontribusi baru.

source: Setting up Git.
de: Einrichten von Git.
id: Menyiapkan Git.

source: Setting up IRC to communicate.
de: Einrichten des IRC zur Kommunikation.
id: Menyiapkan IRC untuk berkomunikasi.

source: Setting up Mailing Lists to communicate.
de: Einrichten von Mailinglisten für die Kommunikation.
id: Menyiapkan Milis untuk berkomunikasi.

source: Setting up appropriate accounts to contribute like Gerrit, Storyboard and Launchpad.
de: Einrichtung geeigneter Konten, um einen Beitrag wie Gerrit, Storyboard und Launchpad zu leisten.
id: Menyiapkan akun yang tepat untuk berkontribusi seperti Gerrit, Storyboard, dan Launchpad.

source: Some specific software tool only your project team uses.
de: Ein bestimmtes Softwaretool, das nur Ihr Projektteam verwendet.
id: Beberapa alat perangkat lunak khusus yang hanya digunakan oleh tim proyek Anda.

source: Source: https://opendev.org/openstack/contributor-guide/
de: Quelle: https://opendev.org/openstack/contributor-guide/

source: Specific procedures for doing things like bug triage.
de: Spezifische Verfahren für Dinge wie die Fehlersuche.
id: Prosedur khusus untuk melakukan hal seperti bug triase.

source: Team and repository tags
de: Team- und Repository-Tags
id: Tag repositori dan tim

source: The Contributor Guide aims to provide common documentation for all OpenStack Contributors and help with on-boarding efforts.
de: Der Contributor Guide zielt darauf ab, eine gemeinsame Dokumentation für alle OpenStack-Contributors bereitzustellen und bei der Eingliederung zu helfen.
id: Panduan Kontributor bertujuan untuk menyediakan dokumentasi umum untuk semua Kontributor OpenStack dan membantu upaya on-boarding.

source: The Contributor Guide for the OpenStack project.
de: Das Contributor Handbuch für das OpenStack-Projekt.
id: Panduan Kontributor untuk proyek OpenStack.

source: The Contributor Portal
de: Das Mitwirkendenportal
id: Portal Kontributor

source: The OpenStack Contributor Guide
de: Das OpenStack Contributor Handbuch für Mitwirkende
id: Panduan Kontributor OpenStack

source: The `Contributor Portal <https://www.openstack.org/community/>`_ provides the community with a landing page for new contributors to discover different ways to contribute to OpenStack.
de: Das `Mitwirkendenportal <https://www.openstack.org/community/>`_ bietet der Community eine Landing Page für neue Beitragende, um verschiedene Möglichkeiten zu entdecken, zu OpenStack beizutragen.
id: The `Contributor Portal <https://www.openstack.org/community/>`_ menyediakan komunitas dengan halaman arahan (landing page) bagi kontributor baru untuk menemukan berbagai cara untuk berkontribusi ke OpenStack.

source: The project teams listed under the 'Code & Documentation' section come from OpenStack's governance repository `project.yaml file <https://opendev.org/openstack/governance/src/reference/projects.yaml>`_. This file is a list of projects that are recognized by the `Technical Committee <https://governance.openstack.org/tc/>`_. Project teams under this category should make sure their 'contributor' field is set to the URL of their specific contributor guide. See the `project.yaml file <https://opendev.org/openstack/governance/src/reference/projects.yaml>`_ file for examples.
de: Die unter dem Abschnitt "Code & Dokumentation" aufgeführten Projektteams stammen aus dem Governance-Repository `project.yaml file <https://opendev.org/openstack/governance/src/reference/projects.yaml>`_ von OpenStack. Diese Datei ist eine Liste von Projekten, die vom `Technischen Komitee <https://governance.openstack.org/tc/>`_ anerkannt werden. Projektteams unter dieser Kategorie sollten sicherstellen, dass ihr Feld "Mitwirkender" auf die URL ihres spezifischen Mitwirkendenleitfadens eingestellt ist. Siehe die Datei `project.yaml <https://opendev.org/openstack/governance/src/reference/projects.yaml>`_ für Beispiele.
id: Tim proyek yang terdaftar di bawah bagian 'Code & Documentation' berasal dari repositori tata kelola OpenStack `project.yaml file <https://opendev.org/openstack/governance/src/reference/projects.yaml>`_. File ini adalah daftar proyek yang dikenali oleh `Technical Committee <https://governance.openstack.org/tc/>` _. Tim proyek dalam kategori ini harus memastikan bidang 'contributor' mereka disetel ke URL panduan kontributor khusus mereka. Lihat file `project.yaml <https://opendev.org/openstack/governance/src/reference/projects.yaml>`_ file untuk contoh.

source: There are different contribution categories listed, such as Code & Documentation and Users. Each one of these has their own contributor guide listed on the main page of the :doc:`../index`.
de: Es werden verschiedene Beitragskategorien aufgelistet, wie z.B. Code & Dokumentation und Benutzer. Jeder von ihnen hat seinen eigenen Contributor Guide, der auf der Hauptseite des :doc:`../index` aufgelistet ist.
id: Ada berbagai kategori kontribusi yang terdaftar, seperti Kode & Dokumentasi dan Pengguna. Masing - masing dari ini memiliki panduan kontributor mereka sendiri yang tercantum pada halaman utama :doc:`../index`.

source: To build the guide, execute the following command::
de: Um den Leitfaden zu erstellen, führen Sie den folgenden Befehl aus::
id: Untuk membangun panduan, jalankan perintah berikut ::

source: Use chapters that have already been accepted to get a feel of what we're looking for.
de: Verwenden Sie bereits akzeptierte Kapitel, um sich ein Bild davon zu machen, wonach wir suchen.
id: Gunakan bab yang telah diterima untuk merasakan apa yang kita cari.

source: Use screen shots.
de: Verwenden Sie Screenshots.
id: Gunakan screen shot.

source: We want you to succeed! You can ask for help on `IRC Freenode <https://webchat.freenode.net/>`_ in channel #openstack-doc. You can also ask for help on the `OpenStack Discuss Mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ prefixing your email subject with '[contributor-guide]'. If you're not familiar with these ways of communicating, read the :doc:`/code-and-documentation/index`.
de: Wir wollen, dass Sie Erfolg haben! Sie können um Hilfe bitten unter `IRC Freenode <https://webchat.freenode.net/>`_ im Kanal #openstack-doc. Sie können auch auf der `OpenStack Discuss Mailingliste <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ um Hilfe bitten, indem Sie Ihrem E-Mail-Betreff '[contributor-guide]' voranstellen. Wenn Sie mit diesen Kommunikationsarten nicht vertraut sind, lesen Sie bitte die :doc:`/code-and-documentation/index`.
id: Kami ingin Anda berhasil! Anda dapat meminta bantuan `IRC Freenode <https://webchat.freenode.net/>`_ dalam channel #openstack-doc. Anda juga dapat meminta bantuan pada `OpenStack Discuss Mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ awalan subjek email Anda dengan '[contributor-guide]'. Jika Anda tidak terbiasa dengan cara berkomunikasi ini, baca :doc:`/code-and-documentation/index`.

source: What is the Contributor Guide?
de: Was ist der Contributor Guide?
id: Apa itu Panduan Kontributor?

source: What is the Contributor Portal?
de: Was ist das Mitwirkendenportal?
id: Apa itu Portal Kontributor?

source: Where the Guide Is Used
de: Wo der Leitfaden verwendet wird
id: Di mana Panduan Ini Digunakan

source: `The Certified OpenStack Administrator Exam <https://www.openstack.org/coa>`_
de: `Die Prüfung zum Certified OpenStack Administrator <https://www.openstack.org/coa>`_

source: `The OpenStack Upstream Institute <https://docs.openstack.org/upstream-training/>`_
de: `Das OpenStack Upstream Institute <https://docs.openstack.org/upstream-training/>`_

source: Source: https://git.openstack.org/cgit/openstack/contributor-guide
id: Sumber: https://git.openstack.org/cgit/openstack/contributor-guide
