Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-code-and-documentation.po
Languages: de, id, ko_kr, zh_cn

source: Improvement to either the code or documentation should be part of a larger effort, like if you would like to fix typos in documentation then you should do it for a larger block, like a whole guide. It is also preferred to report a story with tasks for a work item like this that can be tracked later.
de: Die Verbesserung des Codes oder der Dokumentation sollte Teil eines größeren Aufwandes sein, wie z.B. wenn Sie Tippfehler in der Dokumentation beheben möchten, dann sollten Sie es für einen größeren Block tun, wie einen ganzen Leitfaden. Es wird auch vorgezogen, eine Story mit Aufgaben für ein solches Workitem zu melden, die später verfolgt werden kann.
id: Peningkatan baik kode atau dokumentasi harus menjadi bagian dari upaya yang lebih besar, seperti jika Anda ingin memperbaiki kesalahan ketik dalam dokumentasi maka Anda harus melakukannya untuk blok yang lebih besar, seperti seluruh panduan. Lebih disukai melaporkan berita dengan tugas untuk item pekerjaan seperti ini yang dapat dilacak nanti.
ko_kr: 코드 또는 설명서의 개선은 문서화에서 오타를 수정하려는 경우 전체 가이드와 같이 더 큰 블록에 대해 수행해야 하는 것과 같은 큰 노력의 일환이어야 합니다. 나중에 추적할 수 있는 이와 같은 작업 항목에 대한 작업이 있는 스토리를 보고하는 것도 선호됩니다.
zh_cn: 改进代码或文档应该是更广范围工作的一部分，例如，如果您想修正文档中的错别字，则应该在较大范围的代码块框架下进行改进，比如修正整份指南。 同时最好报告一个背景描述包含类似这样的工作项的任务，以便稍后进行跟踪。

source: In case of code refactoring work which makes the code more readable and easier to maintain by restructuring methods and deleting unused code snippets it is highly encouraged to consult with the project team and report a story in StoryBoard first and then upload the relevant changes to Gerrit for review.
de: Im Falle von Code Refactoring-Arbeiten, die den Code durch Umstrukturierung und Löschen unbenutzter Codeausschnitte lesbarer und einfacher zu pflegen machen, wird dringend empfohlen, sich mit dem Projektteam abzustimmen und zunächst eine Story in StoryBoard zu berichten und dann die relevanten Änderungen zur Überprüfung an Gerrit hochzuladen.
id: Dalam kasus pekerjaan refactoring kode yang membuat kode lebih mudah dibaca dan dipelihara dengan metode restrukturisasi dan menghapus snipet kode yang tidak digunakan, sangat disarankan untuk berkonsultasi dengan tim proyek dan melaporkan sebuah cerita di StoryBoard terlebih dahulu dan kemudian mengunggah perubahan yang relevan ke Gerrit untuk ulasan.
ko_kr: 구조 조정 방법 및 사용되지 않은 코드 스니펫을 삭제하여 코드를 읽기 쉽고 쉽게 유지관리할 수 있는 코드 리팩터링 작업의 경우 프로젝트 팀과 협의하여 스토리보드에 먼저 보고한 후 관련 변경 사항을 Gerrit에 업로드하여 검토하도록 적극 권장합니다.
zh_cn: 在进行代码重构的情况下，通过重构方法和删除未使用的代码段使代码更易读且更易于维护，强烈建议您与项目团队协商，并先在StoryBoard中报告一个背景，然后将相关更改上传到Gerrit，以便评论。

source: In case you use the 'Depends-On' tag you need to download all the changes for a feature implementation or documentation change to test the feature or build the documentation with all the changes applied. Git will not take care of handling the dependencies automatically in this case.
de: Wenn Sie den Tag "Depends-On" verwenden, müssen Sie alle Änderungen für eine Feature-Implementierung oder Dokumentationsänderung herunterladen, um das Feature zu testen oder die Dokumentation mit allen vorgenommenen Änderungen zu erstellen. Git wird sich in diesem Fall nicht um die automatische Behandlung der Abhängigkeiten kümmern.
id: Jika Anda menggunakan tag 'Depends-On', Anda perlu mengunduh semua perubahan untuk implementasi fitur atau perubahan dokumentasi untuk menguji fitur atau membuat dokumentasi dengan semua perubahan yang diterapkan. Git tidak akan menangani penanganan dependensi secara otomatis dalam kasus ini.
ko_kr: 'Depends-On' 태그를 사용하는 경우 기능 구현 또는 문서 변경에 대한 모든 변경 사항을 다운로드하여 기능을 테스트하거나 모든 변경 사항이 적용된 문서를 빌드해야 합니다. 이 경우 Git은 종속성을 자동으로 처리하지 않습니다.
zh_cn: 如果您使用'Depends-On'标签，则需要下载为功能实现或者文档更改所做的所有更改，以测试集成了这些更改后的功能或构建集成了这些更改后的文档。 在这种情况下，Git将不会自动处理依赖项。

source: In general, its best to avoid over using this gerrit capability because each interaction with the patch- new patchsets, comments, CI system votes, etc.- will send an email notification to every reviewer on the patch.
de: Im Allgemeinen ist es am besten, die Verwendung dieser Gerrit-Fähigkeit zu vermeiden, da jede Interaktion mit dem Patch - neue Patchsets, Kommentare, CI-Systemabstimmungen usw. - eine E-Mail-Benachrichtigung an jeden Reviewer auf dem Patch sendet.
id: Secara umum, yang terbaik untuk menghindari penggunaan kemampuan gerrit ini karena setiap interaksi dengan patch - patch baru, komentar, suara sistem CI, dll. - akan mengirim pemberitahuan email ke setiap pengulas di patch.
ko_kr: 일반적으로 새로운 패치 세트, 주석, CI 시스템 투표 등과 같은 패치와의 각 상호 작용은 패치의 모든 검토자에게 전자 메일 알림을 보내기 때문에 이 게리트 기능을 과도하게 사용하지 않도록 하는 것이 가장 좋습니다.
zh_cn: 通常情况，最好避免过度使用这项gerrit功能，因为与补丁的每次交互操作（新的补丁集，注释，CI系统的投票等）都会向该补丁的每位审阅者发送电子邮件通知。

source: In rare occasions when there is no good logical breakdown for a change and your patch can grow to a thousand lines or more. In some cases it is acceptable as you cannot extract the related test changes to another patch for instance, but it's not highly recommended.
de: In seltenen Fällen, in denen es für eine Änderung keine gute logische Aufteilung gibt und Ihr Patch auf tausend Zeilen oder mehr wachsen kann. In einigen Fällen ist es akzeptabel, da Sie die zugehörigen Teständerungen nicht in einen anderen Patch extrahieren können, aber es wird nicht dringend empfohlen.
id: Dalam kesempatan yang jarang terjadi ketika tidak ada gangguan logis yang baik untuk perubahan dan patch Anda dapat tumbuh hingga seribu baris atau lebih. Dalam beberapa kasus itu dapat diterima karena Anda tidak dapat mengekstraksi perubahan tes terkait ke patch lain misalnya, tetapi itu tidak sangat dianjurkan.
ko_kr: 드문 경우지만 변경에 대한 좋은 논리적 분석이 없고 패치가 천 줄 이상으로 늘어날 수 있습니다. 예를 들어 다른 패치에 대한 관련 테스트 변경 사항을 추출 할 수 없기 때문에 어떤 경우에는 허용되지만 권장되지는 않습니다.
zh_cn: 在极少数情况下，当没有很好的逻辑分解依据时，您的补丁可能会增长到一千行或更多。 在某些情况下，这是可以接受的，例如因为您无法将相关的测试变更提取到另一个补丁中，但不建议这样做。

source: In some cases when you break down the required changes to smaller blocks you cannot avoid having direct dependencies between them that prevents you from having independent changes. You need to organize your changes in a chain to maintain the dependencies which requires some additional care when you work with these changes.
de: In einigen Fällen, wenn Sie die erforderlichen Änderungen in kleinere Blöcke aufteilen, können Sie es nicht vermeiden, direkte Abhängigkeiten zwischen ihnen zu haben, die verhindern, dass Sie unabhängige Änderungen vornehmen. Sie müssen Ihre Änderungen in einer Kette organisieren, um die Abhängigkeiten zu pflegen, die eine zusätzliche Sorgfalt erfordern, wenn Sie mit diesen Änderungen arbeiten.
id: Dalam beberapa kasus ketika Anda memecah perubahan yang diperlukan untuk blok yang lebih kecil Anda tidak dapat menghindari ketergantungan langsung di antara mereka yang mencegah Anda memiliki perubahan independen. Anda perlu mengatur perubahan Anda dalam rantai untuk mempertahankan dependensi yang memerlukan perhatian tambahan saat Anda bekerja dengan perubahan ini.
ko_kr: 어떤 경우에는 필요한 변경사항을 소규모 블록으로 세분화할 때, 변경사항 사이에 독립적 변경을 방지하는 직접적인 종속성을 피할 수 없는 경우도 있습니다. 이러한 변경 사항에 대해 작업할 때 추가 주의가 필요한 종속성을 유지하려면 체인에 변경 사항을 정리해야 합니다.
zh_cn: 在某些情况下，当您将所需更改分解为较小的补丁时，它们之间将不可避免地具有直接依赖性，从而使得您无法进行独立更改。 您需要将更改组织成一个链来维护依赖关系，当您使用这些更改时，需要格外小心。

source: In the case of complex feature implementation work when you need to introduce changes to multiple modules of the same project or multiple projects you need to be very careful with managing the dependencies.
de: Im Falle komplexer Feature-Implementierungsarbeiten, wenn Sie Änderungen an mehreren Modulen desselben Projekts oder an mehreren Projekten vornehmen müssen, müssen Sie sehr sorgfältig mit der Verwaltung der Abhängigkeiten umgehen.
id: Dalam kasus kerja implementasi fitur yang kompleks ketika Anda perlu memperkenalkan perubahan pada beberapa modul dari proyek yang sama atau beberapa proyek, Anda harus sangat berhati-hati dalam mengelola dependensi.
ko_kr: 복잡한 기능 구현 작업의 경우, 동일한 프로젝트 또는 여러 프로젝트의 여러 모듈에 변경 사항을 도입해야 할 때 종속성 관리에 매우 주의해야 합니다.
zh_cn: 对于复杂的功能实现工作，当您需要对同一项目或多个项目的多个模块进行更改时，在管理依赖项时需要格外小心。

source: Installation guide
ko_kr: 설치 가이드
zh_cn: 安装指南

source: Introduction
de: Einführung
id: Pengantar
ko_kr: 소개
zh_cn: 引言

source: It is a good practice to group changes by modules in a project, for instance virt driver changes, compute manager and api changes in case of OpenStack Compute.
de: Es ist eine gute Praxis, Änderungen nach Modulen in einem Projekt zu gruppieren, z.B. virtuelle Treiberänderungen, Compute Manager und API-Änderungen im Falle von OpenStack Compute.
id: Ini adalah praktik yang baik untuk mengelompokkan perubahan berdasarkan modul dalam suatu proyek, misalnya perubahan virt driver, manajer komputasi dan perubahan api dalam kasus OpenStack Compute.
ko_kr: OpenStack Compute의 경우 가상 드라이버 변경, 컴퓨팅 관리자 및 API 변경과 같이 프로젝트의 모듈별로 변경 사항을 그룹화하는 것이 좋습니다.
zh_cn: 一个优良作法是按项目中的模块将更改分组，在OpenStack Compute服务中有例如virt driver相关的改变，compute manager相关的改变和api相关的改变

source: It is possible to check out other contributors' patches from Gerrit and even `make changes to them <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#modifying-a-change>`_; however, you should always discuss any changes with the contributor before you start working on their patch.
id: Dimungkinkan untuk memeriksa patch kontributor lain dari Gerrit dan bahkan `make changes to them <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#modifying-a-change>`_; namun, Anda harus selalu mendiskusikan perubahan apa pun dengan kontributor sebelum mulai mengerjakan tambalannya.
ko_kr: Gerrit에서 다른 기고자들의 패치를 확인하고 `기고자 패치를 변경 <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#modifying-a-change>`_ 할 수도 있지만, 기고자와 변경사항에 대해서는 항상 상의한 후 작업을 시작해야 합니다.
zh_cn: 从gerrit中签出（check out）其他贡献者的补丁是可以的，有时候甚至可以 `make changes to them <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#modifying-a-change>`_ ; 但是，在开始着手修改他们的补丁之前，您应该始终与贡献者讨论任何要做的更改。

source: It is possible to edit your patch in the gerrit web interface and publish the change without making the change locally. This is not generally advised for larger code updates since it doesn't automatically update your local working branch. In some cases, where the patch is basically ready to merge aside from a small pep8 failure- whitespace at the end of line, needing to wrap a line, etc- this gerrit feature can be convenient to make a quick edit and publish the change without having to go through the entire 'git add', 'git commit --amend', 'git review' process.
de: Es ist möglich, Ihren Patch im gerrit Webinterface zu bearbeiten und die Änderung zu veröffentlichen, ohne die Änderung lokal vorzunehmen. Dies wird im Allgemeinen nicht für größere Code-Updates empfohlen, da es nicht automatisch Ihren lokalen Arbeitszweig aktualisiert. In einigen Fällen, in denen der Patch grundsätzlich bereit ist, abgesehen von einem kleinen pep8-Fehler zusammenzuführen - Leerzeichen am Ende der Zeile, die eine Zeile umbrechen müssen, usw. - kann diese Gerrit-Funktion bequem sein, um eine schnelle Bearbeitung vorzunehmen und die Änderung zu veröffentlichen, ohne den gesamten Prozess von 'git add', 'git commit --amend', 'git review' durchlaufen zu müssen.
id: Dimungkinkan untuk mengedit patch Anda di antarmuka web gerrit dan menerbitkan perubahan tanpa membuat perubahan secara lokal. Ini biasanya tidak disarankan untuk pembaruan kode yang lebih besar karena tidak secara otomatis memperbarui cabang kerja lokal Anda. Dalam beberapa kasus, di mana patch pada dasarnya siap untuk bergabung selain dari small pep8 failure- whitespace di akhir baris, perlu untuk membungkus sebuah garis (wrap a line), fitur gerrit etc- ini dapat memudahkan untuk melakukan edit cepat dan menerbitkan perubahan tanpa harus melalui seluruh proses 'git add', 'git commit --amend', 'git review'.
ko_kr: 로컬에서 변경하지 않고 게리트 웹 인터페이스에서 패치를 편집하고 변경 내용을 게시할 수 있습니다. 일반적으로 대규모 코드 업데이트의 경우 로컬 작업 분기가 자동으로 업데이트되지 않으므로 이 방법은 권장되지 않습니다. 경우에 따라, 패치가 기본적으로 펩8의 작은 장애-끝에 공백, 줄 바꿈 등을 제외하고 통합할 준비가 된 경우, 이 게리트 기능은 전체 'git add', 'git commit --amend', 'git review' 프로세스를 거치지 않고도 변경 사항을 신속하게 편집하고 게시할 수 있습니다.
zh_cn: 在gerrit web界面中编辑补丁并发布更改是可以的，而且无需在本地进行更改。 通常不建议进行较多的代码更新，因为它不会自动更新本地工作分支。 在某些情况下，除了一个小的pep8故障外，生成的补丁基本上已经准备好合并了 - 行末尾有空白，需要换行，等等 - 这项gerrit功能可以方便地进行快速编辑和发布更改而没有必要通过整个'git add', 'git commit --amend', 'git review'流程。

source: It is recommended before proceeding further to set-up passwords and IP addresses for the environment in which you are running DevStack. This is done by configuring the ``local.conf`` file in DevStack.
de: Es wird empfohlen, bevor Sie mit der Einrichtung von Passwörtern und IP-Adressen für die Umgebung, in der Sie DevStack ausführen, fortfahren. Dies geschieht durch die Konfiguration der Datei ``local.conf`` in DevStack.
id: Disarankan sebelum melanjutkan lebih jauh untuk mengatur kata sandi dan alamat IP untuk lingkungan di mana Anda menjalankan DevStack. Ini dilakukan dengan mengkonfigurasi file ``local.conf`` di DevStack.
ko_kr: 더 진행하기에 앞서서 DevStack을 실행하고자 하는 환경에 대한 IP 주소 및 패스워드를 셋업하는 것을 권장합니다. 이는 DevStack 에서 ``local.conf`` 파일을 구성함으로써 이루어집니다.
zh_cn: 建议在进一步设置运行DevStack的环境的密码和IP地址之前完成克隆。 设置是通过在DevStack中配置 ``local.conf`` 文件来完成的。

source: It is similar for code improvements. As the community is large and world-wide we have coding guidelines, but the style of each individual can still be very different. We don't enforce a particular coding style, therefore changes related to fix that are less welcomed and are sources of very opinionated arguments that should be avoided.
de: Ähnlich verhält es sich bei Code-Verbesserungen. Da die Community groß und weltweit ist, haben wir Programmierrichtlinien, aber der Stil jedes Einzelnen kann immer noch sehr unterschiedlich sein. Wir erzwingen keinen bestimmten Codierstil, daher sind Änderungen im Zusammenhang mit der Behebung weniger willkommen und Quellen für sehr dogmatische Argumente, die vermieden werden sollten.
id: Ini serupa untuk peningkatan kode. Karena komunitasnya besar dan luas di dunia, kami memiliki pedoman pengkodean, tetapi gaya masing-masing individu masih bisa sangat berbeda. Kami tidak menerapkan gaya pengkodean tertentu, oleh karena itu perubahan yang terkait dengan perbaikan yang kurang disambut dan merupakan sumber argumen yang sangat beralasan yang harus dihindari.
ko_kr: 이는 코드 개선과 유사합니다. 커뮤니티가 크고 전 세계에 걸쳐 있기 때문에 우리는 코딩 가이드라인을 가지고 있지만, 각 개인의 스타일은 여전히 매우 다를 수 있습니다. 우리는 특정한 코딩 방식을 강요하지 않습니다. 따라서 환영받지 못하며 매우 의견 있는 논쟁의 근원이 되는 수정과 관련된 변경은 피해야 합니다.
zh_cn: 代码改进也是类似的。 由于社区很大且遍布全球，所以我们有编码准则，但是每个人的风格仍然可以有很大不同。 我们不强制执行特定的编码样式，因此请尽量避免不那么受欢迎的修订相关的更改的编码方式，以及应避免使用一些自以为是的参数定义方法。

source: Know how to structure a patch that is easier for community members to review
de: Wissen, wie man einen Patch strukturiert, der für Community-Mitglieder einfacher zu überprüfen ist.
id: Ketahui cara menyusun patch yang lebih mudah bagi anggota komunitas untuk meninjau
ko_kr: 커뮤니티 구성원이 보다 쉽게 검토 할 수 있도록 패치를 구성하는 방법을 알고 있습니다.
zh_cn: 知道如何构建补丁，易于社区成员查看

source: Know how to structure a patch that makes it easier to maintain throughout the review process
de: Wissen, wie man einen Patch strukturiert, die die Wartung während des gesamten Review-Prozesses erleichtert.
id: Ketahui cara menyusun patch yang membuatnya lebih mudah untuk dipertahankan selama proses peninjauan
ko_kr: 검토 프로세스 전반에 걸쳐 유지 관리가 더 용이하도록 패치를 구성하는 방법을 알고 있습니다.
zh_cn: 知道如何构建补丁，以便在整个审核过程中更容易维护

source: Launchpad is deprecated and will be superceded by StoryBoard.
id: Launchpad sudah usang dan akan diawasi oleh StoryBoard.
ko_kr: LaunchPad는 사용되지 않으며 StoryBoard에 의해 대체됩니다.
zh_cn: Launchpad已过时，并将由StoryBoard取代。

source: Logs for the running services are also able to be viewed through systemd. To display the logs for the Cinder Volume service the following command could be used:
de: Protokolle für die laufenden Dienste können auch über systemd eingesehen werden. Um die Protokolle für den Cinder Volume Service anzuzeigen, kann der folgende Befehl verwendet werden:
id: Log untuk layanan yang berjalan juga dapat dilihat melalui systemd. Untuk menampilkan log untuk layanan Cinder Volume, perintah berikut dapat digunakan:
ko_kr: 실행중인 서비스에 대한 로그 또한 systemd를 통해 볼 수 있습니다. Cinder Volume 서비스에 대한 로그를 보기 위해서는 다음 명령어를 사용할 수 있습니다:
zh_cn: 也可以通过systemd查看正在运行的服务的日志。 要显示Cinder Volume服务的日志，可以使用以下命令：

source: Longer patches require more time to review; wherever you can, keep the length reasonable. And where you can't, you can help the reviewers by adding code comments and writing a detailed commit message to describe the changes you introduced in your patch.
de: Längere Patches benötigen mehr Zeit zum Überprüfen; wo immer Sie können, halten Sie die Länge angemessen. Und wo Sie es nicht können, können Sie den Reviewern helfen, indem Sie Codekommentare hinzufügen und eine detaillierte Commit-Meldung schreiben, um die Änderungen zu beschreiben, die Sie in Ihrem Patch vorgenommen haben.
id: Patch yang lebih lama membutuhkan lebih banyak waktu untuk meninjau; dimanapun Anda bisa, pertahankan panjang yang wajar. Dan di mana Anda tidak bisa, Anda dapat membantu pengulas dengan menambahkan komentar kode dan menulis pesan komit rinci untuk menggambarkan perubahan yang Anda perkenalkan di patch Anda.
ko_kr: 패치가 길수록 검토하는 데 더 많은 시간이 필요합니다. 가능하면 길이를 합리적으로 유지하십시오. 불가능한 경우 코드 주석을 추가하고 패치에 도입한 변경사항을 설명하는 자세한 커밋 메시지를 작성하여 검토자를 도울 수 있습니다.
zh_cn: 补丁越长，需要花费审核的时间越多； 尽可能保持长度合理。 在无法做到的地方，您可以通过添加代码注释并编写详细的提交消息来描述您在补丁中引入的变更，从而帮助审阅者。

source: Make quick changes to your patches in the webui
de: Nehmen Sie schnelle Änderungen an Ihren Patches im Webui vor.
id: Buat perubahan cepat ke patch Anda di webui
ko_kr: Webui에서 패치를 빠르게 변경합니다.
zh_cn: 在webui里进行你的补丁的快速更改

source: Most often, some deadline has passed and since no more changes are being accepted till the new release development begins, the patch is `being held <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#procedural-minus-2>`_.
id: Paling sering, beberapa tenggat waktu telah berlalu dan karena tidak ada lagi perubahan yang diterima sampai pengembangan rilis baru dimulai, patch itu `being held <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#procedural-minus-2>`_.
ko_kr: 대부분의 경우, 일부 마감일이 지났고 새로운 릴리즈 개발이 시작될 때까지 더 이상의 변경사항이 받아들여지지 않기 때문에 `패치는 <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#procedural-minus-2>`_ 으로 진행 중입니다.
zh_cn: 多数情况下，可能是截止日期已经过去，并且由于直到新版本开发开始之前都没有接受更多更改，所以这个补丁正在 `being held <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html#procedural-minus-2>`_ 。

source: Notice that the commit hashes have changed for *both* commits (but not for ``master``). The top one changed because it got rebased onto the new version of the middle one.
id: Perhatikan bahwa hash komit telah berubah untuk *both* commit (tetapi tidak untuk ``master``). Yang teratas berubah karena diubah menjadi versi yang baru dari yang di tengah.
ko_kr: 커밋 해시는 *both* 커밋에 대해 변경되었습니다(``마스터`` 에는 변경되지 않음). 윗부분이 바뀐 것은 중간부분의 새로운 버전에 기초했기 때문입니다.
zh_cn: 请注意，两个提交都已更改了提交哈希值（但对于 ``master`` 则没有）。 顶层的一个发生了变化，因为它重新基于了中间版本的新版本。

source: Now I'm going to make another change, but just part of it, a work-in-progress commit:
id: Sekarang saya akan membuat perubahan lain, tetapi hanya sebagian darinya, komitmen work-in-progress:
ko_kr: 이제 저는 또 다른 변화를 만들려고 합니다. 하지만 그 중 일부분만, 현재 진행 중인 작업 중 하나가 다음과 같이 약속합니다.
zh_cn: 现在，我将进行另一项更改，但其中一部分是正在进行的提交：

source: Now I'm sitting on the top change (which you'll notice happens to be exactly the same as before I pushed it - again, meaning I could technically have just worked from where I was, but see above):
id: Sekarang saya duduk di perubahan teratas (yang akan Anda perhatikan persis sama dengan sebelum saya mendorongnya - lagi, artinya saya secara teknis bisa saja bekerja dari tempat saya sebelumnya, tetapi lihat di atas):
ko_kr: 이제 저는 최고의 변화에 앉아 있습니다. (이것은 제가 그것을 추진하기 전과 정확히 같다는 것을 알게 될 것입니다. 다시 말하지만, 제가 기술적으로 제가 있던 곳에서 일할 수 있었다는 것을 의미하지만, 위 내용을 보십시오.)
zh_cn: 现在，我处在最上层更改上了（您会发现它恰好与我推送它之前完全相同 - 再次，这意味着从技术上讲我可以从原来的位置继续工作，但请参见上文）：

source: Now commit ``f17f040`` is on top of ``d76195e``, which is still on top of ``3d008a3`` (aka ``master``). Note that my branch name came with me again.
id: Sekarang komit ``f17f040`` ada di atas ``d76195e``, yang masih di atas ``3d008a3`` (alias ``master``). Perhatikan bahwa nama cabang saya ikut saya lagi.
ko_kr: 이제 ``f17f040`` 은 ``d76195e`` 위에 있으며, ``3d008a3`` (``마스터`` 라고 불립니다. 제 지점 이름이 다시 저와 함께 왔음을 참고하세요.
zh_cn: 现在提交 ``f17f040`` 在 ``d76195e`` 之上，而 ``d76195e`` 仍然在 ``3d008a3`` （也就是 ``master`` ）之上。 请注意，我的分支名称又来了。

source: Now if I push the series back up to gerrit, I get the same confirmation prompt, and both changes get a new patch set. If you look at the top patch in gerrit, you'll see that patch set 2 shows up as just a rebase.
id: Sekarang jika saya mendorong kembali seri ke gerrit, saya mendapatkan prompt konfirmasi yang sama, dan kedua perubahan mendapatkan set patch baru. Jika Anda melihat patch teratas di gerrit, Anda akan melihat bahwa patch set 2 muncul hanya sebagai rebase.
ko_kr: 이제 영상 시리즈를 게리트로 되돌리면 동일한 확인 프롬프트가 표시되고 두 변경 사항 모두 새로운 패치 세트가 표시됩니다. 게리트로 맨 위 패치를 보시면 패치 세트 2가 리베이스로 나타납니다.
zh_cn: 现在，如果我将该系列备份回gerrit，则会得到相同的确认提示，并且两个更改都将获得一个新的补丁集。 如果您查看gerrit中最顶层的补丁，您会看到补丁集2只是一个更新基础代码而已。

source: Now if you go to either of those links - e.g. https://review.opendev.org/#/c/635342/ - you'll see that the patches are stacked up in series on the top right.
id: Sekarang jika Anda membuka salah satu tautan tersebut - misal https://review.opendev.org/#/c/635342/ - Anda akan melihat bahwa tambalan (patch) ditumpuk secara seri di kanan atas.
ko_kr: 이제 https://review.opendev.org/#/c/635342/와 같은 링크 중 하나로 이동하면 오른쪽 상단에 패치가 직렬로 쌓여 있는 것을 볼 수 있습니다.
zh_cn: 现在，如果您转到这些链接中的任何一个-例如 https://review.opendev.org/#/c/635342/-您会在右上角看到补丁被堆叠在一起。

source: On some distributions you may need to also set the ``HOST_IP``. Whether this is necessary will depend on what naming convention is used for network interfaces in your operating system.
de: Bei einigen Distributionen müssen Sie möglicherweise auch das ``HOST_IP`` setzen. Ob dies notwendig ist, hängt davon ab, welche Namenskonvention für Netzwerkschnittstellen in Ihrem Betriebssystem verwendet wird.
id: Pada beberapa distribusi Anda mungkin perlu mengatur ``HOST_IP``. Apakah ini perlu tergantung pada konvensi penamaan apa yang digunakan untuk antarmuka jaringan di sistem operasi Anda.
ko_kr: 몇몇 배포판에서는 ``HOST_IP`` 또한 설정해야 할 수 있습니다. 이는 대상 운영체제에서 네트워크 인터페이스를 사용하기 위한 이름 통용규칙에 따라 의존적일 수 있습니다.
zh_cn: 在某些发行版中，您可能还需要设置 ``HOST_IP`` 。 是否需要这样做将取决于操作系统中网络接口使用的命名约定。
