Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: Stable branches proceed through different levels of maintenance as they age.
id: Stable branchl berjalan melalui berbagai tingkat pemeliharaan seiring bertambahnya usia.
ko_kr: 안정적인 분기는 시간이 지나면서 서로 다른 수준의 유지보수를 통해 진행됩니다.

source: State
ko_kr: 상태

source: Statusbot
ko_kr: 상태봇

source: Statusbot is used to distribute urgent information from the Infrastructure team to OpenStack channels.
de: Statusbot wird verwendet, um dringende Informationen vom Infrastruktur-Team an die OpenStack-Kanäle zu verteilen.
id: Statusbot digunakan untuk mendistribusikan informasi mendesak dari tim Infrastruktur ke saluran OpenStack.
ko_kr: Statusbot은 Infrastructure 팀의 긴급 정보를 OpenStack 채널로 배포하는 데 사용됩니다.

source: Stay up to date on the active discussions in the community
de: Bleiben Sie auf dem Laufenden über die aktiven Diskussionen in der Community
id: Ikuti perkembangan diskusi aktif di komunitas
ko_kr: 커뮤니티에서 진행 중인 논의 내용을 최신 상태로 유지합니다.

source: Stories & Tasks
de: Storys & Aufgaben
id: Kisah & Tugas
ko_kr: 스토리와 작업

source: StoryBoard
ko_kr: 스토리보드

source: StoryBoard specific footers:
ko_kr: StoryBoard별 바닥글은 다음과 같습니다.

source: Storyboard
ko_kr: 스토리보드

source: Storyboard is a kanban style task tracking system created and maintained by the community. It was designed API-first and was engineered to support the coordination of cross project work. Items tracked are stories and tasks. A story can be a bug or a new feature, while tasks are the smaller todo's required to complete the story.
de: Storyboard ist ein Kanban-ähnliches Aufgabenverfolgungssystem, das von der Community erstellt und gepflegt wird. Es wurde zunächst als API konzipiert und wurde entwickelt, um die Koordination der projektübergreifenden Arbeit zu unterstützen. Verfolgte Elemente sind Storys und Aufgaben. Eine Story kann ein Fehler oder ein neues Feature sein, während Aufgaben die kleineren Aufgaben sind, die erforderlich sind, um die Story abzuschließen.
id: Storyboard adalah sistem pelacakan tugas gaya kanban yang dibuat dan dikelola oleh komunitas. Itu dirancang API-first dan direkayasa untuk mendukung koordinasi pekerjaan lintas proyek. Item yang dilacak adalah cerita dan tugas. Sebuah cerita bisa menjadi bug atau fitur baru, sementara tugas adalah tugas yang lebih kecil yang diperlukan untuk menyelesaikan cerita.
ko_kr: 스토리보드는 커뮤니티가 만들고 관리하는 칸반 스타일의 작업 추적 시스템입니다. API를 기반으로 설계되었으며, 프로젝트 간 작업 조정을 지원하도록 설계되었습니다. 추적된 항목은 이야기와 과제입니다. 스토리는 버그 또는 새로운 기능이 될 수 있지만, 작업은 스토리를 완료하는 데 필요한 작은 작업입니다.

source: Submit presentations to OpenStack conferences.
de: Senden Sie Präsentationen an OpenStack-Konferenzen.
id: Kirim presentasi ke OpenStack konferensi.
ko_kr: OpenStack 컨퍼런스에 발표 제출.

source: Submit your application.
de: Senden Sie Ihre Bewerbung.
id: Kirim aplikasi Anda.
ko_kr: 지원서를 제출하십시오.

source: Succesbot is an IRC bot to express small successes in OpenStack development. To celebrate in the OpenStack IRC channel way just type:
de: Succesbot ist ein IRC-Bot, um kleine Erfolge in der OpenStack-Entwicklung auszudrücken. Um im OpenStack IRC-Kanal zu feiern, tippen Sie einfach ein:
id: Succesbot adalah bot IRC untuk mengekspresikan keberhasilan kecil dalam pengembangan OpenStack. Untuk merayakan dengan cara saluran OpenStack IRC cukup ketik:
ko_kr: Succesbot은 OpenStack 개발에서 작은 성공을 거둔 IRC 봇입니다. OpenStack IRC 채널에서 기념하려면 다음을 입력합니다.

source: Successbot
ko_kr: 성공봇

source: Summary
ko_kr: 요약

source: Summary Line
de: Summenzeile
ko_kr: 요약

source: Task Tracking
de: Aufgabenverfolgung
id: Pelacakan Tugas
ko_kr: 작업 추적

source: Technical Committee
id: Komite Teknis
ko_kr: 기술 위원회

source: Testing
de: Testen
id: Testing (pengujian)
ko_kr: 테스트

source: Thanksbot
ko_kr: 감사봇

source: The 13 Members of the TC are elected for one year terms, six at one election, seven at another election six months later. They are elected by :ref:`Active Technical Contributors <atc>`.
de: Die 13 Mitglieder des TC werden für ein Jahr gewählt, sechs bei einer Wahl, sieben bei einer anderen Wahl sechs Monate später. Sie werden von :ref:`Active Technical Contributors <atc>` gewählt.
id: 13 Anggota TC dipilih untuk masa jabatan satu tahun, enam pada satu pemilihan, tujuh pada pemilihan lainnya enam bulan kemudian. Mereka dipilih oleh :ref:`Active Technical Contributors <atc>`.
ko_kr: 13명의 TC 회원들은 1년 임기로 선출되며, 한 선거에서는 6개월 후 다른 선거에서는 7명이 선출됩니다. 이 항목은 ATC에 의해 선택됩니다. :ref:`Active Technical Contributors <atc>`.

source: The 5 members of the UC are elected to one year terms, three at one election, two at another election six months later. They are elected by :ref:`Active User Contributors <auc>`.
de: Die 5 Mitglieder der UC werden für ein Jahr gewählt, drei bei einer Wahl, zwei bei einer anderen Wahl sechs Monate später. Sie werden von :ref:`Active User Contributors <auc>` gewählt.
id: 5 anggota UC dipilih untuk masa jabatan satu tahun, tiga pada satu pemilihan, dua pada pemilihan lainnya enam bulan kemudian. Mereka dipilih oleh :ref:`Active User Contributors <auc>`.
ko_kr: UC의 5명의 회원들은 한 선거에서 3명, 6개월 후에 다른 선거에서 2명, 1년 임기로 선출됩니다. 이 선택 항목은 사용자 기여자 auc입니다. :ref:`Active User Contributors <auc>`.

source: The 6-month cycle is divided into three milestones and a usually one-month long stabilization period with release candidates.
de: Der 6-Monatszyklus gliedert sich in drei Meilensteine und eine in der Regel einmonatige Stabilisierungsphase mit Release-Kandidaten.
id: Siklus 6 bulan dibagi menjadi tiga tonggak dan periode stabilisasi yang biasanya satu bulan dengan kandidat pelepas.
ko_kr: 6개월 주기로 릴리즈가 되며 3개의 마일스톤과, 보통 1개월의 긴 안정화 기간으로 나뉩니다.

source: The Cohorts
de: Die Kohorten
ko_kr: 지지자

source: The Forum sessions are also 40 minutes long, but the sessions are intended to be working sessions as opposed to presentations.
de: Die Sitzungen des Forums sind ebenfalls 40 Minuten lang, aber die Sitzungen sind als Arbeitssitzungen und nicht als Präsentationen gedacht.
id: Sesi Forum juga berdurasi 40 menit, tetapi sesi dimaksudkan sebagai sesi kerja yang bertentangan dengan presentasi.
ko_kr: 포럼 세션은 또한 40분 동안 진행되지만 프레젠테이션이 아닌 작업 세션으로 이루어집니다.

source: The Forum sessions are proposed by the community through a proposal period and the final sessions are selected by a committee.
de: Die Forumssitzungen werden von der Gemeinschaft über eine Antragsfrist vorgeschlagen, und die letzten Sitzungen werden von einem Ausschuss ausgewählt.
id: Sesi Forum diusulkan oleh masyarakat melalui periode proposal dan sesi terakhir dipilih oleh komite.
ko_kr: 포럼 세션은 제안 기간을 통해 지역사회가 제안하고, 최종 세션은 위원회에서 선정합니다.

source: The OpenStack community has a few different groups and roles for `governance <https://governance.openstack.org/>`_, leadership, and community participation. Each operates in a different sector of the community but being aware of each of them is useful.
de: Die OpenStack-Community hat einige verschiedene Gruppen und Rollen für `Governance <https://governance.openstack.org/>`_, Führung und Beteiligung der Community. Jeder arbeitet in einem anderen Bereich der Gemeinschaft, aber das Bewusstsein für jeden von ihnen ist nützlich.
id: Komunitas OpenStack memiliki beberapa grup dan peran yang berbeda `governance <https://governance.openstack.org/>`_, leadership, dan community participation. Masing-masing beroperasi di sektor komunitas yang berbeda tetapi menyadari masing-masing dari mereka berguna.
ko_kr: OpenStack 커뮤니티에는 `거버넌스 <https://governance.openstack.org/>`_ 라는 그룹과 역할, 리더십 및 커뮤니티 참여를 위한 구분이 몇 가지가 있습니다. 각 영역은 커뮤니티의 다른 영역에서 운영되지만 각 영역에 대해 인식하는 것은 유용합니다.

source: The OpenStack community is currently in the process of moving from the bug tracking software Launchpad to StoryBoard. Further in the project specific on-boarding documentation, give special attention to if the project is using Launchpad or StoryBoard. If your project is still using Launchpad you will want to take notice of the Launchpad section later in this document.
de: Die OpenStack-Community ist derzeit dabei, von der Bug-Tracking-Software Launchpad zu StoryBoard zu wechseln. Weiterhin ist in der projektspezifischen On-Boarding-Dokumentation besonders darauf zu achten, ob das Projekt Launchpad oder StoryBoard verwendet. Wenn Ihr Projekt noch Launchpad verwendet, sollten Sie den Abschnitt Launchpad weiter unten in diesem Dokument beachten.
id: Komunitas OpenStack saat ini sedang dalam proses pindah dari Launchpad ke perangkat lunak pelacakan bug ke StoryBoard. Lebih jauh dalam dokumentasi on-boarding khusus proyek, beri perhatian khusus jika proyek menggunakan Launchpad atau StoryBoard. Jika proyek Anda masih menggunakan Launchpad, Anda harus memperhatikan bagian Launchpad nanti di dokumen ini.
ko_kr: OpenStack 커뮤니티는 현재 버그 추적 소프트웨어 Launchpad에서 StoryBoard로 이동하는 중입니다. 프로젝트별 온보드 문서에서는 프로젝트가 Launchpad 또는 StoryBoard를 사용하는지 여부를 특별히 주의하십시오. 프로젝트가 여전히 Launchpad를 사용하는 경우 이 문서 뒷부분의 Launchpad 섹션을 참고하십시오.

source: The OpenStack community uses Internet Relay Chat (IRC) as its primary chat service.
de: Die OpenStack-Community verwendet Internet Relay Chat (IRC) als primären Chatdienst.
id: Komunitas OpenStack menggunakan Internet Relay Chat (IRC) sebagai layanan obrolan utamanya.
ko_kr: OpenStack 커뮤니티는 IRC(인터넷 릴레이 채팅)를 기본 채팅 서비스로 사용합니다.

source: The OpenStack project uses what's called a `clean check` approach. This is designed to keep flaky changes out of the gate. A change always needs to pass the check before it enters the gate. If it fails in the gate, it re-enters the check pipeline.
id: Proyek OpenStack menggunakan apa yang disebut pendekatan `clean check`. Ini dirancang untuk menjaga perubahan tidak merata keluar dari gerbang. Perubahan selalu harus melewati pemeriksaan sebelum memasuki gerbang. Jika gagal di gerbang, itu kembali memasuki pipeline.
ko_kr: OpenStack 프로젝트는 클린 체크(clean check) 접근 방식을 사용합니다. 이것은 문 밖으로 삐걱거리는 변화를 막기 위해 고안되었습니다. 변경 사항은 항상 수표가 게이트에 들어가기 전에 통과해야 합니다. 게이트에서 실패하면 체크 파이프라인이 다시 입력됩니다.

source: The User Committee chairs are elected from and by the group of AUCs.
de: Die Vorsitzenden des User Committee werden aus der Gruppe der AUCs und von ihnen gewählt.
id: Ketua User Committee dipilih dari dan oleh kelompok AUC.
ko_kr: 사용자 위원회의 의장은 AUC 그룹에서 선출됩니다.

source: The `OpenStack Technical Committee <https://governance.openstack.org/tc/>`_ (TC) provides governance and technical oversight of the open development of OpenStack. They validate projects applying to be part of the official OpenStack project and provide an ultimate appeals board for technical decisions. The `Technical Committee Charter <https://governance.openstack.org/tc/reference/charter.html>`_ describes the TC in more detail.
de: Das `OpenStack Technical Committee <https://governance.openstack.org/tc/>`_ (TC) bietet Governance und technische Aufsicht über die offene Entwicklung von OpenStack. Sie validieren Projekte, die sich als Teil des offiziellen OpenStack-Projekts bewerben, und bieten eine ultimative Beschwerdestelle für technische Entscheidungen. Die Satzung des Fachausschusses <https://governance.openstack.org/tc/reference/charter.html>``_ beschreibt den TC näher.
id: The `OpenStack Technical Committee <https://governance.openstack.org/tc/>`_ (TC) memberikan tata kelola dan pengawasan teknis atas pengembangan OpenStack yang terbuka. Mereka memvalidasi proyek yang mendaftar untuk menjadi bagian dari proyek OpenStack resmi dan menyediakan dewan banding utama (ultimate appeals board) untuk keputusan teknis. The `Technical Committee Charter <https://governance.openstack.org/tc/reference/charter.html>`_ menjelaskan TC lebih terinci.
ko_kr: `OpenStack 기술 위원회 <https://governance.openstack.org/tc/>`_ (TC)는 OpenStack의 개방형 개발에 대한 거버넌스 및 기술 감독 기능을 제공합니다. 이들은 공식 OpenStack 프로젝트의 일부분으로 신청하는 프로젝트를 검증하고 기술적 의사결정을 위한 최종 항소 위원회를 제공합니다. `기술 위원회 헌장 <https://governance.openstack.org/tc/reference/charter.html>`_ 은 TC에 대해 더 자세히 설명합니다.

source: The `OpenStack User Committee <https://governance.openstack.org/uc/>`_ (UC) serves the users of OpenStack, representing them to the rest of the OpenStack community. The `User Committee Charter <https://governance.openstack.org/uc/reference/charter.html>`_ describes the UC in more detail.
de: Das `OpenStack User Committee <https://governance.openstack.org/uc/>`_ (UC) dient den Benutzern von OpenStack und vertritt sie gegenüber dem Rest der OpenStack-Community. Die `User Committee Charter <https://governance.openstack.org/uc/reference/charter.html>`_ beschreibt die UC detaillierter.
id: The `OpenStack User Committee <https://governance.openstack.org/uc/>`_ (UC) melayani pengguna OpenStack, yang mewakili mereka ke seluruh komunitas OpenStack. The `User Committee Charter <https://governance.openstack.org/uc/reference/charter.html>`_ menjelaskan UC secara lebih rinci.
ko_kr: `OpenStack UC(User Committee) <https://governance.openstack.org/uc/>`_ 는 OpenStack 사용자를 위해 OpenStack 커뮤니티의 나머지 부분에 서비스를 제공합니다. `사용자 위원회 헌장 <https://governance.openstack.org/uc/reference/charter.html>`_ 은 UC에 대해 좀 더 자세히 설명하고 있습니다.

source: The `PTG <https://www.openstack.org/ptg/>`_ sessions are organized into parallel tracks. The time is divided between Working Groups, SIGs, cross-project and project team sessions and further sessions dedicated to operations related discussions.
id: The `PTG <https://www.openstack.org/ptg/>`_ sesi diatur ke dalam jalur paralel. Waktu dibagi antara Working Groups, SIGs, cross-project dan sesi tim proyek dan sesi lebih lanjut yang didedikasikan untuk diskusi terkait operasi.
ko_kr: `PTG <https://www.openstack.org/ptg/>`_ 세션은 평행 트랙으로 구성되어 있습니다. 시간은 작업 그룹, SIG, 프로젝트 간 세션 및 프로젝트 팀 세션과 운영 관련 토론 전용 세션으로 나뉩니다.

source: The ``APIImpact`` footer contains a comment about why the change impacts a public HTTP API. Put APIImpact on a line by itself. Use this footer to indicate that the patch impacts a public HTTP API. When this footer is included in a commit message, the API_Working_Group can use it to help find relevant reviews.
id: Footer ``APIImpact`` berisi komentar tentang mengapa perubahan memengaruhi API HTTP publik. Letakkan APIImpact di baris itu sendiri. Gunakan footer ini untuk menunjukkan bahwa patch memengaruhi API HTTP publik. Ketika footer ini disertakan dalam pesan komit, API_Working_Group dapat menggunakannya untuk membantu menemukan ulasan yang relevan.
ko_kr: ``APIImpact`` 바닥글에는 이러한 변경이 공개 HTTP API에 영향을 미치는 이유에 대한 설명이 포함되어 있습니다. APIImpact를 그 자체로 한 줄에 놓으세요. 이 바닥글을 사용하여 패치가 공용 HTTP API에 영향을 미친다는 것을 나타냅니다. 이 바닥글이 커밋 메시지에 포함되면 API_Working_Group에서 해당 바닥글을 사용하여 관련 리뷰를 찾을 수 있습니다.

source: The ``Change-Id`` line is a unique hash describing the change, which is generated automatically by a Git commit hook when you initially save a commit message. This should not be changed when rebasing a commit following review feedback, since it is used by Gerrit, to track versions of a patch. It won't appear when you're editing a new commit message for the first time, but if you ``commit --amend`` later you will see it.
id: Baris ``Change-Id``adalah hash unik yang mendeskripsikan perubahan, yang dihasilkan secara otomatis oleh hook commit Git ketika Anda awalnya menyimpan pesan commit. Ini tidak boleh diubah saat melakukan rebasing komit setelah umpan balik tinjauan, karena digunakan oleh Gerrit, untuk melacak versi patch. Itu tidak akan muncul saat Anda mengedit pesan komit baru untuk pertama kalinya, tetapi jika Anda ``commit --amend`` nanti Anda akan melihatnya.
ko_kr: ``Change-ID`` 라인은 Git 커밋 후크에 의해 처음 커밋 메시지를 저장할 때 자동으로 생성되는 변경을 설명하는 고유한 해시입니다. 이는 Gerritt에서 패치 버전을 추적하기 위해 사용되므로 검토 피드백에 따라 커밋을 다시 작성할 때 변경되지 않아야 합니다. 새 커밋 메시지를 처음 편집할 때는 표시되지 않지만 나중에 `` --amend`` 를 ``커밋`` 하면 표시됩니다.

source: The ``Depends-On``: <gerrit-change-url> footer is used to refer to a change the current one depends on. Use the permalink of the change.
id: Footer ``Depends-On``: <gerrit-change-url> digunakan untuk merujuk pada perubahan yang saat ini bergantung. Gunakan tautan permanen perubahan.
ko_kr: ``Depend-On`` : <gerrit-change-urll> 바닥글은 현재의 변화가 의존하고 있는 변화를 가리키는 데 사용됩니다. 변경 사항의 퍼머링크를 사용합니다.

source: The ``DocImpact`` footer contains a comment about why the change impacts documentation. Put DocImpact on a line by itself. Use this footer to indicate that documentation is either contained in the patch or has documentation impact. When this footer is included in a commit message, Gerrit creates a bug for the project affected by the change for task tracking, or move to the openstack-api-site as needed.
id: Footer ``DocImpact`` berisi komentar tentang mengapa perubahan berdampak pada dokumentasi. Letakkan DocImpact pada satu baris dengan sendirinya. Gunakan footer ini untuk menunjukkan bahwa dokumentasi ada dalam patch atau memiliki dampak dokumentasi. Ketika footer ini disertakan dalam pesan komit, Gerrit membuat bug untuk proyek yang terpengaruh oleh perubahan task tracking, atau pindah ke openstack-api-site sesuai kebutuhan.
ko_kr: ``DocImpact`` 바닥글에는 변경사항이 문서에 영향을 미치는 이유에 대한 설명이 포함되어 있습니다. DocImpact를 직접 줄에 놓습니다. 이 바닥글을 사용하여 문서가 패치에 포함되어 있거나 문서에 영향을 미칩니다. 이 바닥글이 커밋 메시지에 포함되면 Gerritt는 작업 추적 변경의 영향을 받는 프로젝트에 대한 버그를 만들거나 필요에 따라 openstack-api-site 사이트로 이동합니다.

source: The ``SecurityImpact`` footer is used to indicate that a change has security implications and should be reviewed by the OpenStack Security Group.
id: Footer ``SecurityImpact`` digunakan untuk menunjukkan bahwa perubahan memiliki implikasi keamanan dan harus ditinjau oleh OpenStack Security Group.
ko_kr: ``SecurityImpact`` 바닥글은 변경사항이 보안에 영향을 미치고 있음을 나타내기 위해 사용되며 OpenStack Security Group에서 검토해야 합니다.

source: The ``UpgradeImpact`` footer contains a comment about why the change impacts upgrades. It is used to indicate that a change has upgrade implications for those doing continuous deployment or N to N+1 upgrades. Also consider updating the 'Upgrade Notes' section in the release notes for the affected project.
id: Footer ``UpgradeImpact`` berisi komentar tentang mengapa perubahan berdampak pada upgrades. Ini digunakan untuk menunjukkan bahwa perubahan memiliki implikasi upgrades bagi mereka yang melakukan penerapan berkelanjutan atau upgrades N ke N + 1. Pertimbangkan juga untuk memperbarui bagian 'Upgrade Notes' di catatan rilis untuk proyek yang terpengaruh.
ko_kr: ``UpgradeImpact`` 바닥글에는 이러한 변화가 업그레이드에 영향을 미치는 이유에 대한 언급이 포함되어 있습니다. 지속적인 배포 또는 N-N+1 업그레이드를 수행하는 사용자에게 변경 사항이 업그레이드에 영향을 미친다는 것을 나타내는 데 사용됩니다. 또한 영향을 받는 프로젝트의 릴리스 노트에 있는 'Notes 업그레이드' 섹션을 업데이트하는 것도 고려합니다.

source: The basic princinples of the OpenStack community are the four opens.
de: Die Grundprinzipien der OpenStack-Community sind die vier opens.
id: Prinsip dasar komunitas OpenStack adalah empat terbuka.
ko_kr: OpenStack 커뮤니티의 기본 이념은 4가지 오픈입니다.

source: The body contains the explanation of the issue being solved and why it should be fixed, the description of the solution, and additional optional information on how it improves the code structure, or references to other relevant patches, for example. The lines are limited to 72 characters. The body should contain all the important information related to the problem, without assuming that the reader understands the source of the problem or has access to external sites.
de: Der Body enthält die Erklärung des zu lösenden Problems und warum es behoben werden sollte, die Beschreibung der Lösung und zusätzliche optionale Informationen, wie es die Code-Struktur verbessert, oder Verweise auf andere relevante Patches, zum Beispiel. Die Zeilen sind auf 72 Zeichen begrenzt. Die Stelle sollte alle wichtigen Informationen im Zusammenhang mit dem Problem enthalten, ohne davon auszugehen, dass der Leser die Ursache des Problems versteht oder Zugang zu externen Seiten hat.
id: Body berisi penjelasan tentang masalah yang sedang dipecahkan dan mengapa hal itu harus diperbaiki, deskripsi solusi, dan informasi tambahan opsional tentang bagaimana hal itu meningkatkan struktur kode, atau referensi ke patch lain yang relevan, misalnya. Garis dibatasi hingga 72 karakter. Body harus memuat semua informasi penting yang terkait dengan masalah, tanpa berasumsi bahwa pembaca memahami sumber masalah atau memiliki akses ke situs eksternal.
ko_kr: 본문에는 해결 중인 문제와 해결되어야 하는 이유에 대한 설명, 솔루션에 대한 설명, 그리고 코드 구조를 개선하는 방법에 대한 추가 선택적 정보 또는 기타 관련 패치에 대한 참조가 포함되어 있습니다. 줄은 72자로 제한됩니다. 본문은 독자가 문제의 근원을 이해하거나 외부 사이트에 액세스할 수 있다고 가정하지 않고 문제와 관련된 모든 중요한 정보를 포함해야 합니다.

source: The branch is under Extended Maintenance rules, but there are no maintainers.
id: Branch berada di bawah aturan Extended Maintenance, tetapi tidak ada pengelola.
ko_kr: 분기가 확장 유지 관리 규칙에 있지만 유지 관리자가 없습니다.

source: The bug comments contain a full analysis on how to properly fix the issue
de: Die Bug-Kommentare enthalten eine vollständige Analyse, wie man das Problem richtig behebt
id: Komentar bug berisi analisis lengkap tentang cara memperbaiki masalah dengan benar
ko_kr: 버그 설명에는 문제를 올바르게 해결하는 방법에 대한 전체 분석이 포함되어 있습니다.

source: The bug is waiting on input from the reporter
de: Der Fehler wartet auf Eingaben des Reporters
id: Bug menunggu masukan dari reporter
ko_kr: 버그가 리포터의 입력을 기다리고 있습니다.

source: The bug was just created
de: Der Bug wurde gerade erst erstellt
id: Bug baru saja dibuat
ko_kr: 버그가 방금 생성되었습니다.

source: The bug was reproduced or confirmed as a genuine bug
de: Der Fehler wurde reproduziert oder als echter Fehler bestätigt
id: Bug tersebut direproduksi atau dikonfirmasi sebagai bug asli
ko_kr: 버그가 정품 버그로 확인되었습니다.

source: The cohort program is hosted under the `Diversity and Inclusion Working Group <https://wiki.openstack.org/wiki/Diversity>`_. For more information about the cohort program, you can check out their `wiki <https://wiki.openstack.org/wiki/Mentoring#Long_Term_Mentoring>`_.
de: Das Kohortenprogramm wird im Rahmen der Arbeitsgruppe `Diversity and Inclusion Working Group <https://wiki.openstack.org/wiki/Diversity>`_ durchgeführt. Für weitere Informationen über das Kohortenprogramm können Sie sich deren `Wiki <https://wiki.openstack.org/wiki/Mentoring#Long_Term_Mentoring>`_ ansehen.
id: Program kohort di-hosting di bawah `Diversity and Inclusion Working Group <https://wiki.openstack.org/wiki/Diversity>`_. Untuk informasi lebih lanjut tentang program kohort, Anda dapat melihatnya `wiki <https://wiki.openstack.org/wiki/Mentoring#Long_Term_Mentoring>`_.
ko_kr: 코호트 프로그램은 `다양성 및 포함 작업 그룹 <https://wiki.openstack.org/wiki/Diversity>`_ 에 따라 주최됩니다. 코호트 프로그램에 대한 자세한 내용은 `그들의 위키 <https://wiki.openstack.org/wiki/Mentoring#Long_Term_Mentoring>`_ 을 확인하실 수 있습니다.

source: The command sets up the necessary remote hosts and commit hooks to enable pushing changes to Gerrit.
de: Der Befehl richtet die notwendigen Remote-Hosts und Commit-Hooks ein, um Änderungen an Gerrit zu übernehmen.
id: Perintah mengatur host jarak jauh yang diperlukan dan melakukan kait untuk memungkinkan mendorong perubahan ke Gerrit.
ko_kr: 이 명령은 필요한 원격 호스트와 커밋 후크를 설정하여 Gerrit의 변경 사항을 푸시할 수 있도록 합니다.

source: The conference sessions consist of 40-minute-long presentations and panel discussions organized into tracks, like 'Public Clouds', 'Containers', or 'Telecom/NFV'.
de: Die Konferenzsitzungen bestehen aus 40-minütigen Präsentationen und Podiumsdiskussionen, die in Tracks wie "Public Clouds", "Container" oder "Telecom/NFV" organisiert sind.
id: Sesi konferensi terdiri dari presentasi berdurasi 40 menit dan diskusi panel yang diatur dalam trek, seperti 'Public Clouds', 'Containers', atau 'Telecom/NFV'.
ko_kr: 컨퍼런스 세션은 '공용 클라우드', '컨테이너' 또는 '텔레콤/NFV'와 같이 트랙으로 구성된 40분 길이의 프레젠테이션과 패널 토론으로 구성됩니다.

source: The currently available options are the following:
de: Die derzeit verfügbaren Optionen sind die folgenden:
id: Opsi yang saat ini tersedia adalah sebagai berikut:
ko_kr: 현재 사용 가능한 옵션은 다음과 같습니다.
