Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-non-code-contribution.po
Languages: de, id, ko_kr, zh_cn

source: :doc:`../common/accounts` are important for a variety of activies such as participating in elections, filing bugs in our community task trackers, and submitting speaker presentations.
de: :doc:`../common/accounts` sind wichtig für eine Vielzahl von Aktivitäten wie die Teilnahme an Wahlen, das Einreichen von Bugs in unseren Community-Task-Tracker und das Einreichen von Präsentationen.
id: :doc:`../common/accounts` penting untuk berbagai kegiatan seperti berpartisipasi dalam pemilihan, mengajukan bug di pelacak tugas komunitas kami, dan mengirimkan presentasi pembicara.
ko_kr: :doc:`../common/accounts` 는 선거 참여, 커뮤니티 작업 추적기의 버그 신고, 발표자 프레젠테이션 제출과 같은 다양한 활동에 중요합니다.
zh_cn: :doc:`../common/accounts` 对于各种活动非常重要，例如参与选举，在社区任务跟踪器中提交错误以及提交演讲者演示文稿。

source: :doc:`../common/communication` is the most important thing we can teach you in this guide. Without our mailing lists, IRC, and other community tools, we would not be able to collaborate across the globe to build the amazing software that we do.
de: :doc:`../common/communication` ist das Wichtigste, was wir Ihnen in diesem Leitfaden beibringen können. Ohne unsere Mailinglisten, IRC und andere Community-Tools wären wir nicht in der Lage, weltweit zusammenzuarbeiten, um die erstaunliche Software zu erschaffen, die wir entwickeln.
id: :doc:`../common/communication` adalah hal terpenting yang dapat kami ajarkan kepada Anda dalam panduan ini. Tanpa milis kami, IRC, dan alat komunitas lainnya, kami tidak akan dapat berkolaborasi di seluruh dunia untuk membangun perangkat lunak luar biasa yang kami lakukan.
ko_kr: :doc:`../common/communication` 는 이 가이드에서 우리가 가르쳐 줄 수 있는 가장 중요한 사항입니다. 메일링 리스트, IRC 및 기타 커뮤니티 도구 없이는 우리가 수행하는 놀라운 소프트웨어를 구축하기 위해 전 세계에서 협력 할 수 없습니다.
zh_cn: :doc:`../common/communication` 是我们在本指南中教给你的最重要的事情。 如果没有我们的邮件列表，IRC和其他社区工具，我们将无法在全球范围内进行协作来构建我们所做的惊人软件。

source: :doc:`../common/events` are essential to our community health and development process. While we as contributors span the globe, we occasionally get together to make progress face to face.
de: :doc:`../common/events` sind für unseren Gesundheits- und Entwicklungsprozess in der Gemeinschaft von wesentlicher Bedeutung. Während wir als Mitwirkende den Globus umspannen, treffen wir uns gelegentlich, um von Angesicht zu Angesicht Fortschritte zu erzielen.
id: :doc:`../common/events` sangat penting untuk proses pembangunan dan kesehatan masyarakat kita. Sementara kami sebagai kontributor menjangkau dunia, kami sesekali berkumpul untuk membuat kemajuan secara langsung.
ko_kr: :doc:`../common/events` 는 커뮤니티 건강 및 개발 프로세스에 필수적입니다. 우리가 전 세계에 걸쳐 기여하는 동안, 우리는 때때로 얼굴을 맞대고 발전하기 위해 함께 모입니다.
zh_cn: :doc:`../common/events` 对我们的社区健康和发展过程至关重要。 虽然我们作为贡献者遍布全球，但我们偶尔会聚在一起取得进展。

source: :doc:`../common/governance` is not always the most thrilling topic, but its important to understand how we organize ourselves to help get the work done efficiently.
de: :doc:`../common/governance` ist nicht immer das spannendste Thema, aber es ist wichtig zu verstehen, wie wir uns organisieren, um die Arbeit effizient zu erledigen.
id: :doc:`../common/governance` tidak selalu topik yang paling mendebarkan, tetapi penting untuk memahami bagaimana kita mengatur diri kita sendiri untuk membantu menyelesaikan pekerjaan secara efisien.
ko_kr: :doc:`../common/governance` 는 항상 가장 흥미로운 주제는 아니지만 효율적으로 작업을 수행 할 수 있도록 우리 자신을 구성하는 방법을 이해하는 것은 중요합니다.
zh_cn: :doc:`../common/governance` 并不总是最激动人心的话题，但了解我们如何组织自己以帮助高效完成工作非常重要。

source: :doc:`../common/irc` (Internet Relay Chat) is our synchronous way of communicating.
de: :doc:`../common/irc` (Internet Relay Chat) ist unsere synchrone Art der Kommunikation.
id: :doc:`../common/irc` (Internet Relay Chat) adalah cara komunikasi kami yang sinkron.
ko_kr: :doc:`../common/irc` (인터넷 릴레이 채팅)는 동기식 통신 방식입니다.
zh_cn: :doc:`../common/irc` (Internet Relay Chat）是我们即时沟通的方式。

source: :doc:`../common/mentoring` in the OpenStack community is set up to be a light weight cohort style program where each cohort focuses on accomplishing a specific goal.
de: :doc:`../common/mentoring` in der OpenStack-Community ist als ein leichtgewichtiges Kohortenprogramm konzipiert, bei dem sich jede Kohorte auf die Erreichung eines bestimmten Ziels konzentriert.
id: :doc:`../common/mentoring` di komunitas OpenStack diatur menjadi program gaya kohort ringan di mana masing-masing kelompok berfokus pada pencapaian tujuan tertentu.
ko_kr: OpenStack 커뮤니티의 :doc:`../common/mentoring` 은 각 코호트가 특정 목표를 달성하는 데 집중하는 경량 코호트 스타일 프로그램으로 설정됩니다.
zh_cn: :doc:`../common/mentoring` 在OpenStack社区中被设定为一个轻量级的群组项目（cohort style program），每个群组都专注于实现一个特定的目标。

source: :doc:`../common/releases` and understanding the process that the different OpenStack components go through gives context to how we work as a community.
de: :doc:`../common/releases` und das Verständnis des Prozesses, durch den die verschiedenen OpenStack-Komponenten gehen, gibt einen Kontext dafür, wie wir als Community arbeiten.
id: :doc:`../common/releases` dan memahami proses yang dilakukan berbagai komponen OpenStack memberikan konteks bagaimana kami bekerja sebagai komunitas.
ko_kr: :doc:`../common/releases` 및 다양한 OpenStack 구성 요소가 거치는 프로세스를 이해하는 것은 커뮤니티로서 우리가 어떻게 작업하는지에 대한 맥락을 제공합니다.
zh_cn: :doc:`../common/releases` 并理解不同OpenStack组件经历的过程为我们作为社区工作的方式提供了背景。

source: As with all Open Source communities, there are more ways to contribute than to push code. If you're interested in doing that, great! You'll want to start over here with the :doc:`../code-and-documentation/introduction` guide instead. If not, you've come to the right place!
de: Wie bei allen Open-Source-Communities gibt es mehr Möglichkeiten, einen Beitrag zu leisten, als Code zu pushen. Wenn Sie daran interessiert sind, das zu tun, großartig! Sie werden hier mit dem Leitfaden :doc:`../code-and-documentation/introduction` beginnen wollen. Wenn nicht, sind Sie hier genau richtig!
id: Seperti halnya semua komunitas Open Source, ada lebih banyak cara untuk berkontribusi daripada mendorong kode. Jika Anda tertarik melakukan itu, bagus! Anda akan ingin memulai dari sini dengan panduan :doc:`../code-and-documentation/introduction` sebagai gantinya. Jika tidak, Anda telah datang ke tempat yang tepat!
ko_kr: 모든 오픈 소스 커뮤니티와 마찬가지로 코드를 푸시하는 것보다 기여하는 방법이 더 많습니다. 그 일에 관심이 있다면 좋습니다! 여기에서 :doc:`../code-and-documentation/introduction` 가이드로 시작하는 것이 좋습니다. 그렇지 않다면, 잘 왔습니다!
zh_cn: 与所有开源社区一样，除了推送代码还有其他方式。如果您对代码有兴趣，很棒！您可能希望从这个 :doc:`../code-and-documentation/introduction` 指南开始。否则的话，您来对地方了！

source: Communicating with the Community
de: Kommunikation mit der Gemeinschaft
id: Berkomunikasi dengan Komunitas
ko_kr: 커뮤니티와의 소통
zh_cn: 与社区沟通

source: Depending on what you're interested in and the level of involvement you would like to have, we have something for you! In the following sections of this guide, we will cover all the different ways of contributing that don't deal with writing code.
de: Je nachdem, was Sie interessiert und wie intensiv Sie sich engagieren möchten, haben wir etwas für Sie! In den folgenden Abschnitten dieses Leitfadens werden wir alle verschiedenen Arten von Beiträgen behandeln, die sich nicht mit dem Schreiben von Code befassen.
id: Bergantung pada apa yang Anda minati dan tingkat keterlibatan yang ingin Anda miliki, kami memiliki sesuatu untuk Anda! Pada bagian berikut dari panduan ini, kami akan membahas semua cara berbeda dalam berkontribusi yang tidak berhubungan dengan penulisan kode.
ko_kr: 관심있는 내용과 원하는 참여 수준에 따라 우리는 당신을 위한 무언가를 가지고 있습니다! 이 가이드의 다음 섹션에서는 코드 작성을 다루지 않는 다양한 기여 방법을 모두 다룰 것입니다.
zh_cn: 根据您感兴趣的内容和您希望的参与程度，我们会为您提供帮助！ 在本指南的以下部分中，我们将介绍不涉及编写代码的所有不同贡献方式。

source: First, we would like to say welcome to our community! We may look big and confusing at the start, but we promise that we are here to help you find your place and answer your questions.
de: Zuerst möchten wir Sie in unserer Community willkommen heißen! Wir mögen am Anfang groß und verwirrend aussehen, aber wir versprechen, dass wir hier sind, um Ihnen zu helfen, Ihren Platz zu finden und Ihre Fragen zu beantworten.
id: Pertama, kami ingin mengucapkan selamat datang ke komunitas kami! Kami mungkin terlihat besar dan membingungkan pada awalnya, tetapi kami berjanji bahwa kami di sini untuk membantu Anda menemukan tempat Anda dan menjawab pertanyaan Anda.
ko_kr: 먼저 우리 커뮤니티에 오신 것을 환영합니다! 처음에는 크고 혼란스러워 보일 수 있지만, 귀하의 자리를 찾고 질문에 답할 수 있도록 도와 드릴 것을 약속드립니다.
zh_cn: 首先，我们想欢迎您来到我们的社区！ 在初期我们可能看起来很庞大而且令人困惑，但我们保证我们会帮助您找到自己的位置并解答您的疑问。

source: Getting to Know the Community
de: Kennenlernen der Community
id: Mengenal Komunitas
ko_kr: 커뮤니티에 대한 정보 얻기
zh_cn: 了解社区

source: Non-Code Contribution Types
de: Nicht codierte Beitragsarten
id: Jenis Kontribusi Non-Kode
ko_kr: 비 코드 기여 유형
zh_cn: 非代码贡献类型

source: Non-Code Contributor Guide
de: Leitfaden für Nicht-Code-Beitragende
id: Panduan Kontributor Non-Kode
ko_kr: 비 코드 기여자 가이드
zh_cn: 非代码贡献者指南

source: These sections of the guide help you set up the tools you might need to communicate with different parts of the community.
de: Diese Abschnitte des Leitfadens helfen Ihnen bei der Einrichtung der Tools, die Sie benötigen, um mit verschiedenen Teilen der Community zu kommunizieren.
id: Bagian-bagian panduan ini membantu Anda mengatur alat yang mungkin Anda perlukan untuk berkomunikasi dengan berbagai bagian komunitas.
ko_kr: 가이드의 이러한 섹션은 커뮤니티의 다른 부분과 통신하는 데 필요한 도구를 설정하는 데 도움이 됩니다.
zh_cn: 本指南的这些部分可帮助您设置与社区不同部分进行通信所需的工具。

source: These sections of the guide will help you get to know our community's structure - how we organize ourselves, how we organize the work we do along a timeline, and what events we have to help us get things done.
de: Diese Abschnitte des Leitfadens helfen Ihnen, die Struktur unserer Community kennenzulernen - wie wir uns selbst organisieren, wie wir die Arbeit, die wir entlang einer Zeitleiste erledigen, organisieren und welche Veranstaltungen wir haben, um uns zu helfen, Dinge zu erledigen.
id: Bagian-bagian panduan ini akan membantu Anda mengenal struktur komunitas kami - bagaimana kami mengatur diri kami sendiri, bagaimana kami mengatur pekerjaan yang kami lakukan sepanjang garis waktu, dan acara apa yang kami miliki untuk membantu kami menyelesaikan sesuatu.
ko_kr: 가이드의 이 섹션은 커뮤니티의 구조, 즉 우리 자신을 조직하는 방법, 타임 라인에 따라 수행하는 작업을 구성하는 방법, 작업을 수행하는 데 도움이 되는 이벤트가 무엇인지 파악하는 데 도움이 됩니다.
zh_cn: 本指南的这些部分将帮助您了解我们社区的结构：我们如何组织自己，如何组织我们在时间轴上所做的工作，以及我们有哪些活动来帮助我们完成工作。
