Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-operators.po
Languages: de, id, ko_kr, zh_cn

source: Architecture Guides
de: Architektur Anleitungen
id: Panduan Arsitektur
ko_kr: 아키텍처 가이드

source: Create a forum in which to share best practices and architectures between interested parties
de: Schaffung eines Forums, in dem bewährte Verfahren und Architekturen zwischen interessierten Parteien ausgetauscht werden können.
id: Buat forum untuk berbagi praktik terbaik dan arsitektur antara pihak yang berkepentingan
ko_kr: 이해 관계자간에 모범 사례와 아키텍처를 공유 할 수 있는 포럼을 만듭니다.
zh_cn: 创建一个论坛，在其中分享感兴趣的各方之间的最佳实践和架构

source: Example configurations for various OpenStack services are provided in the `openstack/osops-example-configs repository <https://git.openstack.org/cgit/openstack/osops-example-configs/tree/README.md>`_. Operators can share their configuration files to help others, and review how others setup and tune their configurations.
ko_kr: 다양한 OpenStack 서비스에 대한 예제 구성은 `openstack / osops-example-configs 저장소 <https://git.openstack.org/cgit/openstack/osops-example-configs/tree/README.md>`_ 에서 제공됩니다. 운영자는 다른 사용자를 돕기 위해 구성 파일을 공유하고, 다른 사용자가 자신의 구성을 설정하고 조정하는 방법을 검토할 수 있습니다.

source: Gather feedback on the issues that come up in running OpenStack and work to communicate this throughout the community
de: Sammeln Sie Feedback zu den Problemen, die bei der Ausführung von OpenStack auftreten, und arbeiten Sie daran, dies in der gesamten Community zu kommunizieren.
id: Kumpulkan umpan balik tentang masalah yang muncul dalam menjalankan OpenStack dan bekerja untuk mengomunikasikan hal ini di seluruh komunitas
ko_kr: OpenStack 실행시 발생하는 문제에 대한 피드백을 수집하고 커뮤니티 전체에 이를 알리기 위해 노력합니다.
zh_cn: 收集有关运行OpenStack时出现的问题的反馈，并努力在整个社区中进行沟通

source: IRC Channels
de: IRC-Kanäle
id: Saluran IRC
ko_kr: IRC 채널
zh_cn: IRC频道

source: If you find any issues with the guides, please file a bug! Better yet, fix the bug! On each page of the documentation there is a link in the top right corner to the place bugs are filed (could be Launchpad or StoryBoard depending on the repository).
de: Wenn Sie Probleme mit den Anleitungen finden, melden Sie bitte einen Fehler! Besser noch, beheben Sie den Fehler! Auf jeder Seite der Dokumentation befindet sich in der oberen rechten Ecke ein Link zu dem Ort, an dem Fehler abgelegt werden (je nach Repository kann es Launchpad oder StoryBoard sein).
id: Jika Anda menemukan masalah dengan panduan ini, silakan ajukan bug! Lebih baik lagi, perbaiki bug! Pada setiap halaman dokumentasi ada tautan di sudut kanan atas ke tempat bug diajukan (bisa berupa Launchpad atau StoryBoard tergantung pada repositori).
ko_kr: 가이드에서 문제를 찾아낼 경우 버그를 신고하세요! 더 나은 방법은 버그를 수정하는 것 입니다! 문서의 각 페이지에는 오른쪽 상단 모서리에 버그 위치에 대한 링크가 있습니다. (저장소에 따라 Launchpad 또는 StoryBoard 일 수 있습니다).

source: In the :ref:`setup-irc` section of this guide, there are instructions on how to setup a desktop client and register your irc nickname so that you can join these channels.
ko_kr: 이 가이드의 :ref:`setup-irc` 섹션에는 채널에 참여할 수 있도록 데스크톱 클라이언트를 설정하고 irc 닉네임을 등록하는 방법에 대한 지침이 있습니다.

source: Increase constructive, proactive involvement from those running clouds
de: Steigern Sie die konstruktive, proaktive Beteiligung der Betreiber von Clouds.
id: Tingkatkan keterlibatan konstruktif, proaktif dari awan yang berlari
ko_kr: 실행중인 클라우드에서 발전적이고 적극적인 참여를 증가
zh_cn: 增加运行云计算的建设性与主动性

source: Introduction
de: Einführung
id: Pengantar
ko_kr: 소개
zh_cn: 介绍

source: Mailing List
de: Mailinglisten
id: Mailing List (milis)
ko_kr: 메일링 리스트
zh_cn: 邮件列表

source: Meet Ups
id: Rapat
ko_kr: 밋업
zh_cn: 聚会

source: More generic information about mailing lists can be found in the Communication page's :ref:`communication-mailing-lists` section.
de: Weitere allgemeine Information über Mailinglisten sind auf der Kommunicationsseite im Abschnitt :ref:`communication-mailing-lists`.
id: Informasi umum lainnya tentang milis dapat ditemukan di halaman Communication bagian :ref:`communication-mailing-lists` .
ko_kr: 메일링 리스트에 대한 일반적인 정보는 커뮤니케이션 페이지의 :ref:`communication-mailing-lists` 섹션에서 찾을 수 있습니다.

source: OpenStack is running in production all around the globe resulting in a large group of people who's daily job is to deploy and operate the platform.
de: OpenStack läuft in der Produktion rund um den Globus, was dazu führt, dass eine große Gruppe von Menschen gibt, die täglich damit beschäftigt sind, die Plattform bereitzustellen und zu betreiben.
id: OpenStack berjalan dalam produksi di seluruh dunia yang menghasilkan sekelompok besar orang yang pekerjaan hariannya adalah menyebarkan dan mengoperasikan platform.
ko_kr: OpenStack은 전 세계적으로 운영 환경에서 실행 중이며, 그로 인해 많은 사람들이 매일 플랫폼을 배포하고 운영하는 일을 하고 있습니다.
zh_cn: 运行着OpenStack的生产环境遍及全球，导致一大群人每天的工作就是部署和运维此平台。

source: Operations Guide
de: Betriebshandbuch
id: Panduan Operasi
ko_kr: 운영 가이드

source: Operator Contributors
de: Mitwirkende im Betrieb
id: Kontributor Operator
ko_kr: 운영자 컨트리뷰터
zh_cn: 运维贡献者

source: Operators had previously used a dedicated mailing list until November 2018. You can read the `openstack.operators archive <http://lists.openstack.org/pipermail/openstack-operators/>`_ which contains plenty of valuable information.
de: Die Betreiber verwendeten eine dedizierte Mailingliste bis November 2018. Sie können das `openstack.operators Archiv <http://lists.openstack.org/pipermail/openstack-operators/>`_ lesen, welches viele wertvolle Informationen enthält.
id: Operator sebelumnya telah menggunakan milis khusus hingga November 2018. Anda dapat membaca arsip `openstack.operators <http://lists.openstack.org/pipermail/openstack-operators/>` _ yang berisi banyak informasi berharga.
ko_kr: 운영자는 이전에 2018 년 11 월까지 전용 메일 링리스트를 사용했습니다. 귀중한 정보가 많이 포함 된 `openstack.operators 아카이브 <http://lists.openstack.org/pipermail/openstack-operators/>`_ 를 읽을 수 있습니다.

source: Operators' Contributor Guide
de: Leitfaden für Mitwirkende der Betreiber
id: Panduan Kontributor Operator
ko_kr: 운영자 컨트리뷰터 가이드
zh_cn: 运维贡献者手册

source: Participating
de: Teilnehmende
id: Berpartisipasi
ko_kr: 참여하기
zh_cn: 参与

source: Resources
de: Ressourcen
id: Sumber daya
ko_kr: 리소스

source: Security Guide
de: Sicherheitsanleitung
id: Panduan Keamanan
ko_kr: 보안 가이드

source: Share and Learn From Real Configurations
de: Teilen und Lernen von realen Konfigurationen
id: Bagikan dan Belajar Dari Konfigurasi Nyata
ko_kr: 실제 설정을 공유하고 배우기
zh_cn: 分享真实配置并学习

source: The order the guides are presented in is the typical order they are needed in, but of course you should feel free to explore them in any order you like.
de: Die Anleitungen sind in der Reiherfolge präsentiert wie sie typischerweise gebraucht werden, aber Sie können sie natürlich so erforschen wie sie wollen.
id: Urutan panduan yang disajikan adalah urutan khas yang diperlukan, tetapi tentu saja Anda harus merasa bebas untuk menjelajahinya dalam urutan apa pun yang Anda suka.
ko_kr: 가이드가 표시되는 순서는 가이드에 필요한 일반적인 순서이지만, 당신이 원하는 순서대로 자유롭게 탐색 할 수 있습니다.

source: There are many resources available to operators. Some are maintained by the operator community while others are maintained by the upstream developers. Below are brief descriptions of guides to hopefully help you get to the information you need quicker!
de: Den Betreibern stehen viele Ressourcen zur Verfügung. Einige werden von der Betreibergemeinschaft gepflegt, während andere von den Upstream-Entwicklern gepflegt werden. Im Folgenden finden Sie kurze Beschreibungen von Anleitungen, die Ihnen hoffentlich helfen, schneller zu den Informationen zu gelangen, die Sie benötigen!
id: Ada banyak sumber daya yang tersedia untuk operator. Beberapa dikelola oleh komunitas operator sementara yang lain dikelola oleh pengembang hulu. Di bawah ini adalah deskripsi singkat panduan untuk semoga membantu Anda mendapatkan informasi yang Anda butuhkan lebih cepat!
ko_kr: 운영자가 사용할 수 있는 많은 리소스가 있습니다. 일부는 운영자 커뮤니티에서 유지 관리하는 반면 다른 일부는 업스트림 개발자가 유지 관리합니다. 다음은 필요한 정보를 더 빨리 얻을 수 있도록 도움이 되는 가이드에 대한 간략한 설명입니다!

source: There are other events relevant to operators besides just the meetup, :ref:`events-forum` and the rest of the :ref:`summit`
de: Es gibt weitere Veranstaltungen für Betreiber neben dem Meetup, :ref:`events-forum` und den Rest des :ref:`summit`
id: Ada acara lain yang relevan dengan operator selain hanya pertemuan, :ref:`events-forum` dan sisanya dari :ref:`summit`
ko_kr: :ref:`events-forum` 과 나머지 :ref:`summit` 밋업 외에도 운영자와 관련된 다른 이벤트가 있습니다.

source: To find documentation on how to deploy and run OpenStack you can look up the `OpenStack Manuals <https://docs.openstack.org/>`_ web page.
de: Eine Dokumentation zur Bereitstellung und Ausführung von OpenStack finden Sie auf der Webseite `OpenStack Manuals <https://docs.openstack.org/>`_.
id: Untuk menemukan dokumentasi tentang cara menyebarkan dan menjalankan OpenStack Anda dapat mencari `OpenStack Manuals <https://docs.openstack.org/>` _ halaman web.
ko_kr: 오픈스택을 운영하거나 배포하는 방법에 관한 문서를 찾으려면 `오픈스택 매뉴얼 <https://docs.openstack.org/>`_ 웹 페이지를 찾아 볼 수 있습니다.
zh_cn: 要查找有关如何部署和运行OpenStack的文档，您可以查看 `OpenStack手册 <https://docs.openstack.org/>`_ 网页。

source: To get more operator attention, prepend '[ops]' to your email subject lines.
de: Um mehr Aufmerksamkeit der Betreiber zu bekommen, fügen Sie '[ops]' am Anfang des Email Betreffs ein.
id: Untuk mendapatkan lebih banyak perhatian operator, tambahkan '[ops]' ke baris subjek email Anda.
ko_kr: 운영자의 관심을 더 많이 받으려면, 이메일 제목에 '[ops]' 를 추가하십시오.

source: To unify our community, we have replaced the operator and developer specific mailing lists with a `joint mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ for developers and operators to subscribe to and converse on together.
de: Um die Communities zu vereinen, haben wir die Betreiber und Entwickler spezifischen Mailinglisten ersetzt dur eine `kombinierte Mailingliste <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ für Entwickler und Betreiber zum Abonnieren und zusammen diskutieren.
id: Untuk menyatukan komunitas kami, kami telah mengganti milis khusus operator dan pengembang dengan `joint mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>` _ untuk pengembang dan operator untuk berlangganan dan berkomunikasi bersama.
ko_kr: 커뮤니티를 통합하기 위해, 운영자와 개발자가 함께 가입하고 대화할 수 있도록 개별 메일링 리스트를 `공동 메일링 리스트 <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ 로 대체했습니다.

source: Virtual Machine Image Guides
de: Virtuelle-Maschinen-Abbild-Anleitungen
id: Panduan Image Mesin Virtual
ko_kr: 가상머신 이미지 가이드

source: We actively encourage operators to participate and engage with the community to provide feedback and help us shape the software and documentation to be more user friendly.
de: Wir ermutigen die Betreiber aktiv, sich an der Community zu beteiligen und mit ihr zusammenzuarbeiten, um Feedback zu geben und uns zu helfen, die Software und Dokumentation benutzerfreundlicher zu gestalten.
id: Kami secara aktif mendorong operator untuk berpartisipasi dan terlibat dengan komunitas untuk memberikan umpan balik dan membantu kami membentuk perangkat lunak dan dokumentasi agar lebih ramah pengguna.
ko_kr: 우리는 운영자가 커뮤니티에 참여하여 피드백을 제공하고 소프트웨어와 문서를 보다 사용자 친화적으로 만들 수 있도록 적극 권장합니다.
zh_cn: 我们积极鼓励运维参与并与社区互动，提供反馈，帮助我们塑造软件和文档，使其对用户更加友好。

source: `Operators' Meetups <https://wiki.openstack.org/wiki/Operations/Meetups>`_ give people who run clouds a place to congregate, swap best practices, ideas and give feedback. It has a mostly round table/working/discussion session feel, with only a small number of presentations, with the following aims:
de: Operators' Meetups <https://wiki.openstack.org/wiki/Operations/Meetups>`_ geben Menschen, die Clouds betreiben, einen Ort, an dem sie sich treffen, Best Practices, Ideen austauschen und Feedback geben können. Es hat ein meist rundes Tisch-, Arbeits- und Diskussionsgefühl, mit nur wenigen Präsentationen und den folgenden Zielen:
id: `Operators' Meetups <https://wiki.openstack.org/wiki/Operations/Meetups>`_ memberikan orang-orang yang menjalankan cloud tempat untuk berkumpul, bertukar praktik terbaik, ide, dan memberikan umpan balik. Itu sebagian besar merasa diskusi round table/working/discussion , dengan hanya sejumlah kecil presentasi, dengan tujuan sebagai berikut:
ko_kr: `운영자 모임 <https://wiki.openstack.org/wiki/Operations/Meetups>`_ 는 클라우드를 운영하는 사람들이 모여서 모범 사례, 아이디어를 교환하고 피드백을 제공 할 수있는 공간을 제공합니다. 적은 수의 프레젠테이션만으로도 대부분의 라운드 테이블 / 작업 / 토론 세션 느낌이 있으며, 다음과 같은 목표를 가지고 있습니다:
zh_cn: `运维聚会 <https://wiki.openstack.org/wiki/Operations/Meetups>`_ 让运行云的人聚集在一起，交换最佳实践，想法并提供反馈。 它主要是圆桌会议/工作/讨论会议的感觉，只有少数演讲，其目标如下：

source: `The Architecture Guide <https://docs.openstack.org/arch-design/>`_ provides basic information about designing an OpenStack cloud. This guide discusses the basics, common use cases, and architecture design requirements.
de: 'Die Architektur Anleitung <https://docs.openstack.org/arch-design/>'_ bietet grundlegende Informationen zum Entwerfen einer OpenStack-Cloud. In diesem Handbuch werden die Grundlagen, allgemeine Anwendungsfälle und Anforderungen an den Architekturentwurf erläutert.
id: `The Architecture Guide <https://docs.openstack.org/arch-design/>`_ memberikan informasi dasar tentang merancang cloud OpenStack. Panduan ini membahas dasar-dasar, kasus penggunaan umum, dan persyaratan desain arsitektur.
ko_kr: `아키텍처 가이드 <https://docs.openstack.org/arch-design/>`_ 는 OpenStack 클라우드 설계에 대한 기본 정보를 제공합니다. 이 가이드에서는 기본 사항, 일반적인 사용 사례 및 아키텍처 디자인 요구 사항에 대해 설명합니다.

source: `The Operations Guide <https://docs.openstack.org/operations-guide>`_ is generally focused on what happens after day 1 of spinning up an OpenStack Cloud. It offers some basic setup information, but the majority of the content is about maintenance, troubleshooting, user facing capabilities, and scaling.
de: 'Die Betreiber Anleitung <https://docs.openstack.org/operations-guide>'_ konzentriert sich im Allgemeinen auf das, was nach Tag 1 des Hochfahrens einer OpenStack Cloud passiert. Es bietet einige grundlegende Setup-Informationen, aber der Großteil des Inhalts bezieht sich auf Wartung, Fehlerbehebung, benutzerorientierte Funktionen und Skalierung.
id: `The Operations Guide <https://docs.openstack.org/operations-guide>`_ umumnya terfokus pada apa yang terjadi setelah hari pertama memintal OpenStack Cloud. Ini menawarkan beberapa informasi pengaturan dasar, tetapi sebagian besar konten adalah tentang pemeliharaan, pemecahan masalah, kemampuan yang dihadapi pengguna, dan penskalaan.
ko_kr: `운영 가이드 <https://docs.openstack.org/operations-guide>`_ 는 일반적으로 OpenStack 클라우드를 가동한 후 1일 이후에 발생하는 일을 중점적으로 다루고 있습니다. 일부는 기본 설정 정보를 제공하지만, 대부분의 콘텐츠는 유지 관리, 문제 해결, 사용자 대면 기능과 확장에 관한 것입니다.

source: `The Security Guide <https://docs.openstack.org/security-guide/>`_ provides information about ways to keep your cloud secure. It covers everything from identity and secrets management to per service security options (compute, networking, storage, messaging, etc.)
de: 'Die Sicherheitsanleitung <https://docs.openstack.org/security-guide/>'_ enthält Informationen darüber, wie Sie Ihre Cloud schützen können. Es deckt alles ab, von der Verwaltung von Identitäten und Geheimnissen bis hin zu Sicherheitsoptionen pro Dienst (Computing, Netzwerk, Speicher, Messaging usw.).
id: `The Security Guide <https://docs.openstack.org/security-guide/>`_ memberikan informasi tentang cara menjaga keamanan cloud Anda. Ini mencakup semuanya, mulai dari manajemen identity dan rahasia hingga per opsi keamanan layanan (komputasi, jaringan, penyimpanan, pengiriman pesan, dll.)
ko_kr: `보안 가이드 <https://docs.openstack.org/security-guide/>`_ 는 클라우드를 안전하게 유지하는 방법에 대한 정보를 제공합니다. ID와 비밀 관리부터 서비스 별 보안 옵션 (컴퓨팅, 네트워킹, 스토리지, 메시징 등)에 이르기까지 모든 것을 다룹니다.

source: `The VM Image Guide <https://docs.openstack.org/image-guide/>`_ explains how to 'obtain, create and modify VM images that are compatible with OpenStack.'
de: Der `VM Image Guide <https://docs.openstack.org/image-guide/>`_ zeigt Ihnen, wie Sie Abbilder virtueller Maschinen erhalten, erstellen und ändern, die mit OpenStack kompatibel sind.
id: `The VM Image Guide <https://docs.openstack.org/image-guide/>`_ menjelaskan caranya'obtain, create and modify VM images that are compatible with OpenStack.'
ko_kr: `VM 이미지 가이드 <https://docs.openstack.org/image-guide/>`_ 에서는 'OpenStack과 호환되는 VM 이미지를 얻고, 만들고, 수정하는 방법' 을 설명합니다.

source: Example configurations for various OpenStack services are provided in the `openstack/osops-example-configs repository <https://opendev.org/x/osops-example-configs/src/README.md>`_. Operators can share their configuration files to help others, and review how others setup and tune their configurations.
zh_cn: 各种OpenStack服务的示例配置在 `openstack/osops-example-configs repository <https://opendev.org/x/osops-example-configs/src/README.md>`_ 中提供。运维人员可以共享其配置文件以帮助其他人，并查看其他人如何设置和调整其配置。

source: Operators have used a dedicated mailing list until November 2018. You can read the `openstack.operators archive <http://lists.openstack.org/pipermail/openstack-operators/>`_ which contain plenty of valuable information. Currently there is a `joint mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ for developer and operator to subscribe. More generic information about mailing lists can be found in the Communication page's :ref:`communication-mailing-lists` section.
zh_cn: 在2018年11月之前，运维们使用了专门的邮件列表。您可以阅读包含大量有价值信息的 `openstack.operators 归档 <http://lists.openstack.org/pipermail/openstack-operators/>`_ 。 目前则是供开发和运维订阅的 `联合邮件列表 <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_ 。有关邮件列表的更多通用信息可以在“通信”页面中的 :ref:`communication-mailing-lists` 章节找到.

source: There is the #openstack-operators channel on Freenode IRC for live conversations and `Operators' team meeting <http://eavesdrop.openstack.org/#OpenStack_OSOps_Team>`_. On top of the #openstack-operators channel there are several others. More generic information about IRC channels can be found in the :ref:`irc-channels` section of the IRC page.
zh_cn: Freenode IRC上有 #openstack-operators 频道用于实时对话及运维团队会议 <http://eavesdrop.openstack.org/#OpenStack_OSOps_Team>`_ 。在 #opeststack-operators 频道之上还有其他几个。 有关IRC频道的更多通用信息可以在IRC页面的 :ref:`irc-channels` 章节找到。
