Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: Zuul is a tool written and run by the OpenStack Infrastructure team that is used to manage running continuous infrastructure jobs. It provides projects with a way to define test jobs that will run on each proposed commit. These tests are required to pass in order for any proposed patch to merge.
de: Zuul ist ein vom OpenStack Infrastructure-Team geschriebenes und ausgeführtes Tool, das zur Verwaltung laufender kontinuierlicher Infrastrukturaufträge verwendet wird. Es bietet Projekten die Möglichkeit, Testaufträge zu definieren, die bei jedem vorgeschlagenen Commit ausgeführt werden. Diese Tests müssen bestanden werden, damit jeder vorgeschlagene Patch zusammengeführt werden kann.
id: Zuul adalah alat yang ditulis dan dijalankan oleh tim Infrastruktur OpenStack yang digunakan untuk mengelola pekerjaan infrastruktur berkelanjutan. Ini memberikan proyek dengan cara untuk mendefinisikan pekerjaan pengujian yang akan berjalan pada setiap komit yang diusulkan. Tes ini diperlukan untuk lulus agar patch yang diusulkan untuk bergabung.
ko_kr: Zuul은 실행 중인 지속적인 인프라 작업을 관리하는 데 사용되는 OpenStack Infrastructure 팀이 작성 및 운영하는 툴입니다. 또한 제안된 각 커밋에서 실행할 테스트 작업을 정의할 수 있는 방법을 프로젝트에 제공합니다. 제안된 패치를 병합하려면 이러한 테스트를 통과해야 합니다.

source: [coa] for becoming a Certified OpenStack Administrator
de: [coa] für die Zertifizierung zum Certified OpenStack Administrator
id: [coa] untuk menjadi Certified OpenStack Administrator
ko_kr: [coa] 인증된 OpenStack 관리자가 되었습니다.

source: [first-cfp] for giving your first conference talk
de: [first-cfp] für Ihren ersten Konferenz-Vortrag
id: [first-cfp] untuk memberikan ceramah konferensi pertama Anda
ko_kr: [first-cfp]에서 첫 번째 컨퍼런스 강연을 해 주셔서 감사합니다.

source: [first-cloud] for deploying your first cloud
de: [first-cloud] für die Bereitstellung Ihrer ersten Cloud
id: [first-cloud] untuk menggunakan cloud pertama Anda
ko_kr: [first-cloud] 당신의 첫번째 클라우드 배포에 사용됩니다

source: [first-patch] for getting your first patch merged
de: [first-patch] für die Zusammenführung Ihres ersten Patches
id: [first-patch] untuk mendapatkan patch pertama Anda digabungkan
ko_kr: [first-patch] 첫번째 Patch를 Merge

source: `Code, docs, infrastructure changes, and CI configurations <https://opendev.org/explore/repos>`_
ko_kr: `코드, 문서, 인프라 변경 및 CI 구성 <https://opendev.org/explore/repos>`_ 입니다.

source: `Launchpad <https://launchpad.net/openstack>`_ is the legacy way the OpenStack community does bug tracking since we started `moving towards StoryBoard <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration>`_.
de: `Launchpad <https://launchpad.net/openstack>`_ ist die alte Art und Weise, wie die OpenStack-Community Fehlerverfolgung durchführt, seit wir begonnen haben, uns auf `StoryBoard zu konzentrieren <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration>`_ .
id: `Launchpad <https://launchpad.net/openstack>`_ adalah cara warisan komunitas OpenStack melakukan pelacakan bug sejak kami mulai `moving towards StoryBoard <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration>`_.
ko_kr: `Launchpad <https://launchpad.net/openstack>`_ 은 `StoryBoard <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration>`_ 으로 이동하기 시작한 이래 OpenStack 커뮤니티에서 버그 추적을 하는 기존 방식입니다.

source: `Open Community <https://governance.openstack.org/tc/reference/opens.html#open-community>`_
ko_kr: `누구나 참여 할 수 있는 공동체 <https://governance.openstack.org/tc/reference/opens.html#open-community>`_

source: `Open design <https://governance.openstack.org/tc/reference/opens.html#open-design>`_
ko_kr: `누구에게나 열린 설계 <https://governance.openstack.org/tc/reference/opens.html#open-design>`_

source: `Open development <https://governance.openstack.org/tc/reference/opens.html#open-development>`_
ko_kr: `누구나 참여 할 수 있는 개발 <https://governance.openstack.org/tc/reference/opens.html#open-development>`_

source: `Open source <https://governance.openstack.org/tc/reference/opens.html#open-source>`_
ko_kr: `오픈 소스 <https://governance.openstack.org/tc/reference/opens.html#open-source>`_

source: `OpenStack Days <https://www.openstack.org/community/events/openstackdays>`_ events are similar to the Open Infrastructure Summits that are organized by the local community, users groups and companies.
id: `OpenStack Days <https://www.openstack.org/community/events/openstackdays>`_ acara ini serupa dengan Open Infrastructure Summits yang diselenggarakan oleh komunitas lokal, grup pengguna, dan perusahaan.
ko_kr: `OpenStack Days <https://www.openstack.org/community/events/openstackdays>`_ 이벤트는 지역 커뮤니티, 사용자 그룹 및 기업이 주관하는 Open Infrastructure Summits와 유사합니다.

source: `Specifications <https://specs.openstack.org>`_
de: `Spezifikationen <https://specs.openstack.org>`_
ko_kr: `사양 <https://specs.openstack.org>`_

source: `StoryBoard <https://storyboard.openstack.org>`_ is bug tracking software the OpenStack community is `developing <https://wiki.openstack.org/wiki/StoryBoard>`_, and in the progress of `migrating towards <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration/>`_. Some `projects are already using it <https://storyboard.openstack.org/#!/project/list>`_.
de: `StoryBoard <https://storyboard.openstack.org>`_ ist eine Bug-Tracking-Software, die die OpenStack-Community `entwickelt <https://wiki.openstack.org/wiki/StoryBoard>`_, und im Zuge der Migration zu <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration/>`_. Einige `Projekte nutzen es bereits <https://storyboard.openstack.org/#!/project/list>`_.
id: `StoryBoard <https://storyboard.openstack.org>`_ adalah perangkat lunak pelacak bug komunitas OpenStack `developing <https://wiki.openstack.org/wiki/StoryBoard>`_, dan sedang dalam proses `migrating towards <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration/>`_. Beberapa `projects are already using it <https://storyboard.openstack.org/#!/project/list>`_.
ko_kr: `스토리보드 <https://storyboard.openstack.org>`_ 는 OpenStack 커뮤니티에서 `개발중인 <https://wiki.openstack.org/wiki/StoryBoard>`_ 버그 추적 소프트웨어이며 `마이그레이션 진행 <https://superuser.openstack.org/articles/openstack-gerrit-storyboard-integration/>`_ 중이고, 일부 프로젝트는 이미 `이것 <https://storyboard.openstack.org/#!/project/list>`_ 을 사용하고 있습니다 .

source: `Translations <https://opendev.org/openstack/i18n/>`_
ko_kr: `번역 <https://opendev.org/openstack/i18n/>`_

source: `Ubuntu 16.04 <https://www.microsoft.com/en-us/store/p/ubuntu/9nblggh4msv6>`_
ko_kr: `우분투 16.04 <https://www.microsoft.com/en-us/store/p/ubuntu/9nblggh4msv6>`_

source: `Use cases for features <https://specs.openstack.org/openstack/openstack-user-stories/>`_
de: `Anwendungsfälle für Features <https://specs.openstack.org/openstack/openstack-user-stories/>`_
ko_kr: `유즈케이스 <https://specs.openstack.org/openstack/openstack-user-stories/>`_

source: `Windows Subsystem for Linux (WSL) <https://docs.microsoft.com/en-us/windows/wsl/about>`_ is available in Windows 10 Anniversary Update or later (build 1607+). There is the possibility to install and run modern Linux Operating Systems:
de: `Windows Subsystem für Linux (WSL) <https://docs.microsoft.com/en-us/windows/wsl/about>`_ ist in Windows 10 Anniversary Update oder höher (Build 1607+) verfügbar. Es besteht die Möglichkeit, moderne Linux-Betriebssysteme zu installieren und zu betreiben:
id: `Windows Subsystem for Linux (WSL) <https://docs.microsoft.com/en-us/windows/wsl/about>`_ tersedia di Windows 10 Anniversary Update atau yang lebih baru (build 1607+). Ada kemungkinan untuk menginstal dan menjalankan Sistem Operasi Linux modern:
ko_kr: `WSL(Windows Subsystem for Linux) <https://docs.microsoft.com/en-us/windows/wsl/about>`_ 은 Windows 10 Anniversity Update(빌드 1607+) 이상에서 사용할 수 있습니다. 최신 Linux 운영 체제를 설치하고 실행할 수 있습니다.

source: ``Closes-Bug``: #123456789: use ``Closes-Bug`` if the commit is intended to fully fix and close the bug being referenced. Use the Launchpad ID of the bug for the number; Gerrit automatically creates a link to the bug.
de: ``Closes-Bug``: #123456789: Verwenden Sie ``Closes-Bug``, wenn die Übertragung dazu bestimmt ist, den Fehler, auf den verwiesen wird, vollständig zu beheben und zu schließen. Verwenden Sie die Launchpad-ID des Fehlers für die Nummer; Gerrit erstellt automatisch einen Link zu dem Fehler.
id: ``Closes-Bug``: #123456789: menggunakan ``Closes-Bug`` jika komit dimaksudkan untuk sepenuhnya memperbaiki dan menutup bug yang dirujuk. Gunakan ID Launchpad bug untuk nomor; Gerrit secara otomatis membuat tautan ke bug.
ko_kr: ``Closes-Bug``: #123456789: 이 약속이 참조되고 있는 버그를 완전히 수정하고 닫기 위한 것이라면 ``Closes-Bug`` 를 사용합니다. 버그의 시작 패드 ID를 숫자로 사용합니다. 게리트는 자동으로 버그에 대한 링크를 만듭니다.

source: ``Implements``: Use this footer if the change fully implements a Launchpad blueprint. Use the name of the blueprint as an ID.
id: ``Implements``: Gunakan footer ini jika perubahan tersebut sepenuhnya menerapkan cetak biru Launchpad. Gunakan nama cetak biru sebagai ID.
ko_kr: ``Implements`` : 변경 내용이 Launchpad Blueprint를 완전히 구현한 경우 이 바닥글을 사용합니다. Blueprint 이름을 ID로 사용합니다.

source: ``Partial-Bug``: #123456789: use ``Partial-Bug`` if the commit is only a partial fix and more work is needed. Use the Launchpad ID of the bug for the number; Gerrit automatically creates a link to the bug.
de: ``Partial-Bug``: #123456789: Verwenden Sie ``Partial-Bug``, wenn die Übertragung nur eine teilweise Korrektur ist und mehr Arbeit erforderlich ist. Verwenden Sie die Launchpad-ID des Fehlers für die Nummer; Gerrit erstellt automatisch einen Link zu dem Fehler.
id: ``Partial-Bug``: #123456789: menggunakan ``Partial-Bug`` jika komit hanya memperbaiki sebagian dan lebih banyak pekerjaan diperlukan. Gunakan ID Launchpad bug untuk nomor; Gerrit secara otomatis membuat tautan ke bug.
ko_kr: ``Partial-Bug``:#123456789: 커밋이 부분 수정일 뿐이고 더 많은 작업이 필요한 경우 ``Partial-Bug`` 를 사용합니다. 버그의 시작 패드 ID를 숫자로 사용합니다. 게리트는 자동으로 버그에 대한 링크를 만듭니다.

source: ``Partial-Implements``: Use this footer if the change partially implements a Launchpad blueprint. Use the name of the blueprint as an ID.
id: ``Partial-Implements``: Gunakan footer ini jika perubahan menerapkan sebagian cetak biru Launchpad. Gunakan nama cetak biru sebagai ID.
ko_kr: ``Partial-Implements`` : 변경 사항으로 인해 Launchpad Blueprint가 부분적으로 구현되는 경우 이 바닥글을 사용합니다. Blueprint 이름을 ID로 사용합니다.

source: ``Related-Bug``: #12456789: use 'Related-Bug' if the commit is merely related to the referenced bug. Use the Launchpad ID of the bug for the number; Gerrit automatically creates a link to the bug.
de: ``Related-Bug``: #12456789: Verwenden Sie 'Related-Bug', wenn die Übertragung nur mit dem referenzierten Fehler zusammenhängt. Verwenden Sie die Launchpad-ID des Fehlers für die Nummer; Gerrit erstellt automatisch einen Link zu dem Fehler.
id: ``Related-Bug``: #12456789: menggunakan 'Related-Bug' jika komit hanya terkait dengan bug yang dirujuk. Gunakan ID Launchpad bug untuk nomor; Gerrit secara otomatis membuat tautan ke bug.
ko_kr: ``Related-Bug``:#12456789: 커밋이 참조 버그와 관련된 것일 경우 'Related-Bug'를 사용합니다. 버그의 시작 패드 ID를 숫자로 사용합니다. 게리트는 자동으로 버그에 대한 링크를 만듭니다.

source: ``Story``: 1234567: the number of the story in Storyboard to which the task being implemented belongs. This will post a comment on the story with a link to your patch.
id: ``Story``: 1234567: jumlah cerita di Storyboard yang menjadi tugas tugasnya. Ini akan memposting komentar pada cerita dengan tautan ke patch Anda.
ko_kr: ``Story``: 1234567: 실행 중인 과제가 속하는 스토리보드의 이야기 개수입니다. 패치에 대한 링크와 함께 스토리에 대한 설명을 게시합니다.

source: ``Task``: 1234: the number of the task in Storyboard implemented by the change. This will auto update the task to 'Review' status and assign it to you when you push the patch.
id: ``Task``: 1234: jumlah tugas di Storyboard yang diterapkan oleh perubahan. Ini akan secara otomatis memperbarui tugas ke status 'Review' dan memberikannya kepada Anda ketika Anda mendorong patch.
ko_kr: ``Task``: 1234: 변경에 의해 구현된 스토리보드의 작업 개수입니다. 이렇게 하면 작업이 자동으로 '검토' 상태로 업데이트되고 패치를 푸시할 때 사용자에게 할당됩니다.

source: a set of collaboration tools, like a wiki, IRC chanels, Etherpad and Ethercalc.
de: eine Reihe von Kollaborationswerkzeugen, wie z.B. ein Wiki, IRC-Kanäle, Etherpad und Ethercalc.
id: seperangkat alat kolaborasi, seperti wiki, saluran IRC, Etherpad dan Ethercalc.
ko_kr: Wiki, IRC chanels, Etherpad, Ethercalcalc 등 일련의 협업 도구를 제공합니다.

source: to any OpenStack IRC channel where the Statusbot is listening. The message will be posted to the `Successes wiki page <https://wiki.openstack.org/wiki/Successes>`__.
de: an jeden OpenStack-IRC-Kanal, auf dem der Statusbot lauscht. Die Nachricht wird auf der `Successes Wiki-Seite <https://wiki.openstack.org/wiki/Successes>`__ veröffentlicht.
id: ke saluran IRC OpenStack mana pun tempat Statusbot mendengarkan. Pesan tersebut akan diposting ke `Successes wiki page <https://wiki.openstack.org/wiki/Successes>` __.
ko_kr: Statusbot이 수신 중인 OpenStack IRC 채널로 이동합니다. 이 메시지는 `Success 위키 페이지 <https://wiki.openstack.org/wiki/Successes>`_ 에 게시됩니다.

source: A message dialog window will come up. Type the following to register your nick name with nickserv replacing **mysecretpassword** and **test@domain.com** with your own password and email address::
de: Es erscheint ein Meldungsdialogfenster. Geben Sie Folgendes ein, um Ihren Nicknamen bei nickserv zu registrieren und **mysecretpassword** und **test@domain.com** durch Ihr eigenes Passwort und Ihre eigene E-Mail-Adresse zu ersetzen::
id: Jendela dialog pesan akan muncul. Ketikkan yang berikut untuk mendaftarkan nama samaran Anda dengan nickserv yang menggantikan **mysecretpassword** dan **test@domain.com** dengan kata sandi dan alamat email Anda sendiri ::

source: Add A New Connection
de: Eine neue Verbindung hinzufügen
id: Tambahkan Koneksi Baru

source: Auto-Login On Connecting To Freenode
de: Auto-Login bei der Verbindung mit Freenode
id: Login Otomatis Saat Menghubungkan Ke Freenode

source: Click **Hexchat** from the menu and then click **Network List**. You will see a familiar first screen of servers listed. Make sure Freenode is highlighted and click **edit**.
de: Klicken Sie auf **Hexchat** aus dem Menü und dann auf **Netzwerkliste**. Sie sehen einen vertrauten ersten Bildschirm mit den aufgelisteten Servern. Stellen Sie sicher, dass Freenode markiert ist und klicken Sie auf **bearbeiten**.
id: Klik **Hexchat** dari menu dan kemudian klik **Network List**. Anda akan melihat layar pertama dari server yang dikenal. Pastikan Freenode disorot dan klik **edit**.

source: Click **cancel**.
de: Klicken Sie auf **Abbrechen**.
id: Klik **cancel**.

source: Click **disconnect** and click **connect** to retry connecting with the new nick name.
de: Klicken Sie auf **trennen** und klicken Sie auf **verbinden**, um die Verbindung mit dem neuen Nicknamen erneut zu versuchen.
id: Klik **disconnect** dan klik **connect** untuk mencoba lagi menghubungkan dengan nama panggilan baru.

source: Click the **info** icon.
de: Klicken Sie auf das Symbol **Info**.
id: Klik ikon **info**.

source: Click the **message user** icon and type::
de: Klicken Sie auf das Symbol **Nachricht Benutzer** und geben Sie ein::
id: Klik ikon **message user** dan ketik ::

source: Congratulations you're now ready to communicate with the OpenStack community and have a registered nick name on Freenode! From here on out when you connect to Freenode with Colloquy you will be identified with your nickname.
de: Herzlichen Glückwunsch, dass Sie jetzt bereit sind, mit der OpenStack-Community zu kommunizieren und einen registrierten Spitznamen auf Freenode haben! Von nun an, wenn Sie sich mit Freenode mit Colloquy verbinden, werden Sie mit Ihrem Spitznamen identifiziert.
id: Selamat Anda sekarang siap untuk berkomunikasi dengan komunitas OpenStack dan memiliki nama panggilan terdaftar di Freenode! Mulai saat ini ketika Anda terhubung ke Freenode dengan Colloquy, Anda akan diidentifikasi dengan nama panggilan Anda.

source: Congratulations you're now ready to communicate with the OpenStack community and have a registered nick name on Freenode! From here on out when you connect to Freenode with Hexchat you will be identified with your nickname.
de: Herzlichen Glückwunsch, dass Sie jetzt bereit sind, mit der OpenStack-Community zu kommunizieren und einen registrierten Spitznamen auf Freenode haben! Von nun an, wenn Sie sich mit Hexchat mit Freenode verbindest, werden Sie mit Ihrem Spitznamen identifiziert.
id: Selamat Anda sekarang siap untuk berkomunikasi dengan komunitas OpenStack dan memiliki nama panggilan terdaftar di Freenode! Mulai saat ini hingga keluar saat Anda terhubung ke Freenode dengan Hexchat Anda akan diidentifikasi dengan nama panggilan Anda.

source: First fill out the **Nickname** and **User name** field with your choice of a nickname.
de: Füllen Sie zunächst das Feld **Spitzname** und **Benutzername** mit einem Spitznamen Ihrer Wahl aus.
id: Pertama, isi bidang **Nickname** dan **User name** dengan nama panggilan Anda.

source: For registration and login you need an :doc:`Open Infrastructure Foundation Account <accounts>`. Click on *LogIn* on `translate.openstack.org <https://translate.openstack.org/>`_ and follow the process for applying your Zanata profile.
id: Untuk registrasi dan login Anda memerlukan :doc:`Open Infrastructure Foundation Account <accounts>`. Klik *LogIn* di `translate.openstack.org <https://translate.openstack.org/>` _ dan ikuti proses untuk menerapkan profil Zanata Anda.

source: For the **Chat Server Port** type in **6697** and check the **SSL Connection** box.
de: Für den **Chat Server Port** geben Sie **6697** ein und aktivieren Sie das Kontrollkästchen **SSL Connection**.
id: Untuk **Chat Server Port** ketikkan **6697** dan centang kotak **SSL Connection**.

source: For the **Chat server** type in **irc.freenode.net**.
de: Für den **Chat-Server** geben Sie **irc.freenode.net** ein.
id: Untuk **Chat server**, ketikkan **irc.freenode.net**.

source: From the list of **Networks** you should see Freenode. Select that and click 'edit'.
de: Aus der Liste der **Netzwerke** sollten Sie Freenode sehen. Wählen Sie das aus und klicken Sie auf "Bearbeiten".
id: Dari daftar **Networks** Anda akan melihat Freenode. Pilih itu dan klik 'edit'.

source: From your downloads folder, drag the Colloquy application icon to your applications folder to install.
de: Ziehen Sie aus Ihrem Download-Ordner das Colloquy-Anwendungssymbol in Ihren Anwendungsordner, um es zu installieren.
id: Dari folder unduhan Anda, seret ikon aplikasi Colloquy ke folder aplikasi Anda untuk menginstal.

source: Get marketing from the Open Infrastructure Foundation
id: Dapatkan pemasaran dari Open Infrastructure Foundation

source: Go to http://colloquy.info and follow the download link.
de: Gehen Sie auf http://colloquy.info und folgen Sie dem Download-Link.
id: Buka http://colloquy.info dan ikuti tautan unduhan.

source: Going back to your connection window, highlight your Freenode connection and click the **info** icon.
de: Gehen Sie zurück zu Ihrem Verbindungsfenster, markieren Sie Ihre Freenode-Verbindung und klicken Sie auf das Symbol **info**.
id: Kembali ke jendela koneksi Anda, sorot koneksi Freenode Anda dan klik ikon **info**.

source: If all goes well in the second window you will see your new connection and your client connected.
de: Wenn im zweiten Fenster alles gut läuft, sehen Sie Ihre neue Verbindung und Ihren Client verbunden.
id: Jika semuanya berjalan dengan baik di jendela kedua Anda akan melihat koneksi baru Anda dan klien Anda terhubung.

source: If all goes well you should be connected and not get any pop ups as indicated in the previous step's Troubleshooting section.
de: Wenn alles gut geht, sollten Sie verbunden sein und keine Pop-ups erhalten, wie im Abschnitt Fehlersuche im vorherigen Schritt beschrieben.
id: Jika semuanya berjalan dengan baik, Anda harus terhubung dan tidak mendapatkan sembulan (pop up) seperti yang ditunjukkan pada bagian Troubleshooting langkah sebelumnya.

source: If all goes well you will get a dialog window indicating the connection to Freenode has completed, and what to do next. For now, select "Nothing, I'll join a channel later."
de: Wenn alles gut geht, erhalten Sie ein Dialogfenster, das anzeigt, dass die Verbindung zu Freenode abgeschlossen ist und was als nächstes zu tun ist. Wählen Sie zunächst "Nichts, ich werde später einem Kanal beitreten."
id: Jika semuanya berjalan dengan baik, Anda akan mendapatkan jendela dialog yang menunjukkan koneksi ke Freenode telah selesai, dan apa yang harus dilakukan selanjutnya. Untuk saat ini, pilih "Nothing, I'll join a channel later."

source: If you get a notice that the nick name is already taken:
de: Wenn Sie eine Nachricht bekommen, dass der Spitzname bereits vergeben ist:
id: Jika Anda mendapat pemberitahuan bahwa nama samaran sudah diambil:

source: In order to identify yourselves that you own the nick name upon logging in, you need to tell Colloquy to communicate your password upon connecting.
de: Um sich zu identifizieren, dass Sie den Nicknamen beim Einloggen besitzen, müssen Sie Colloquy sagen, dass Sie Ihr Passwort beim Verbinden mitteilen sollen.
id: Untuk mengidentifikasi diri Anda bahwa Anda memiliki nama panggilan saat masuk, Anda harus memberi tahu Colloquy untuk mengomunikasikan kata sandi Anda saat menyambungkan.

source: In order to register you need to send a message to nickserv on Freenode, which is a bot that allows you to register and identify yourselves as the owner of a nick name.
de: Um sich zu registrieren, müssen Sie eine Nachricht an nickserv auf Freenode senden, einem Bot, der es Ihnen ermöglicht, sich zu registrieren und sich als Besitzer eines Nicknames zu identifizieren.
id: Untuk mendaftar, Anda perlu mengirim pesan ke nickserv di Freenode, yang merupakan bot yang memungkinkan Anda untuk mendaftar dan mengidentifikasi diri Anda sebagai pemilik nama panggilan.

source: In the **Password** field type your password.
de: Geben Sie im Feld **Passwort** Ihr Passwort ein.
id: Di bidang **Password** ketikkan kata sandi Anda.

source: Someone of authority needs to sign the `U.S. Government Contributor License Agreement <https://wiki.openstack.org/wiki/GovernmentCLA>`_. Contact the `Open Infrastructure Foundation <mailto:communitymngr@openstack.org>`_ to initiate this process.
id: Seseorang yang berwenang perlu menandatangani `U.S. Government Contributor License Agreement <https://wiki.openstack.org/wiki/GovernmentCLA>`_. Contact the `Open Infrastructure Foundation <mailto:communitymngr@openstack.org>`_ untuk memulai proses ini.

source: The Open Infrastructure Foundation is a non-profit "whose purpose is to develop, support, protect, and promote" OpenStack. It has a set of `bylaws <https://www.openstack.org/legal/bylaws-of-the-openstack-foundation/>`_ and a board of directors. The Foundation has three types of members, defined by the bylaws. Each of the types -- Platinum, Gold and Individual -- are represented on a Board of Directors. The maximum numbers of members of each type are eight, twenty four, and unlimited, respectively.
id: Open Infrastructure Foundation adalah organisasi nirlaba "yang bertujuan untuk mengembangkan, mendukung, melindungi, dan mempromosikan" OpenStack. Ini memiliki seperangkat `peraturan <https://www.openstack.org/legal/bylaws-of-the-openstack-foundation/>` _ dan dewan direksi. Yayasan memiliki tiga jenis anggota, yang ditentukan oleh Anggaran Rumah Tangga. Masing-masing jenis - Platinum, Gold dan Individual - diwakili di Dewan Direksi. Jumlah maksimal anggota setiap jenis adalah delapan, dua puluh empat, dan tidak terbatas, masing-masing.
