Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: This is the view of the Zanata workspace. On the left side you have the original text string, while you can enter the translation on the right.
de: Dies ist die Ansicht des Zanata-Arbeitsbereichs. Auf der linken Seite haben Sie die Originaltextzeichenfolge, während Sie die Übersetzung auf der rechten Seite eingeben können.
id: Ini adalah pemandangan ruang kerja Zanata. Di sisi kiri Anda memiliki string teks asli, sementara Anda dapat memasukkan terjemahan di sebelah kanan.
ko_kr: 이것은 Zanata 작업 공간의 모습입니다. 왼쪽에는 원래 텍스트 문자열이 있고 오른쪽에는 변환을 입력할 수 있습니다.

source: This section allows you to:
de: In diesem Abschnitt können Sie:
id: Bagian ini memungkinkan Anda untuk:
ko_kr: 이 섹션에서는 다음을 수행할 수 있습니다.

source: This section assumes you have completed :doc:`/code-and-documentation/using-gerrit`.
de: Dieser Abschnitt geht davon aus, dass Sie :doc:`/code-and-documentation/using-gerrit` abgeschlossen haben.
id: Bagian ini menganggap Anda telah menyelesaikan :doc:`/code-and-documentation/using-gerrit`.
ko_kr: 이 섹션에서는 :doc:`/code-and-documentation/using-gerrit` 을 완료했다고 가정합니다.

source: This section assumes you have completed :doc:`accounts` guide.
de: In diesem Abschnitt wird davon ausgegangen, dass Sie die Anleitung :doc:`accounts` abgeschlossen haben.
id: Bagian ini mengasumsikan Anda telah menyelesaikan panduan :doc:`accounts`.
ko_kr: 이 섹션에서는 :doc:`accounts` guide를 완료했다고 가정합니다.

source: This section assumes you have completed :doc:`git` guide.
de: In diesem Abschnitt wird davon ausgegangen, dass Sie die Anleitung :doc:`git` abgeschlossen haben.
id: Bagian ini menganggap Anda telah menyelesaikan :doc:`git` guide.
ko_kr: 이 섹션에서는 :doc:`git` 가이드를 완료했다고 가정합니다.

source: This section assumes you have completed the :doc: '/common/irc' section of the contributor guide. It might also be helpful to cover the more generic information about mailing lists in the Communication page's :ref:`communication-mailing-lists` section as well.
de: Dieser Abschnitt geht davon aus, dass Sie den Abschnitt :doc: '/common/irc' des Contributor Guide abgeschlossen haben. Es könnte auch hilfreich sein, die allgemeineren Informationen über Mailinglisten auch im Abschnitt :ref:`communication-mailing-lists` der Kommunikationsseite zu behandeln.
id: Bagian ini menganggap Anda telah menyelesaikan bagian :doc: '/common/irc' dari panduan kontributor. Mungkin juga bermanfaat untuk mencakup informasi yang lebih umum tentang milis di bagian Communication page's :ref:`communication-mailing-lists` juga.
ko_kr: 이 섹션에서는 기여자 가이드의 :doc: '/common/irc' 섹션을 완료했다고 가정합니다. 또한 통신 페이지의 :ref:`communication-mailing-lists` 섹션에서 메일 목록에 대한 보다 일반적인 정보를 다루는 것도 도움이 될 수 있습니다.

source: This section explains how you can install an IRC program called Hexchat.
de: Dieser Abschnitt erklärt, wie Sie ein IRC-Programm namens Hexchat installieren können.
id: Bagian ini menjelaskan bagaimana Anda dapat menginstal program IRC yang disebut Hexchat.
ko_kr: 이 섹션에서는 Hexchat이라는 IRC 프로그램을 설치하는 방법에 대해 설명합니다.

source: This section provides information on Storyboard and Launchpad task trackers. You can learn about Storyboard stories and tasks, boards and worklists, and Launchpad blueprints and bugs.
de: Dieser Abschnitt enthält Informationen über Storyboard und Launchpad-Task-Tracker. Sie können mehr über Storyboard-Geschichten und -Aufgaben, Boards und Arbeitslisten sowie Launchpad-Blaupausen und -Fehler erfahren.
id: Bagian ini memberikan informasi tentang pelacak tugas Storyboard dan Launchpad. Anda dapat belajar tentang cerita dan tugas Storyboard, papan dan daftar kerja, dan cetak biru Launchpad dan bug.
ko_kr: 이 섹션에서는 스토리보드 및 실행패드 작업 추적기에 대한 정보를 제공합니다. 스토리보드 스토리와 작업, 보드 및 작업 목록, Launchpad Blueprint 및 버그에 대해 배울 수 있습니다.

source: This sections allows you to:
de: In diesem Abschnitt können Sie Folgendes tun:
id: Bagian ini memungkinkan Anda untuk:
ko_kr: 이 섹션에서는 다음을 수행할 수 있습니다.

source: This will show you the status on all jobs running in zuul currently. You can expand jobs running on any patch by clicking on the box for a patch.
de: Dies zeigt Ihnen den Status aller Aufträge, die derzeit in zuul laufen. Sie können Aufträge, die auf jedem Patch ausgeführt werden, erweitern, indem Sie auf das Kästchen für einen Patch klicken.
id: Ini akan menunjukkan status pada semua pekerjaan yang berjalan di zuul saat ini. Anda dapat memperluas pekerjaan yang berjalan di sembarang patch dengan mengeklik kotak untuk patch.
ko_kr: 현재 zuul에서 실행 중인 모든 작업의 상태가 표시됩니다. 패치 상자를 클릭하여 패치에서 실행 중인 작업을 확장할 수 있습니다.

source: Time frame
ko_kr: 시간프레임

source: To find your specific patch in zuul you can use the search bar and search for the patch number. This will then filter what is displayed to just that patch:
de: Um Ihren spezifischen Patch in zuul zu finden, können Sie die Suchleiste verwenden und nach der Patch-Nummer suchen. Dies filtert dann, was genau zu diesem Patch angezeigt wird:
id: Untuk menemukan patch spesifik Anda di zuul, Anda dapat menggunakan bilah pencarian dan mencari nomor patch. Ini kemudian akan memfilter apa yang ditampilkan ke patch itu:
ko_kr: zuul에서 특정 패치를 찾으려면 검색줄을 사용하여 패치 번호를 검색할 수 있습니다. 그러면 해당 패치에만 표시되는 내용이 필터링됩니다.

source: To get to the details of reporting the bug you fill in the summary line and click 'next'.
de: Um zu den Details der Fehlermeldung zu gelangen, füllen Sie die Übersichtszeile aus und klicken Sie auf "Weiter".
id: Untuk mendapatkan detail pelaporan bug Anda mengisi baris ringkasan dan klik 'berikutnya'.
ko_kr: 버그 보고에 대한 자세한 내용을 보려면 요약 줄을 입력하고 '다음'을 클릭합니다.

source: To produce a ubiquitous Open Source Cloud Computing platform that **is** easy to use, simple to implement, interoperable between deployments, works well at **all** scales, **and** meets the needs of users and operators of both public **and** private clouds.
de: Eine allgegenwärtige Open Source Cloud Computing-Plattform zu schaffen, die einfach zu bedienen, einfach zu implementieren, interoperabel zwischen den Implementierungen **ist**, gut funktioniert auf **allen** Skalen, **und** die Bedürfnisse von Nutzern und Betreibern sowohl von öffentlichen **und** privaten Clouds erfüllt.
id: Untuk menghasilkan platform Cloud Computing Open Source di mana-mana (ubiquitous) yang **is** mudah digunakan, mudah diterapkan, dapat dioperasikan antar penyebaran (deployment), bekerja dengan baik di **all** skala, **and** memenuhi kebutuhan pengguna dan operator dari baik awan publik **and** privat.
ko_kr: 사용하기 쉽고, 구현이 간편하며, 배포 간 상호 운용성이 뛰어나고, 모든 규모에서 잘 작동하며, 퍼블릭 클라우드와 프라이빗 클라우드의 사용자와 운영자의 요구를 모두 충족하는 유비쿼터스 오픈 소스 클라우드 컴퓨팅 플랫폼을 생산합니다.

source: To propose a project to be an official OpenStack project the project's information should be added to the *reference/projects.yaml* file of the *openstack/governance* repository. Anyone can propose changes to the file.
de: Um ein Projekt als offizielles OpenStack-Projekt vorzuschlagen, sollten die Projektinformationen in die Datei *reference/projects.yaml* des Repositorys *openstack/governance* aufgenommen werden. Jeder kann Änderungen an der Datei vorschlagen.
id: Untuk mengusulkan proyek menjadi proyek OpenStack resmi, informasi proyek harus ditambahkan ke file *reference/projects.yaml* dari repositori *openstack/governance*. Siapa pun dapat mengajukan perubahan pada file.
ko_kr: 프로젝트를 공식 OpenStack 프로젝트로 제안하려면 프로젝트 정보를 *openstack/governance* 저장소의 *reference/projects.yaml* 파일에 추가해야 합니다. 모든 사용자가 파일의 변경사항을 제안할 수 있습니다.

source: Track progress on bugs and new features
de: Verfolgen Sie den Fortschritt von Bugs und neuen Funktionen
id: Lacak kemajuan bug dan fitur baru
ko_kr: 버그 및 새 기능에 대한 진행률 추적

source: Tracking Changes in Zuul status page
de: Verfolgung von Änderungen auf der Zuul-Statusseite
id: Melacak Perubahan di halaman status Zuul
ko_kr: Zuul 상태 페이지의 변경 사항을 추적합니다.

source: Translation Platform
de: Übersetzungsplattform
id: Platform Terjemahan
ko_kr: 번역 플랫폼

source: Troubleshooting
de: Fehlerbehebung
id: Penyelesaian masalah
ko_kr: 트러블슈팅

source: Typically public key filenames will look like:
de: Normalerweise sehen öffentliche Schlüsseldateinamen so aus:
id: Biasanya nama file kunci publik akan terlihat seperti:
ko_kr: 일반적으로 공용 키 파일 이름은 다음과 같습니다.

source: Understand the differences between the different in-person OpenStack events
de: Verstehen Sie die Unterschiede zwischen den verschiedenen persönlichen OpenStack-Ereignissen
id: Pahami perbedaan antara berbagai acara OpenStack secara langsung
ko_kr: 다양한 실제 OpenStack 이벤트 간의 차이를 이해합니다.

source: Understand the different release models that OpenStack components follow
de: Verstehen Sie die verschiedenen Release-Modelle, denen OpenStack-Komponenten folgen
id: Memahami berbagai model rilis yang diikuti oleh komponen OpenStack
ko_kr: OpenStack 구성 요소가 따르는 다양한 릴리스 모델을 이해합니다.

source: Understand the different tools OpenStack uses for task management
de: Verstehen Sie die verschiedenen Tools, die OpenStack für die Aufgabenverwaltung verwendet
id: Memahami berbagai alat yang digunakan OpenStack untuk manajemen tugas
ko_kr: OpenStack이 작업 관리를 위해 사용하는 다양한 툴을 이해합니다.

source: Understand the governance model of OpenStack
de: Verstehen Sie das Governance-Modell von OpenStack
id: Memahami model tata kelola OpenStack
ko_kr: OpenStack의 거버넌스 모델을 이해합니다.

source: Understand the underlying infrastructure and gating processes that OpenStack uses
de: Verstehen der zugrunde liegenden Infrastruktur und der Gating-Prozesse, die OpenStack verwendet
id: Memahami infrastruktur dasar dan proses gating yang digunakan OpenStack
ko_kr: OpenStack이 사용하는 기본 인프라 및 게이트 프로세스를 이해합니다.

source: Unmaintained
ko_kr: 관리되지 않음

source: Use the same email address that was used during the account setup.
de: Verwenden Sie die gleiche E-Mail-Adresse, die bei der Einrichtung des Kontos verwendet wurde.
id: Gunakan alamat email yang sama yang digunakan selama pengaturan akun.
ko_kr: 계정 설정 중에 사용된 것과 동일한 전자 메일 주소를 사용합니다.

source: User Committee
id: Komite Pengguna
ko_kr: 사용자 위원회

source: Version control
de: Versionskontrolle
id: Version control (kontrol versi)
ko_kr: 형상관리

source: Visit `OpenStack's Gerrit page <https://review.opendev.org>`_ and click the **sign in** link.
id: Kunjungi halaman Gerrit `OpenStack <https://review.opendev.org>` _ dan klik tautan **sign in**
ko_kr: `OpenStack's Gerrit 페이지 방문 <https://review.opendev.org>`_ 하고 **sign in** 링크를 클릭하세요

source: Vote in elections.
de: Stimmen Sie bei Wahlen ab.
id: Memilih dalam pemilihan.
ko_kr: 선거에서 투표.

source: Vote on presentations at OpenStack conferences.
de: Stimmen Sie über Präsentationen auf OpenStack-Konferenzen ab.
id: Pilih presentasi di konferensi OpenStack.
ko_kr: OpenStack 컨퍼런스에서 발표 투표.

source: We use `Zanata <http://zanata.org/>`_ as the platform for translating strings in software projects and documentation. Zanata provides web user interfaces: you only need a web browser to start your translation contribution. Our translation platform is reachable on `translate.openstack.org <https://translate.openstack.org/>`_
de: Wir verwenden `Zanata <http://zanata.org/>`_ als Plattform für die Übersetzung von Zeichenketten in Softwareprojekten und Dokumentationen. Zanata bietet Web-Benutzeroberflächen: Sie benötigen nur einen Webbrowser, um Ihren Übersetzungsbeitrag zu starten. Unsere Übersetzungsplattform ist erreichbar unter `translate.openstack.org <https://translate.openstack.org/>`_
id: Kami menggunakan `Zanata <http://zanata.org/>` _ sebagai platform untuk menerjemahkan string dalam proyek dan dokumentasi perangkat lunak. Zanata menyediakan antarmuka pengguna web: Anda hanya perlu browser web untuk memulai kontribusi terjemahan Anda. Platform terjemahan kami dapat dijangkau pada`translate.openstack.org <https://translate.openstack.org/>`_
ko_kr: 소프트웨어 프로젝트 및 문서화에서 문자열을 변환하는 플랫폼으로 `Zanata <http://zanata.org/>`_ 을 사용하고 있습니다. Zanata는 웹 사용자 인터페이스를 제공합니다. 번역 기여를 시작하려면 웹 브라우저만 필요합니다. 저희의 번역 플랫폼은 `translate.openstack.org <https://translate.openstack.org/>`_ 에서 접속이 가능합니다.

source: What Task Trackers does OpenStack use?
de: Welche Task-Tracker verwendet OpenStack?
id: Task Trackers apa yang digunakan OpenStack?
ko_kr: OpenStack에서 사용하는 작업 추적기는 무엇입니까?

source: What are they?
de: Was ist das?
id: Apakah mereka?
ko_kr: 이것은

source: What is Gerrit?
de: Was ist Gerrit?
id: Apa itu Gerrit?
ko_kr: Gerrit 이란?

source: What is Git?
de: Was ist Git?
id: Apa itu Git?
ko_kr: GIT이란 무엇인가

source: What is IRC?
de: Was ist IRC?
id: Apa itu IRC?
ko_kr: IRC란 무엇입니까?

source: What is Launchpad?
de: Was ist Launchpad?
id: Apa itu Launchpad?
ko_kr: Launchpad란 무엇입니까?

source: What is OpenStack?
de: Was ist OpenStack?
id: Apa itu OpenStack?
ko_kr: OpenStack이란 무엇입니까?

source: What is StoryBoard?
de: Was ist StoryBoard?
id: Apa itu StoryBoard?
ko_kr: StoryBoard란 무엇인가?

source: What is Zuul
de: Was ist Zuul
id: Apa itu Zuul?
ko_kr: Zuul이란

source: What is a contribution?
de: Was ist ein Beitrag?
id: Apa itu sumbangan (contribution) ?
ko_kr: 공헌이란?

source: What is it?
de: Was ist es?
id: Apa itu?
ko_kr: 이것은

source: When sending emails to the ML, if your subject is specific to one cohort, please use the relevant tag:
de: Wenn Sie E-Mails an die ML senden und Ihr Betreff für eine Kohorte spezifisch ist, verwenden Sie bitte das entsprechende Tag:
id: Saat mengirim email ke ML, jika subjek Anda dikhususkan untuk satu kohort, silakan gunakan tag yang relevan:
ko_kr: 전자 메일을 ML로 보낼 때 환자가 하나의 코호트에만 해당되는 경우 관련 태그를 사용해야 합니다.

source: When you have changes in an OpenStack project repository, you can use this sub-command to have the changes posted to `Gerrit <https://review.opendev.org/>`__ so that they can be reviewed.
id: Ketika Anda memiliki perubahan dalam repositori proyek OpenStack, Anda dapat menggunakan sub-perintah ini untuk membuat perubahan diposting ke `Gerrit <https://review.opendev.org/>` __ sehingga mereka dapat ditinjau.
ko_kr: OpenStack 프로젝트 저장소에 변경 사항이 있는 경우 이 하위 명령을 사용하여 변경 내용을 `Gerrit <https://review.opendev.org/>`_ 에 게시하여 검토할 수 있습니다.

source: When you login to the server for the first time with your nickname, it will be used by you, but it's still not registered yet.
de: Wenn Sie sich zum ersten Mal mit Ihrem Nicknamen am Server anmelden, wird er von Ihnen verwendet, ist aber noch nicht registriert.
id: Saat Anda masuk ke server untuk pertama kalinya dengan nama panggilan Anda, itu akan digunakan oleh Anda, tetapi masih belum terdaftar.
ko_kr: 닉네임을 사용하여 서버에 처음 로그인하면, 서버에서 사용되지만 아직 등록되지 않았습니다.

source: When you push a patch to gerrit zuul will automatically trigger jobs to verify the patch functions properly.
de: Wenn Sie einen Patch zu gerrit schieben, löst Zuul automatisch Aufträge aus, um die korrekte Funktion des Patches zu überprüfen.
id: Ketika Anda mendorong patch ke gerrit, zuul akan secara otomatis memicu pekerjaan untuk memverifikasi fungsi patch dengan benar.
ko_kr: 패치를 gerrit zuul에 푸시하면 패치 기능을 제대로 확인하는 작업이 자동으로 트리거됩니다.

source: When you're prompted to "Enter a file in which to save the key" press Enter. This accepts the default location::
de: Wenn Sie aufgefordert werden, "eine Datei einzugeben, in der Sie die Taste speichern möchten", drücken Sie die Eingabetaste. Dies akzeptiert den Standardspeicherort::
id: Saat Anda diminta untuk "Enter a file in which to save the key" tekan Enter. Ini menerima lokasi default ::
ko_kr: 키를 저장할 파일을 입력하라는 메시지가 표시되면 Enter 키를 누릅니다. 기본 위치는 다음과 같습니다.

source: When you're prompted to "Enter a file in which to save the key" you must specify the name of the new key pair and then press Enter::
de: Wenn Sie aufgefordert werden, "Eine Datei einzugeben, in der der Schlüssel gespeichert werden soll", müssen Sie den Namen des neuen Schlüsselpaares angeben und dann die Eingabetaste drücken:
id: Saat Anda diminta untuk "Enter a file in which to save the key" Anda harus menentukan nama pasangan kunci baru dan kemudian tekan Enter ::
ko_kr: 키를 저장할 파일을 입력하라는 메시지가 표시되면 새 키 쌍의 이름을 지정한 다음 Enter 키를 눌러야 합니다.

source: While there are community members maintaining it.
id: Sementara ada anggota masyarakat yang memeliharanya.
ko_kr: 커뮤니티 구성원들이 유지하는 동안입니다

source: While working with OpenStack, IRC is the best way to get real time help or support others. Details of how to get on IRC, channel lists, how meetings are run, where to find logs, and our IRC bots are described in :ref:`setup-irc`.
id: Saat bekerja dengan OpenStack, IRC adalah cara terbaik untuk mendapatkan bantuan waktu nyata atau mendukung orang lain. Detail tentang cara mendapatkan IRC, daftar saluran, bagaimana rapat dijalankan, di mana menemukan log, dan bot IRC kami dijelaskan dalam :ref:`setup-irc`.
ko_kr: OpenStack과 함께 작업하는 동안 IRC는 실시간으로 도움을 받거나 다른 사용자를 지원할 수 있는 가장 좋은 방법입니다. IRC에 접속하는 방법, 채널 목록, 회의 실행 방법, 로그 찾기 위치 및 IRC 봇에 대한 자세한 내용은 :ref:`setup-irc` 에 설명되어 있습니다.

source: Why do changes go first in the check queue?
id: Mengapa perubahan dilakukan pertama kali dalam antrian cek?
ko_kr: 체크 대기열에서 변경사항이 먼저 발생하는 이유는 무엇입니까?

source: Wiki Pages
de: Wiki-Seiten
id: Halaman Wiki
ko_kr: 위키 페이지

source: Windows
ko_kr: 윈도우즈

source: Work on the fix is in progress, bug has an assignee
de: Die Arbeit an der Lösung ist im Gange, der Fehler hat einen Empfänger
id: Pengerjaan perbaikan sedang berlangsung, bug memiliki penerima hak
ko_kr: 수정 작업이 진행 중입니다. 버그에 할당자가 있습니다.

source: Worklists and boards are different ways of organizing work. It is up to the project team how stories are organized. They could be sorted by milestone. A lane could have all the bugs or all the new features. It depends on the teams way of organizing and coordinating work. Order of stories in a worklist could convey priority as well.
de: Arbeitslisten und Boards sind verschiedene Formen der Arbeitsorganisation. Es liegt am Projektteam, wie Storys organisiert werden. Sie könnten nach Meilensteinen sortiert werden. Eine Linie könnte alle Bugs oder alle neuen Features haben. Es hängt davon ab, wie das Team die Arbeit organisiert und koordiniert. Die Reihenfolge der Stories in einem Arbeitsvorrat könnte auch Priorität vermitteln.
id: Worklist dan board merupakan cara berbeda dalam mengatur pekerjaan. Terserah tim proyek bagaimana cerita disusun. Mereka bisa disortir berdasarkan tonggak sejarah. Jalur dapat memiliki semua bug atau semua fitur baru. Itu tergantung pada cara tim mengorganisir dan mengoordinasikan pekerjaan. Urutan cerita dalam worklist dapat menyampaikan prioritas juga.
ko_kr: 작업 목록과 게시판은 작업을 구성하는 다른 방법입니다. 이야기가 어떻게 정리되는지는 프로젝트 팀에 달려 있습니다. 마일스톤별로 정렬할 수 있습니다. 레인은 모든 버그 또는 모든 새로운 기능을 가질 수 있습니다. 그것은 팀의 업무 정리 및 조정 방식에 따라 다릅니다. 작업 목록에 있는 이야기의 순서 또한 우선순위를 전달할 수 있습니다.

source: You can check the status of those jobs at any time by navigating to: https://zuul.openstack.org/
de: Sie können den Status dieser Aufträge jederzeit überprüfen, indem Sie auf https://zuul.openstack.org/ navigieren
id: Anda dapat memeriksa status pekerjaan tersebut kapan saja dengan menavigasi ke: https://zuul.openstack.org/
ko_kr: https://zuul.openstack.org/으로 이동하여 언제든지 해당 작업의 상태를 확인할 수 있습니다.

source: You can find both the conference and Forum sessions on the Summit schedule.
de: Im Zeitplan des Gipfels finden Sie sowohl die Konferenz- als auch die Forumssitzungen.
id: Anda dapat menemukan sesi konferensi dan Forum pada jadwal KTT.
ko_kr: 컨퍼런스 및 포럼 세션은 모두 정상회담 일정에서 찾을 수 있습니다.

source: You can generate a new SSH key pair using the provided email as a label by going into your terminal program and typing::
de: Sie können ein neues SSH-Schlüsselpaar mit der angegebenen E-Mail als Label generieren, indem Sie in Ihr Terminalprogramm gehen und: eingeben:
id: Anda dapat membuat pasangan kunci SSH baru menggunakan email yang disediakan sebagai label dengan masuk ke program terminal Anda dan mengetik ::
ko_kr: 터미널 프로그램에 들어가서 다음을 입력하여 제공된 전자 메일을 레이블로 사용하여 새 SSH 키 쌍을 생성할 수 있습니다.

source: You can generate a new SSH key using the provided email as a label by going into your terminal program and typing::
de: Sie können einen neuen SSH-Schlüssel mit der angegebenen E-Mail als Label generieren, indem Sie in Ihr Terminalprogramm gehen und: eingeben:
id: Anda dapat membuat kunci SSH baru menggunakan email yang disediakan sebagai label dengan masuk ke program terminal Anda dan mengetik ::
ko_kr: 터미널 프로그램에 들어가서 다음을 입력하여 제공된 전자 메일을 레이블로 사용하여 새 SSH 키를 생성할 수 있습니다.

source: You can reference `Comparison of Official Group Structures page <https://governance.openstack.org/tc/reference/comparison-of-official-group-structures.html>`_ to see the difference between group structures.
id: Anda bisa referensi `Comparison of Official Group Structures page <https://governance.openstack.org/tc/reference/comparison-of-official-group-structures.html>`_ untuk melihat perbedaan antara struktur kelompok.
ko_kr: 그룹 구조의 차이를 보려면 `Comparison of Official Group Structures(공식 그룹 구조 비교 페이지 ) <https://governance.openstack.org/tc/reference/comparison-of-official-group-structures.html>`_ 를 참조할 수 있습니다.

source: You can use `Git Immersion <http://gitimmersion.com/lab_02.html>`_ to work through tutorials for learning git.
de: Sie können `Git Immersion <http://gitimmersion.com/lab_02.html>`_ verwenden, um Tutorials zum Erlernen von Git durchzuarbeiten.
id: Anda dapat menggunakan `Git Immersion <http://gitimmersion.com/lab_02.html>` _ untuk mengerjakan tutorial untuk mempelajari git.
ko_kr: `Git Immersion <http://gitimmersion.com/lab_02.html>`_ 을 사용하여 Git 학습에 대한 튜토리얼을 진행할 수 있습니다.

source: You will be prompted to select a username. You can enter the same one you did for Launchpad, or something else.
de: Sie werden aufgefordert, einen Benutzernamen auszuwählen. Sie können den gleichen eingeben, den Sie für Launchpad gemacht haben, oder etwas anderes.
id: Anda akan diminta untuk memilih nama pengguna. Anda dapat memasukkan yang sama dengan yang Anda lakukan untuk Launchpad, atau yang lainnya.
ko_kr: 사용자 이름을 선택하라는 메시지가 표시됩니다. Launchpad에 대해 입력한 것과 동일한 항목 또는 다른 항목을 입력할 수 있습니다.

source: You're already signed up. Launchpad uses your Ubuntu One account for authentication like StoryBoard.
de: Sie sind bereits angemeldet. Launchpad verwendet Ihr Ubuntu One-Konto zur Authentifizierung wie StoryBoard.
id: Anda sudah mendaftar. Launchpad menggunakan akun Ubuntu One Anda untuk otentikasi seperti StoryBoard.
ko_kr: 이미 가입되어 있습니다. Launchpad는 StoryBoard와 같은 인증에 Ubuntu One 계정을 사용합니다.

source: Your membership application must be confirmed by the language coordinator. This may take some time. An e-mail with your request will be sent automatically.
de: Ihr Mitgliedsantrag muss vom Sprachkoordinator bestätigt werden. Dies kann einige Zeit in Anspruch nehmen. Eine E-Mail mit Ihrer Anfrage wird automatisch versendet.
id: Aplikasi keanggotaan Anda harus dikonfirmasi oleh koordinator bahasa. Ini mungkin membutuhkan waktu. Email dengan permintaan Anda akan dikirim secara otomatis.
ko_kr: 회원가입 신청은 언어 코디네이터가 확인해야 합니다. 시간이 좀 걸릴 수 있습니다. 요청하신 이메일이 자동으로 발송됩니다.

source: Zanata Usage
de: Zanata-Nutzung
id: Penggunaan Zanata
ko_kr: 자나타 사용
