Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: **Both mentors and mentees should subscribe to stay up to date with conversations.**
de: **Sowohl Mentoren als auch Mentees sollten sich anmelden, um über Gespräche auf dem Laufenden zu bleiben**
ko_kr: **멘토와 멘티 모두 대화 내용을 최신 상태로 유지하려면 구독해야 합니다.**

source: **Bug Status** All bugs have a status lifecycle. They start as 'New' and move to other statuses from there depending on what all is included in the description and if others can duplicate the issue. Resolved statuses, meaning there is no more work to be done on the bug are: 'Fix Released', 'Invalid', or 'Won't Fix'.
de: **Bug Status** Alle Fehler haben einen Status-Lebenszyklus. Sie beginnen als "New" und wechseln von dort aus zu anderen Status, je nachdem, was alles in der Beschreibung enthalten ist und ob andere das Problem duplizieren können. Gelöste Status, d.h. es gibt keine Arbeit mehr an dem Bug zu erledigen: 'Fix Released', 'Invalid' oder 'Won't Fix'.
id: **Bug Status** Semua bug memiliki siklus status. Mereka mulai sebagai 'New' dan pindah ke status lain dari sana tergantung pada apa yang termasuk dalam deskripsi dan jika orang lain dapat menduplikasi masalah. Status yang diselesaikan, berarti tidak ada lagi pekerjaan yang harus dilakukan pada bug adalah: 'Fix Released', 'Invalid', atau 'Won't Fix'.
ko_kr: **버그 상태** 모든 버그에는 상태 수명 주기가 있습니다. 설명에 포함된 모든 항목과 다른 사용자가 문제를 복제할 수 있는지에 따라 '새로 만들기'로 시작하여 해당 위치에서 다른 상태로 이동합니다. 해결된 상태, 즉 버그에 대해 더 이상 수행할 작업이 없다는 의미입니다. 'Fix Released', 'Invalid' 또는 'Won't Fix'입니다.

source: **Private key** - Only known to you and it should be safely guarded.
de: **Privater Schlüssel** - Nur Ihnen bekannt und sollte sicher geschützt werden.
id: **Private key** - Hanya diketahui oleh Anda dan itu harus dijaga dengan aman.
ko_kr: **개인용 키** - 오직 당신에게만 알려져 있으며 안전하게 보호되어야 합니다.

source: **Public key** - Can be shared freely with any SSH server you wish to connect to.
de: **Öffentlicher Schlüssel** - Kann frei mit jedem SSH-Server geteilt werden, mit dem Sie sich verbinden möchten.
id: **Public key** - Dapat dibagikan secara bebas dengan server SSH yang ingin Anda sambungkan.
ko_kr: **공용 키** - 연결하려는 SSH 서버와 자유롭게 공유할 수 있습니다.

source: 6 months from the time the branch is made unmaintained.
id: 6 bulan dari saat cabang dibuat tanpa perawatan.
ko_kr: branch가 유지보수되지않은 지 6개월 후입니다.

source: A Task Tracker account allows you to:
de: Ein Task Tracker-Konto ermöglicht Ihnen Folgendes:
id: Akun Task Tracker memungkinkan Anda untuk:
ko_kr: Task Tracker 계정은 다음을 가능하게 한다.

source: A good channel to join right away is the #openstack-dev channel. A lot of people hang around in that channel so come on in and say hello! If there is a specific project you are also interested in working on, feel free to join that one as well and introduce yourself there. Interested in joining more channels or need to look up what one is called? Check out :ref:`irc-channels` for more information.
de: Ein guter Kanal, um sofort beizutreten, ist der #openstack-dev-Kanal. Viele Leute hängen in diesem Kanal herum, also kommen Sie rein und sagen Hallo! Wenn es ein bestimmtes Projekt gibt, an dem Sie auch gerne arbeiten möchten, können Sie sich gerne auch diesem Projekt anschließen und sich dort vorstellen. Sind Sie daran interessiert, mehreren Kanälen beizutreten oder müssen Sie nachschlagen, wie man sich nennt? Weitere Informationen finden Sie unter :ref:`irc-channels`.
id: Saluran yang baik untuk bergabung segera adalah saluran #openstack-dev. Banyak orang berkeliaran di saluran itu jadi datang dan menyapa! Jika ada proyek khusus yang juga ingin Anda kerjakan, silakan bergabung dengan proyek itu juga dan perkenalkan diri Anda di sana. Tertarik untuk bergabung dengan lebih banyak saluran atau perlu mencari tahu apa sebutannya? Lihat :ref:`irc-channels` untuk informasi lebih lanjut.
ko_kr: 당장 가입하기 좋은 채널은 #openstack-dev 채널입니다. 그 채널에서 많은 분들이 돌아다니시니까 들어오셔서 인사하세요! 만약 여러분이 또한 작업하고 싶은 특정한 프로젝트가 있다면, 그 프로젝트에 참여하세요. 그리고 그곳에서 여러분 자신을 소개하세요. 더 많은 채널에 참여하고 싶거나 채널 이름을 조회해야 합니까? 자세한 내용은 :ref:`irc-channels` 을 참조하세요.

source: A story is a desired change. Whether it is a bug or a new feature, both are essentially a code change. Tasks are sub items of the story; they are tied to specific projects. As an example, a story could be to invent some new feature A, and tasks would be change in project X, change in project Y, and change in project Z. Those changes need to merge in order to complete feature A.
de: Eine Story ist eine gewünschte Veränderung. Ob es sich nun um einen Bug oder ein neues Feature handelt, beide sind im Wesentlichen eine Code-Änderung. Aufgaben sind Unterpunkte der Story; sie sind an spezifische Projekte gebunden. Als Beispiel könnte eine Story sein, um ein neues Feature A zu erfinden, und Aufgaben wären Änderung in Projekt X, Änderung in Projekt Y und Änderung in Projekt Z. Diese Änderungen müssen zusammengeführt werden, um Feature A abzuschließen.
id: Cerita A adalah perubahan yang diinginkan. Apakah itu bug atau fitur baru, keduanya pada dasarnya adalah perubahan kode. Tugas adalah sub item dari cerita; mereka terikat pada proyek tertentu. Sebagai contoh, sebuah cerita dapat menciptakan beberapa fitur baru A, dan tugas akan berubah dalam proyek X, perubahan dalam proyek Y, dan perubahan dalam proyek Z. Perubahan-perubahan itu perlu digabung untuk melengkapi fitur A.
ko_kr: 이야기는 바람직한 변화입니다. 버그 던 새 기능이던간에 둘 다 기본적으로 코드 변경입니다. 작업은 스토리의 하위 항목이며, 특정 프로젝트와 연관되어 있습니다. 예를 들어, 이야기는 A라는 새로운 특징을 발명하는 것일 수 있고, 과제는 프로젝트 X의 변화, 프로젝트 Y의 변화, 프로젝트 Z의 변화일 것입니다. 기능 A을(를) 완료하려면 이러한 변경 사항을 병합해야 합니다.

source: Account Setup
de: Konto-Setup
id: Account Setup (pengaturan akun)
ko_kr: 계정 설정

source: Active Project Contributor (APC)
de: Aktiver Projektmitarbeiter (APC)
ko_kr: 활성 프로젝트 기여자(APC)

source: Active Technical Contributor (ATC)
de: Aktiver Technischer Mitwirkender (ATC)
ko_kr: 능동적 기술 기여자(ATC)

source: Active User Contributor (AUC)
de: Aktiver Benutzer-Mitwirkender (AUC)
ko_kr: 활성 사용자 기여자(AUC)

source: Add your affiliation information and statement of interest. This will be visible only to foundation members.
de: Füge deine Mitgliedschaftsinformationen und Interessenbekundungen hinzu. Dies ist nur für die Foundation-Mitglieder sichtbar.
id: Tambahkan informasi afiliasi dan pernyataan minat Anda. Ini hanya akan terlihat oleh anggota yayasan.
ko_kr: 소속 정보 및 관심 진술을 추가합니다. 이것은 기초 구성원만 볼 수 있습니다.

source: After clicking that button, the further information field will appear along with the 'This bug is a security vulnerability' radio box. You can edit the summary line to differentiate it from the other bugs Launchpad thought it was similar to, add details like the setup you were using, what you were doing when you hit the unexpected behavior, the error codes you encountered, etc.
de: Nach dem Anklicken dieser Schaltfläche erscheint das Feld für weitere Informationen zusammen mit dem Kontrollkästchen'Dieser Fehler ist eine Sicherheitsrisiko'. Sie können die Summenzeile bearbeiten, um sie von den anderen Fehlern zu unterscheiden, denen Launchpad dachte, dass sie ähnlich sei, Details wie das Setup, das Sie verwendeten, was Sie taten, wenn Sie das unerwartete Verhalten trafen, die Fehlercodes, auf die Sie gestoßen sind, usw. hinzufügen.
id: Setelah mengklik tombol itu, bidang informasi lebih lanjut akan muncul bersama dengan radio box 'This bug is a security vulnerability' . Anda dapat mengedit baris ringkasan untuk membedakannya dari bug lain yang menurut Launchpad mirip dengan itu, menambahkan detail seperti pengaturan yang Anda gunakan, apa yang Anda lakukan ketika Anda menekan perilaku yang tidak terduga, kode kesalahan yang Anda temui, dll.
ko_kr: 이 버튼을 클릭하면 추가 정보 필드가 '이 버그는 보안 취약성입니다' 라디오 상자와 함께 나타납니다. 요약 라인을 편집하여 Launchpad와 유사한 버그와 구별하고 사용 중인 설정, 예기치 않은 동작 발생 시 수행했던 작업, 발견된 오류 코드 등의 세부 정보를 추가할 수 있습니다.

source: After the first milestone, some projects focus more on the development and bug fixing activities, while other projects might still accept new ideas to implement in that cycle.
de: Nach dem ersten Meilenstein konzentrieren sich einige Projekte mehr auf die Entwicklungs- und Fehlerbehebungsaktivitäten, während andere Projekte noch neue Ideen akzeptieren könnten, die in diesem Zyklus umgesetzt werden sollen.
id: Setelah tonggak pertama, beberapa proyek lebih fokus pada pengembangan dan kegiatan perbaikan bug, sementara proyek lain mungkin masih menerima ide-ide baru untuk diimplementasikan dalam siklus itu.
ko_kr: 첫 번째 마일스톤 이후 일부 프로젝트는 개발 및 버그 수정 작업에 더 집중하는 반면, 다른 프로젝트에서는 여전히 해당 사이클에서 구현할 새로운 아이디어를 수용할 수 있습니다.

source: After the third milestone the community is focusing on stabilizing the release by putting more emphasis on testing and fixing bugs. The projects following the release cycle have their release candidates tagged after the third milestone. There are no limits to release candidates, but the goal is to keep the number low and fix all the critical issues that got identified by milestone-3.
de: Nach dem dritten Meilenstein konzentriert sich die Community auf die Stabilisierung der Veröffentlichung, indem sie mehr Gewicht auf das Testen und Beheben von Fehlern legt. Die Projekte, die dem Release-Zyklus folgen, haben ihre Release-Kandidaten nach dem dritten Meilenstein markiert. Es gibt keine Grenzen für die Freigabe von Kandidaten, aber das Ziel ist es, die Zahl niedrig zu halten und alle kritischen Probleme zu beheben, die durch Meilenstein-3 identifiziert wurden.
id: Setelah tonggak ketiga, komunitas fokus pada menstabilkan rilis dengan lebih menekankan pengujian dan memperbaiki bug. Proyek-proyek setelah siklus rilis memiliki calon rilis mereka ditandai setelah tonggak ketiga. Tidak ada batasan untuk melepaskan kandidat, tetapi tujuannya adalah untuk menjaga jumlah yang rendah dan memperbaiki semua masalah kritis yang diidentifikasi oleh tonggak-3.
ko_kr: 세 번째 마일스톤 이후, 커뮤니티는 버그를 테스트하고 수정하는 데 더욱 중점을 두어 릴리즈를 안정화하는 데 주력하고 있습니다. 릴리스 사이클 이후의 프로젝트에는 세 번째 마일스톤 뒤에 릴리스 후보 태그가 지정됩니다. 후보를 발표하는 데는 제한이 없지만 목표는 숫자를 낮게 유지하고 마일스톤-3으로 식별된 모든 중요한 문제를 수정하는 것입니다.

source: All appropriate bug fixes accepted and releases are produced.
id: Semua perbaikan bug yang sesuai diterima dan rilis diproduksi.
ko_kr: 적절한 버그 수정 사항이 모두 승인되고 릴리스가 생성됩니다.

source: All appropriate bug fixes accepted. No releases are produced and there is reduced CI commitment.
id: Semua perbaikan bug yang sesuai diterima. Tidak ada rilis yang diproduksi dan komitmen CI berkurang.
ko_kr: 적절한 버그 수정을 모두 수정했습니다. 릴리즈가 생성되지 않고 CI 실행이 줄어듭니다.

source: All common tools like bash, git, and SSH will work out of the box.
de: Alle gängigen Tools wie bash, git und SSH funktionieren sofort nach dem Auspacken.
id: Semua alat umum seperti bash, git, dan SSH akan berfungsi di out of the box.
ko_kr: bash, git, SSH와 같은 모든 일반적인 툴은 즉시 사용할 수 있습니다.

source: Although Git `download page <https://git-scm.com/downloads>`_ provides Windows installation binary, most OpenStack development tools (e.g., git-review) unfortunately will not work well on Windows environment.
de: Obwohl Git `Download-Seite <https://git-scm.com/downloads>`_ Windows Installationsbinärdateien anbietet, werden die meisten OpenStack-Entwicklungswerkzeuge (z.B. git-review) leider nicht gut in der Windows-Umgebung funktionieren.
id: Meskipun Git `download page <https://git-scm.com/downloads>`_ menyediakan biner instalasi Windows, sebagian besar alat pengembangan OpenStack (misal, git-review) sayangnya tidak akan berfungsi dengan baik di lingkungan Windows.
ko_kr: `Git 다운로드 페이지 <https://git-scm.com/downloads>`_ 은 Windows 설치 바이너리를 제공하지만 대부분의 OpenStack 개발 도구(예: git-review)는 Windows 환경에서 제대로 작동하지 않습니다.

source: An agreement to clarify intellectual property rights granted with contributions from a person or entity. `Preview the full agreement <https://review.opendev.org/static/cla.html>`_.
id: Perjanjian untuk memperjelas hak kekayaan intelektual yang diberikan dengan kontribusi dari seseorang atau entitas. `Preview the full agreement <https://review.opendev.org/static/cla.html>` _.
ko_kr: 개인 또는 단체의 공헌으로 부여된 지적재산권을 명확히 하기 위한 협정입니다. ` 완전 동의의 Preivew 입니다 <https://review.opendev.org/static/cla.html>`_

source: An employer with the appropriate signing rights of the company or organization needs to sign the `Corporate Contributor License Agreement <https://secure.echosign.com/public/hostedForm?formid=56JUVGT95E78X5>`_.
de: Ein Arbeitgeber mit den entsprechenden Zeichnungsrechten des Unternehmens oder der Organisation muss den `Corporate Contributor License Agreement <https://secure.echosign.com/public/hostedForm?formid=56JUVGT95E78X5>`_ unterzeichnen.
id: Majikan dengan hak penandatanganan yang sesuai dari perusahaan atau organisasi perlu menandatangani `Corporate Contributor License Agreement <https://secure.echosign.com/public/hostedForm?formid=56JUVGT95E78X5>`_.
ko_kr: 회사나 조직의 적절한 서명 권한을 가진 고용주는 `기업 기부자 사용권 계약서 <https://secure.echosign.com/public/hostedForm?formid=56JUVGT95E78X5>`_ 에 서명해야 합니다.

source: Approximately 18 months
id: Sekitar 18 bulan
ko_kr: 약 18개월입니다.

source: As a software, OpenStack is built from a set of microservices which can be combined into different setups based on the actual need. The services provide REST APIs for their users. These can be the cloud operators or other services. To make the usage of the APIs easier it is possible to use Software Development Kits (SDKs) which are also developed as projects inside the OpenStack community.
de: Als Software besteht OpenStack aus einer Reihe von Mikroservices, die je nach Bedarf zu verschiedenen Setups kombiniert werden können. Die Dienste stellen ihren Benutzern REST-APIs zur Verfügung. Dies können die Cloud-Betreiber oder andere Dienste sein. Um die Verwendung der APIs zu erleichtern, ist es möglich, Software Development Kits (SDKs) zu verwenden, die auch als Projekte innerhalb der OpenStack-Community entwickelt werden.
id: Sebagai perangkat lunak, OpenStack dibangun dari seperangkat layanan microservice yang dapat digabungkan ke dalam berbagai pengaturan berdasarkan kebutuhan aktual. Layanan menyediakan REST API untuk penggunanya. Ini dapat berupa operator cloud atau layanan lainnya. Untuk mempermudah penggunaan API, dimungkinkan untuk menggunakan Software Development Kits (SDK) yang juga dikembangkan sebagai proyek di dalam komunitas OpenStack.
ko_kr: 소프트웨어로서 OpenStack은 실제 필요에 따라 서로 다른 설정으로 결합할 수 있는 일련의 마이크로 서비스로부터 구축됩니다. 이 서비스는 사용자에게 REST API를 제공합니다. 이들은 클라우드 운영자 또는 기타 서비스일 수 있습니다. API를 보다 쉽게 사용할 수 있도록 OpenStack 커뮤니티 내에서 프로젝트로도 개발된 SDK(소프트웨어 개발 키트)를 사용할 수 있습니다.

source: As it stands right now, there are 4 mentoring cohorts:
de: So wie es derzeit aussieht, gibt es 4 Mentorenkohorten:
id: Seperti yang ada sekarang, ada 4 kelompok pendampingan:
ko_kr: 현재 상태로는 4개의 멘토링 코호트가 있습니다.

source: Aside from the Forum, the other operator focused event is the operator meetup. You can read general information about it here :ref:`ops-meetup`. It's organized by the operator community biannually in locations all over the world.
id: Selain Forum, acara lain yang berfokus pada operator adalah pertemuan operator. Anda dapat membaca informasi umum tentang ini di sini :ref:`ops-meetup`. Ini diselenggarakan oleh komunitas operator dua kali setahun di lokasi di seluruh dunia.
ko_kr: 포럼 외에도 다른 운영자 중심의 이벤트는 운영자 미팅입니다. :ref:`ops-meetup` 여기서 그것에 대한 일반적인 정보를 읽을 수 있습니다. 운영자 커뮤니티가 매년 전 세계 각지에서 조직하고 있습니다.

source: Ask questions and get prompt responses from the community
de: Stellen Sie Fragen und erhalten Sie schnelle Antworten aus der Community
id: Ajukan pertanyaan dan dapatkan tanggapan segera dari komunitas
ko_kr: 커뮤니티에서 질문을 하고 신속한 답변을 얻습니다.

source: At the prompt, type a secure passphrase, you may enter one or press Enter to have no passphrase::
de: Geben Sie an der Eingabeaufforderung eine sichere Passphrase ein, die Sie eingeben können, oder drücken Sie Enter, um keine Passphrase zu erhalten::
id: Saat diminta, ketik frasa sandi yang aman, Anda dapat memasukkan satu atau tekan Enter untuk tidak memiliki frasa sandi ::
ko_kr: 프롬프트에서 보안 암호를 입력하거나 Enter 키를 눌러 암호를 입력할 수 있습니다.

source: Based on the summary line, Launchpad will do a quick query to see if there has been anything reported already that might be the same issue you are trying to report. It is important to look through these to avoid filing duplicate bugs and creating redundancies in the bug index. If you do not see a bug that sounds like the issue you are reporting, you can click the 'No, I need to report a new bug' button.
de: Basierend auf der Übersichtszeile führt Launchpad eine Schnellabfrage durch, um festzustellen, ob bereits etwas gemeldet wurde, das das gleiche Problem darstellen könnte, das Sie zu melden versuchen. Es ist wichtig, diese durchzusehen, um zu vermeiden, doppelte Fehler zu archivieren und Redundanzen im Fehlerindex zu schaffen. Wenn Sie einen Fehler nicht sehen, der nach dem Problem klingt, das Sie melden, können Sie auf die Schaltfläche "Nein, ich muss einen neuen Fehler melden" klicken.
id: Berdasarkan garis ringkasan, Launchpad akan melakukan kueri cepat untuk melihat apakah ada sesuatu yang sudah dilaporkan yang mungkin merupakan masalah yang sama dengan yang Anda coba laporkan. Penting untuk memeriksa ini untuk menghindari pengarsipan bug duplikat dan membuat redundansi dalam indeks bug. Jika Anda tidak melihat bug yang terdengar seperti masalah yang Anda laporkan, Anda dapat mengklik tombol 'No, I need to report a new bug'.
ko_kr: 요약 줄에 따라 Launchpad는 보고하려는 문제와 동일한 문제가 이미 보고된 것이 있는지 빠르게 쿼리합니다. 중복 버그를 보고 버그 인덱스에 중복 버그가 생성되지 않도록 이러한 버그들을 살펴보는 것이 중요합니다. 보고하는 문제처럼 들리는 버그가 보이지 않으면 '아니요, 새 버그를 보고해야 합니다' 버튼을 클릭하시면 됩니다.

source: Be included in master and backported to all releases between master and the stable branch in question
id: Jadilah termasuk dalam master dan di-backport ke semua rilis antara master dan cabang stabil yang dimaksud
ko_kr: 마스터에 포함되고 해당 마스터와 안정 분기 사이의 모든 릴리스에 백포팅됩니다.

source: Be self contained
id: Jadilah mandiri
ko_kr: 독립된

source: Become COA certified or study for COA: Mentors will provide support and guidance to mentees as they prepare for the COA exam.
de: Werden Sie COA-zertifiziert oder studieren Sie für COA: Mentoren unterstützen und beraten Mentees bei der Vorbereitung auf die COA-Prüfung.
id: Menjadi tersertifikasi COA atau belajar untuk COA: Mentor akan memberikan dukungan dan bimbingan kepada orang yang didampingi saat mereka mempersiapkan ujian COA.
ko_kr: COA 자격증 취득 또는 COA 공부: 멘토들은 멘티들이 COA 시험을 준비하는 동안 지원과 지도를 제공할 것입니다.

source: Before doing **git commit** on your patch it is important to initialize git review. Use the following command to do the initial git review configuration in your repository::
de: Bevor Sie **git commit** auf Ihrem Patch ausführen, ist es wichtig, die Git Review zu initialisieren. Verwenden Sie den folgenden Befehl, um die erste Git-Review-Konfiguration in Ihrem Repository durchzuführen::
id: Sebelum melakukan **git commit** pada patch Anda, penting untuk menginisialisasi review git. Gunakan perintah berikut untuk melakukan konfigurasi git review awal di repositori Anda ::
ko_kr: 패치에 대해 **git commit** 을(를) 수행하기 전에 git 검토를 초기화해야 합니다. 다음 명령을 사용하여 리포지토리에서 초기 git 검토 구성을 수행할 수 있습니다.

source: Before raising a bug, story or feature request it's important to note that not all projects do the same thing. It's best to go check with the project to see how they handle these requests. For details on how to contact a project check the `project list <https://governance.openstack.org/tc/reference/projects/index.html>`_.
de: Bevor Sie einen Bug, eine Story oder eine Feature-Anfrage stellen, ist es wichtig zu beachten, dass nicht alle Projekte dasselbe tun. Es ist am besten, sich mit dem Projekt in Verbindung zu setzen, um zu sehen, wie sie mit diesen Anfragen umgehen. Details zur Kontaktaufnahme mit einem Projekt finden Sie in der `Projektliste <https://governance.openstack.org/tc/reference/projects/index.html>`_.
id: Sebelum mengajukan bug, permintaan cerita atau fitur, penting untuk dicatat bahwa tidak semua proyek melakukan hal yang sama. Yang terbaik adalah memeriksa proyek untuk melihat bagaimana mereka menangani permintaan ini. Untuk detail tentang cara menghubungi proyek, periksa `project list <https://governance.openstack.org/tc/reference/projects/index.html>`_.
ko_kr: 버그, 스토리 또는 기능 요청을 제기하기 전에 모든 프로젝트가 동일한 작업을 수행하는 것은 아니라는 점을 유념해야 합니다. 프로젝트에 가서 이러한 요청을 어떻게 처리하는지 확인하는 것이 가장 좋습니다. 프로젝트에 연락하는 방법에 대한 자세한 내용은 `프로젝트 리스트 <https://governance.openstack.org/tc/reference/projects/index.html>`_ 을 확인하세요.

source: Before the Ocata release the Maintained and Extended Maintenance phases were only 6 months long. This meant that each release went End of Life after 18 months. It was determined that this practice was not beneficial for distributors or users of OpenStack. As a result the Maintained state was updated to last 18 months and the Extended Maitenance time frame was made flexible increasing the number of stable branches still accepting fixes.
id: Sebelum rilis Ocata, fase Maintained and Extended Maintenance hanya 6 bulan. Ini berarti bahwa setiap rilis menjadi End of Life setelah 18 bulan. Ditentukan bahwa praktik ini tidak menguntungkan bagi distributor atau pengguna OpenStack. Sebagai hasilnya, status Maintained diperbarui untuk 18 bulan terakhir dan kerangka waktu Extended Maitenance menjadi fleksibel meningkatkan jumlah branch stabil yang masih menerima perbaikan.
ko_kr: Ocata 릴리스 전에는 유지 관리 및 확장 유지 관리 단계가 6개월에 불과했습니다. 이것은 각각의 개봉이 18개월 후에 End of Life가 되었다는 것을 의미했습니다. 이러한 관행은 OpenStack의 총판이나 사용자에게 이롭지 않다고 판단되었습니다. 그 결과 유지 관리 상태가 18개월 지속으로 업데이트되고 확장 관리 기간 프레임을 유연하게 설정하여 여전히 수정 사항을 수용하는 안정적인 지점의 수를 늘렸습니다.

source: Benefits for official OpenStack projects:
de: Vorteile für offizielle OpenStack-Projekte:
id: Manfaat untuk proyek OpenStack resmi:
ko_kr: 공식 OpenStack 프로젝트를 통해 얻을 수 있는 이점은 다음과 같습니다.

source: Blueprints
de: Vorlagen
id: Blueprint (cetak biru)
ko_kr: 블루프린트

source: Boards & Worklists
de: Boards & Arbeitslisten
ko_kr: 보드와 워크리스트

source: Body
ko_kr: 본문

source: Branch is no longer accepting Changes.
id: Branch tidak lagi menerima Changes.
ko_kr: branch가 더 이상 변경을 수락하지 않습니다.

source: Bugs
de: Fehler
id: Bug
ko_kr: 버그

source: Bugs are pretty self explanitory- some unexpected or unintended behavior of the software. To report a bug you have found in Launchpad, click the 'Report a bug' button from the project's overview page.
de: Bugs sind ziemlich selbsterklärend - ein unerwartetes oder unbeabsichtigtes Verhalten der Software. Um einen Fehler zu melden, den Sie in Launchpad gefunden haben, klicken Sie auf der Übersichtsseite des Projekts auf die Schaltfläche "Einen Fehler melden".
id: Bug cukup jelas - beberapa perilaku perangkat lunak yang tidak terduga atau tidak diinginkan. Untuk melaporkan bug yang Anda temukan di Launchpad, klik tombol 'Report a bug' dari halaman tinjauan proyek.
ko_kr: 버그는 소프트웨어의 예기치 않은 동작이나 의도하지 않은 동작 등 상당히 자기 설명적인 역할을 합니다. 실행패드에서 찾은 버그를 보고하려면 프로젝트 개요 페이지에서 '버그 보고' 버튼을 클릭합니다.

source: Build up your persona in the community as a contributing member
de: Bauen Sie Ihre Persönlichkeit in der Community als beitragendes Mitglied auf
id: Bangun kepribadian Anda di komunitas sebagai anggota yang berkontribusi
ko_kr: 지역사회에서 기여하는 구성원으로서 당신의 개성을 쌓으세요.

source: Can participate in common programs, like `mentoring <https://wiki.openstack.org/wiki/Mentors>`_ and `internship <https://wiki.openstack.org/wiki/Outreachy>`_ to help with on boarding
de: Kann an gängigen Programmen teilnehmen, wie z.B. `Mentoring <https://wiki.openstack.org/wiki/Mentors>`_ und `Praktikum <https://wiki.openstack.org/wiki/Outreachy>`_ zur Unterstützung beim Boarding
id: Dapat berpartisipasi dalam program umum, seperti `mentoring <https://wiki.openstack.org/wiki/Mentors>`_ dan `internship <https://wiki.openstack.org/wiki/Outreachy>`_ untuk membantu on boarding
ko_kr: 참여에 도움이 되는 `멘토링 <https://wiki.openstack.org/wiki/Mentors>`_ , `인턴쉽 <https://wiki.openstack.org/wiki/Outreachy>`_ 등의 공통 프로그램에 참여할 수 있습니다.
