Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-organizations.po
Languages: de, id

source: There are browser based IRC services, like irccloud, that will keep users connected and use the standard HTTPS (443/tcp).
de: Es gibt browserbasierte IRC-Dienste, wie irccloud, die die Benutzer in Verbindung halten und das Standard-HTTPS (443/tcp) verwenden.
id: Ada layanan IRC berbasis browser, seperti irccloud, yang akan membuat pengguna tetap terhubung dan menggunakan standard HTTPS (443/tcp).

source: There are many components and projects related to running and developing OpenStack all of which run on top of Linux. So a developer will need:
de: Es gibt viele Komponenten und Projekte im Zusammenhang mit dem Betrieb und der Entwicklung von OpenStack, die alle auf Linux laufen. Also wird ein Entwickler brauchen:
id: Ada banyak komponen dan proyek yang berkaitan dengan menjalankan dan mengembangkan OpenStack yang semuanya berjalan di atas Linux. Jadi pengembang perlu:

source: There are multiple chances in each release cycle to trigger development tasks in the community. Bringing more technical decision to the community will help you get more feedback and guidelines from developers and operators globally. Also, help them to make better cycle goals which also be a benefit for you.
de: In jedem Release-Zyklus gibt es mehrere Möglichkeiten, Entwicklungsaufgaben in der Community auszulösen. Wenn Sie mehr technische Entscheidungen in die Community einbringen, erhalten Sie mehr Feedback und Richtlinien von Entwicklern und Betreibern weltweit. Auch helfen Sie ihnen, bessere Zyklusziele zu erreichen, die auch für Sie von Vorteil sind.
id: Ada beberapa peluang dalam setiap siklus rilis untuk memicu tugas pengembangan di komunitas. Membawa lebih banyak keputusan teknis kepada komunitas akan membantu Anda mendapatkan lebih banyak umpan balik dan panduan dari pengembang dan operator secara global. Juga, bantu mereka membuat sasaran siklus yang lebih baik yang juga bermanfaat bagi Anda.

source: Titles held by community members are temporary and activities are not really linked to titles.
de: Titel, die von Community-Mitgliedern gehalten werden, sind temporär und Aktivitäten sind nicht wirklich mit Titeln verknüpft.
id: Judul yang dipegang oleh anggota masyarakat bersifat sementara dan kegiatan tidak benar-benar terkait dengan judul.

source: To put more simply, the more invested a company is in the community, the more likely they are to earn a place of influence.
de: Vereinfacht ausgedrückt: Je mehr ein Unternehmen in die Gemeinschaft investiert ist, desto wahrscheinlicher ist es, dass es einen Einflussbereich erhält.
id: Sederhananya, semakin banyak investasi perusahaan di masyarakat, semakin besar kemungkinan mereka mendapatkan tempat pengaruh.

source: What is the Contributing Organization Guide?
de: Was ist das Beitragen zum Organisationsleitfaden?
id: Apa itu Panduan Organisasi yang Berkontribusi?

source: Why we need to send technical people into the community?
de: Warum müssen wir Techniker in die Community schicken?
id: Mengapa kita perlu mengirim orang teknis ke komunitas?

source: Why you need to sync with the technical community?
de: Warum müssen Sie mit der technischen Community synchronisieren?
id: Mengapa Anda perlu melakukan sinkronisasi dengan komunitas teknis?

source: With technical people in the community, you will find it's easier to trigger development tasks or discussions in the community to get the best chance of integrating with your business/product plan.
de: Mit Technikern in der Community ist es einfacher, Entwicklungsaufgaben oder Diskussionen in der Community auszulösen, um die besten Chancen für die Integration in Ihren Geschäfts-/Produktplan zu erhalten.
id: Dengan orang-orang teknis di komunitas, Anda akan lebih mudah memicu tugas pengembangan atau diskusi di komunitas untuk mendapatkan peluang terbaik untuk berintegrasi dengan rencana bisnis / produk Anda.

source: Working if developers from a different part of the globe may mean finding a time to chat on IRC when all parties are available.
de: Wenn Sie als Entwickler aus einem anderen Teil der Welt arbeiten, kann das bedeuten, dass Sie eine Zeit zum Chatten im IRC finden, wenn alle Parteien verfügbar sind.
id: Bekerja jika pengembang dari bagian lain dunia dapat berarti mencari waktu untuk mengobrol di IRC ketika semua pihak tersedia.

source: You need people to maintain your product, just as the community needs people to maintain projects in each release cycle to keep development going.
de: Sie brauchen Leute, um Ihr Produkt zu pflegen, so wie die Community Leute braucht, die Projekte in jedem Release-Zyklus pflegen, um die Entwicklung am Laufen zu halten.
id: Anda membutuhkan orang untuk mempertahankan produk Anda, sama seperti masyarakat membutuhkan orang untuk memelihara proyek di setiap siklus rilis untuk menjaga pengembangan terus berjalan.

source: citing articles about how maintaining forks is generally an expensive and painful process (via links to further reading on effective open source community involvement)
de: Zitieren von Artikeln darüber, wie die Pflege von Forks im Allgemeinen ein teurer und schmerzhafter Prozess ist (über Links zu weiterführenden Informationen über effektives Open-Source-Community-Engagement).
id: mengutip artikel tentang bagaimana memelihara fork (pencabangan) pada umumnya merupakan proses yang mahal dan menyakitkan (melalui tautan untuk membaca lebih lanjut tentang keterlibatan komunitas open source yang efektif)

source: Access to review.opendev.org for code review and code submission.
de: Zugang zu review.opendev.org für Codeüberprüfung und Codeübertragung.

source: Having engineers spending more time upstream helps everyone by providing continuous input and feedback to tasks that you set as high priority. But it's more then that, OpenStack relies on `peer review <https://governance.openstack.org/tc/reference/principles.html#we-value-constructive-peer-review>`_. From landing code to its governance, to function the project needs people in the community reviewing.
de: Ingenieure, die mehr Zeit im Vorfeld verbringen, helfen jedem, indem sie kontinuierlich Input und Feedback zu Aufgaben geben, die Sie als hohe Priorität festlegen. Aber es ist mehr als das, OpenStack setzt auf `Peer Review <https://governance.openstack.org/tc/reference/principles.html#we-value-constructive-peer-review>`_. Vom Landing Code über seine Governance bis hin zur Funktion benötigt das Projekt die Überprüfung durch Mitarbeiter in der Community.

source: The community does not officially endorse Stackalytics, a contribution statistics gathering service hosted by Mirantis. The community does not encourage attempting to boost one's contribution statistics by proposing large quantities of low-value commits or voting on large numbers of change proposals without providing thoughtful reviews. Activities like this appear to other members of the community as an attempt to game the system and contributors who engage in this will often lose credibility for themselves and their employers in the community. Instead, contributors should try to engage deeply with a single project or a small number of projects to gain understanding of the software component and build relationships with the other contributors for that project.
de: Die Community empfiehlt nicht offiziell den Dienst Stackalytics, der von Mirantis bereitgestellt wird und Statistiken zu den Contributions sammelt und bereitstellt. Die Community ermuntert nicht dazu, die eigenen Statistiken durch einer große Anzahl an kleinen Beiträgen zu beschönigen, oder für viele Vorschläge abzustimmen ohne tiefergehende Reviews beizusteuern. Solche Aktivitäten erzeugen anderen Community Mitgliedern gegenüber den Eindruck das System auszutricksen und Contributor, die dies praktizieren, verlieren selbst an Ansehen, so wie auch ihre Firmen/Arbeitgeber. Contributor sollten sich über ein ein oder wenige Projekte mit der entsprechenden Tiefe beteiligen, um die Funktionen der Software und Komponenten zu verstehen und Beziehungen zu den anderen Contributors aufzubauen.

source: Timezones
de: Zeitzonen
