Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de, id, ko_kr

source: The downloaded file should be a dmg in your downloads folder. Open that dmg file and follow the instructions on screen.
de: Die heruntergeladene Datei sollte eine dmg in Ihrem Download-Ordner sein. Öffnen Sie diese dmg-Datei und folgen Sie den Anweisungen auf dem Bildschirm.
id: File yang diunduh harus berupa dmg di folder unduhan Anda. Buka file dmg itu dan ikuti instruksi di layar.
ko_kr: 다운로드한 파일은 다운로드 폴더의 dmg여야 합니다. dmg 파일을 열고 화면의 지침을 따르십시오.

source: The event is designed to bring together users, operators and developers to discuss feedback and future plans and you will also find a lot of options to collaborate with representatives from adjacent communities.
de: Die Veranstaltung soll Anwender, Betreiber und Entwickler zusammenbringen, um Feedback und Zukunftspläne zu diskutieren, und Sie werden auch viele Möglichkeiten zur Zusammenarbeit mit Vertretern aus angrenzenden Gemeinden finden.
id: Acara ini dirancang untuk menyatukan pengguna, operator, dan pengembang untuk membahas umpan balik dan rencana masa depan dan Anda juga akan menemukan banyak opsi untuk berkolaborasi dengan perwakilan dari komunitas yang berdekatan.
ko_kr: 이 행사는 사용자, 운영자 및 개발자가 함께 모여 피드백 및 향후 계획에 대해 논의하기 위해 마련되었으며, 인접 지역 커뮤니티의 대표자들과 협업할 수 있는 다양한 옵션을 찾을 수 있습니다.

source: The events are one or two days long and filled with mainly presentations and panel discussions about the latest hot topics in the community's life. It gives you a great opportunity to meet the local community and find people who are interested in the same challenges and technology as you are. Connecting with people in the same region where you are gives you the advantage to be able to reach out easier to them later as they are in the same time zone, maybe even in the same city.
de: Die Veranstaltungen dauern ein bis zwei Tage und sind vor allem mit Präsentationen und Podiumsdiskussionen zu den neuesten heißen Themen im Leben der Community gefüllt. Es gibt dir eine großartige Gelegenheit, die lokale Gemeinschaft zu treffen und Menschen zu finden, die an den gleichen Herausforderungen und Technologien interessiert sind wie Sie. Die Verbindung mit Menschen in der gleichen Region, in der Sie sich befinden, hat den Vorteil, dass Sie sie später leichter erreichen können, da sie sich in der gleichen Zeitzone befinden, vielleicht sogar in der gleichen Stadt.
id: Acara ini berlangsung satu atau dua hari dan diisi dengan presentasi dan diskusi panel tentang topik hangat terbaru dalam kehidupan masyarakat. Ini memberi Anda peluang besar untuk bertemu komunitas lokal dan menemukan orang-orang yang tertarik pada tantangan dan teknologi yang sama seperti Anda. Berhubungan dengan orang-orang di wilayah yang sama tempat Anda berada memberi Anda keuntungan untuk dapat menjangkau mereka dengan lebih mudah nanti karena mereka berada di zona waktu yang sama, bahkan mungkin di kota yang sama.
ko_kr: 이 행사는 하루나 이틀에 걸쳐 진행되며, 지역 사회의 최근 뜨거운 주제에 대한 프레젠테이션과 패널 토론으로 채워집니다. 지역사회를 만나 여러분과 같은 도전과 기술에 관심이 있는 사람들을 찾을 수 있는 좋은 기회를 제공합니다. 같은 지역에 있는 사람들과 연결하면 나중에 같은 시간대에 있을 수도 있고 같은 도시에 있을 수도 있기 때문에 더 쉽게 접근할 수 있는 이점을 얻을 수 있습니다.

source: The first period of a cycle includes more focus on planning, which is why the PTGs are scheduled right after the releases. This is the phase when you should upload your specs for review and use the mailing list, project channels and meetings on IRC to discuss any parts of your design that might be in question.
de: Die erste Periode eines Zyklus beinhaltet einen stärkeren Fokus auf die Planung, weshalb die PTGs direkt nach den Freigaben geplant werden. Dies ist die Phase, in der Sie Ihre Spezifikationen zur Überprüfung hochladen und die Mailingliste, Projektkanäle und Meetings im IRC nutzen sollten, um alle Teile Ihres Designs zu diskutieren, die in Frage kommen.
id: Periode pertama siklus mencakup lebih banyak fokus pada perencanaan, itulah sebabnya PTG dijadwalkan tepat setelah rilis. Ini adalah fase ketika Anda harus mengunggah spesifikasi Anda untuk ditinjau dan menggunakan milis, saluran proyek, dan pertemuan di IRC untuk membahas bagian mana pun dari desain Anda yang mungkin dipertanyakan.
ko_kr: 주기의 첫 번째 주기는 계획에 더 집중하기 때문에 PTG가 릴리스 직후에 예약됩니다. 이 단계는 문제가 될 수 있는 설계의 모든 부분에 대해 논의하기 위해 IRC의 메일링 목록, 프로젝트 채널 및 미팅을 검토하고 사용하기 위해 사양을 업로드해야 하는 단계입니다.

source: The first thing you'll want to do is sign up using this `mentor form <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_mentors>`_. This will get you into our spreadsheet of mentors so that we can keep track of who is working with which group so when we need to help bolster certain cohorts with calls for mentors, we can see who is already involved.
de: Das erste, was Sie tun möchten, ist sich mit diesem `Mentor-Formular <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_mentors>`_ anzumelden. Auf diese Weise gelangen Sie in unsere Tabelle der Mentoren, so dass wir verfolgen können, wer mit welcher Gruppe arbeitet, und wenn wir bestimmte Kohorten mit Aufrufen nach Mentoren unterstützen müssen, können wir sehen, wer bereits beteiligt ist.
id: Hal pertama yang ingin Anda lakukan adalah mendaftar menggunakan ini `mentor form <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_mentors>`_. Ini akan membawa Anda ke spreadsheet mentor kami sehingga kami dapat melacak siapa yang bekerja dengan kelompok mana sehingga ketika kami perlu membantu meningkatkan kohort tertentu dengan panggilan untuk mentor, kami dapat melihat siapa yang sudah terlibat.
ko_kr: 당신이 제일 먼저 하고 싶은 일은 이 `멘토 폼 <https://openstackfoundation.formstack.com/forms/mentoring_cohorts_mentors>`_ 양식을 사용하여 가입하는 것입니다. 이렇게 하면 멘토 스프레드시트로 이동하게 됩니다. 그러면 우리는 어떤 그룹과 함께 일하고 있는지 추적할 수 있습니다. 그래서 우리가 멘토에 대한 전화와 함께 특정 코호트를 지원해야 할 때, 우리는 누가 이미 연루되어 있는지 알 수 있습니다.

source: The fix has been merged into an official branch
de: Die Lösung wurde in einen offiziellen Zweig zusammengeführt
id: Perbaikan telah digabung menjadi cabang resmi
ko_kr: 수정 사항이 공식 branch로 병합되었습니다.

source: The following footer is required:
id: Footer berikut wajib diisi:
ko_kr: 다음 바닥글이 필요합니다.

source: The following footers are optional; however, their use is recommended if they are applicable to the patch:
id: Footer berikut ini opsional; namun, penggunaannya disarankan jika dapat diterapkan pada patch:
ko_kr: 다음 바닥글은 선택 사항이지만 패치에 적용할 수 있는 경우 사용하는 것이 좋습니다.

source: The four opens
de: Die vier opens
id: The four opens (empat terbuka)
ko_kr: 4 Open 이념

source: The irc_nick is the IRC nick of the person who is receiving the thanks. The message is a short text to explain the reason for the thanks. The bot collects all thanks to a `wiki page <https://wiki.openstack.org/wiki/Thanks>`__.
de: Der irc_nick ist der IRC-Nick der Person, die den Dank erhält. Die Nachricht ist ein kurzer Text, um den Grund für den Dank zu erklären. Der Bot sammelt alle Danks auf einer `Wiki-Seite <https://wiki.openstack.org/wiki/Thanks>`__.
id: Irc_nick adalah IRC nick dari orang yang menerima ucapan terima kasih. Pesannya adalah teks pendek untuk menjelaskan alasan terima kasih. Bot mengumpulkan semua berkat `wiki page <https://wiki.openstack.org/wiki/Terima kasih>` __.
ko_kr: irc_nick은 감사를 받는 사람의 IRC 닉입니다. 그 메시지는 감사의 이유를 설명하는 짧은 텍스트입니다. 이 봇은 `위키 페이지 <https://wiki.openstack.org/wiki/Thanks>`_ 덕분에 모든 것을 수집합니다.

source: The mailing list is where most day to day asynchronous interactions happen. Here is where you can get `subscribed and view ML archives <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-mentoring>`_.
de: Die Mailingliste ist der Ort, an dem die meisten asynchronen Interaktionen von Tag zu Tag stattfinden. Hier können Sie sich abonnieren und `ML-Archive ansehen <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-mentoring>`_.
id: Milis adalah tempat sebagian besar interaksi asinkron terjadi sehari-hari. Di sinilah Anda bisa mendapatkan `subscribed and view ML archives <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-mentoring>`_.
ko_kr: 메일 목록은 매일 비동기식 상호 작용이 발생하는 곳입니다. 여기에서는 `구독과 ML 아카이브 <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-mentoring>`_ 를 볼 수 있습니다.

source: The majority of the official OpenStack projects follow the release schedule set by the Release Management Team.
de: Die Mehrheit der offiziellen OpenStack-Projekte folgt dem vom Release Management Team festgelegten Release-Zeitplan.
id: Sebagian besar proyek OpenStack resmi mengikuti jadwal rilis yang ditetapkan oleh Release Management Team.
ko_kr: 대부분의 공식 OpenStack 프로젝트는 릴리스 관리 팀이 설정한 릴리스 일정을 따릅니다.

source: The purpose of the Forum is to provide space for the developer and user community to get together and discuss feedback and find solutions to problems and new challenges and requirements.
de: Ziel des Forums ist es, Raum für die Entwickler- und Nutzergemeinschaft zu schaffen, um sich zu treffen und Feedback zu diskutieren und Lösungen für Probleme und neue Herausforderungen und Anforderungen zu finden.
id: Tujuan Forum adalah untuk menyediakan ruang bagi pengembang dan komunitas pengguna untuk berkumpul dan mendiskusikan umpan balik dan menemukan solusi untuk masalah dan tantangan dan persyaratan baru.
ko_kr: 포럼의 목적은 개발자와 사용자 커뮤니티가 함께 모여 피드백을 논의하고 문제와 새로운 도전과 요구사항에 대한 해결책을 찾을 수 있는 공간을 제공하는 것입니다.

source: The services developed by the community are available as tarballs to install them from source and are also picked up and packaged to make it available for different Linux distributions or as part of OpenStack distributions.
de: Die von der Community entwickelten Dienste stehen als Tarballs zur Verfügung, um sie aus der Quelle zu installieren, und sie werden auch aufgenommen und verpackt, um sie für verschiedene Linux-Distributionen oder als Teil von OpenStack-Distributionen verfügbar zu machen.
id: Layanan yang dikembangkan oleh komunitas tersedia sebagai tarball untuk menginstalnya dari sumber dan juga diambil dan dikemas untuk membuatnya tersedia untuk distribusi Linux yang berbeda atau sebagai bagian dari distribusi OpenStack.
ko_kr: 커뮤니티에서 개발한 서비스는 소스로부터 설치할 수 있는 타르볼로 제공되며, 다양한 Linux 배포 또는 OpenStack 배포의 일부로 사용할 수 있도록 선택 및 패키징됩니다.

source: The sessions are grouped into two major parts, the conference and the Forum.
de: Die Sitzungen gliedern sich in zwei Hauptteile, die Konferenz und das Forum.
id: Sesi dikelompokkan menjadi dua bagian utama, konferensi dan Forum.
ko_kr: 세션은 회의와 포럼의 두 가지 주요 부분으로 그룹화됩니다.

source: The state of all OpenStack releases may be seen on the `OpenStack Releases <https://releases.openstack.org>`_ web page.
id: Keadaan semua rilis OpenStack dapat dilihat pada halaman web `OpenStack Releases <https://releases.openstack.org>` _.
ko_kr: 모든 OpenStack 릴리즈의 상태는 `OpenStack 릴리즈 <https://releases.openstack.org>`_ 웹 페이지에서 확인할 수 있습니다.

source: The summary line briefly describes the patch content. The character limit is 50 characters. The summary line should not end with a period. If the change is not finished at the time of the commit, start the commit message with WIP.
de: Die Summenzeile beschreibt kurz den Inhalt des Patches. Die Zeichenbeschränkung beträgt 50 Zeichen. Die Summenzeile sollte nicht mit einem Punkt enden. Wenn die Änderung zum Zeitpunkt der Übertragung noch nicht abgeschlossen ist, starten Sie die Commit-Nachricht mit WIP.
id: Baris ringkasan menjelaskan secara singkat konten patch. Batas karakter adalah 50 karakter. Baris ringkasan tidak boleh diakhiri dengan titik. Jika perubahan belum selesai pada saat komit, mulai pesan komit dengan WIP.
ko_kr: 요약 줄에는 패치 내용이 간략하게 설명되어 있습니다. 문자 제한은 50자입니다. 요약 줄은 마침표로 끝나서는 안 됩니다. 커밋 시점에 변경이 완료되지 않은 경우 WIP로 커밋 메시지를 시작합니다.

source: The third period of a release is focusing on finishing the implementation and testing of new functionality added during the release. You need to ensure to add new tests in Tempest and have documentation covered as well before the third milestone. During this phase the core review team can choose to focus on higher priority features only. They make their decision about priorities either at the PTG or soon after, some time before the first milestone of a release.
de: Die dritte Periode eines Releases konzentriert sich auf den Abschluss der Implementierung und das Testen der neuen Funktionen, die während des Releases hinzugefügt wurden. Sie müssen sicherstellen, dass Sie neue Tests in Tempest hinzufügen und die Dokumentation auch vor dem dritten Meilenstein abdecken. Während dieser Phase kann sich das Kernüberprüfungsteam nur auf Funktionen mit höherer Priorität konzentrieren. Sie treffen ihre Entscheidung über die Prioritäten entweder in der PTG oder kurz danach, einige Zeit vor dem ersten Meilenstein eines Releases.
id: Periode ketiga rilis berfokus pada penyelesaian implementasi dan pengujian fungsionalitas baru yang ditambahkan selama rilis. Anda perlu memastikan untuk menambahkan tes baru di Tempest dan memiliki dokumentasi yang tercakup juga sebelum tonggak ketiga. Selama fase ini tim peninjau inti dapat memilih untuk fokus hanya pada fitur-fitur prioritas tinggi. Mereka membuat keputusan tentang prioritas baik di PTG atau segera setelah itu, beberapa saat sebelum tonggak pertama rilis.
ko_kr: 세 번째 릴리즈는 릴리즈 중에 추가된 새로운 기능의 구현 및 테스트를 완료하는 데 초점을 맞추고 있습니다. Tempest에서 새 테스트를 추가해야 하며 세 번째 마일스톤 이전에 문서도 포함되어야 합니다. 이 단계에서 핵심 검토 팀은 우선순위가 높은 기능에만 집중할 수 있습니다. 그들은 PTG에서 또는 출시 첫 번째 마일스톤보다 얼마 안 있어 우선순위에 대한 결정을 내립니다.

source: The user community is crucial for OpenStack and their participation is highly encouraged.
de: Die Nutzergemeinde ist entscheidend für OpenStack und ihre Teilnahme wird sehr begrüßt.
id: Komunitas pengguna sangat penting untuk OpenStack dan partisipasi mereka sangat dianjurkan.
ko_kr: 사용자 커뮤니티는 OpenStack에 매우 중요하며 이러한 커뮤니티의 참여를 적극 권장합니다.

source: There are community organized events all year all around the globe. Be sure you `check <https://www.openstack.org/community/events/>`_ when the next one is in your area!
de: Es gibt das ganze Jahr über gemeinschaftlich organisierte Veranstaltungen auf der ganzen Welt. Achten Sie darauf, dass Sie `checken <https://www.openstack.org/community/events/>`_, wann der nächste in Ihrer Nähe ist!
id: Ada acara yang diselenggarakan komunitas sepanjang tahun di seluruh dunia. Pastikan kamu `check <https://www.openstack.org/community/events/>`_ ketika yang berikutnya ada di daerah Anda!
ko_kr: 전 세계적으로 1년 내내 커뮤니티 조직 행사가 있습니다. 다음이 당신 지역에 있을 때는 반드시 `확인 <https://www.openstack.org/community/events/>`_ 하세요!

source: There are lots of people working on OpenStack organized into different groups. These are described in the :ref:`special-interest-groups` section of the Governance chapter.
de: Es gibt viele Leute, die an OpenStack arbeiten, die in verschiedenen Gruppen organisiert sind. Diese sind im Abschnitt :ref:`special-interest-groups` des Kapitels Governance beschrieben.
id: Ada banyak orang yang bekerja pada OpenStack yang diorganisasikan ke dalam berbagai kelompok. Ini dijelaskan di bagian :ref:`special-interest-groups` pada bab Tata Kelola.
ko_kr: OpenStack에는 여러 그룹으로 구성된 많은 사람들이 있습니다. 이러한 내용은 거버넌스 장의 :ref:`special-interest-groups` 섹션에 설명되어 있습니다.

source: There are more than 40 different ML's. These are listed in the `mailman page <http://lists.openstack.org/cgi-bin/mailman/listinfo>`__. Mailing lists are a way for people to communicate to a larger group than those that are on IRC. All emails on these lists are archived and available on the `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`_ wiki. The same page describes how to subscribe to a list and describes some popular lists.
de: Es gibt mehr als 40 verschiedene ML's. Diese sind auf der `Mailman-Seite <http://lists.openstack.org/cgi-bin/mailman/listinfo>`__. Mailinglisten sind eine Möglichkeit für Menschen, mit einer größeren Gruppe zu kommunizieren als im IRC. Alle E-Mails auf diesen Listen werden archiviert und sind auf den `Mailinglisten <https://wiki.openstack.org/wiki/Mailing_Lists>`_ Wiki verfügbar. Auf der gleichen Seite wird beschrieben, wie man eine Liste abonniert, und es werden einige beliebte Listen beschrieben.
id: Ada lebih dari 40 ML yang berbeda. Ini tercantum dalam `mailman page <http://lists.openstack.org/cgi-bin/mailman/listinfo>`__. Milis adalah cara orang berkomunikasi dengan grup yang lebih besar daripada yang ada di IRC. Semua email pada daftar ini diarsipkan dan tersedia di wiki `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`_. Halaman yang sama menjelaskan cara berlangganan ke daftar dan menjelaskan beberapa daftar populer.
ko_kr: 40개 이상의 다양한 메일링 리스트가 있습니다. 이들은 `메일링 리스트 페이지 <http://lists.openstack.org/cgi-bin/mailman/listinfo>`_ 에 수록되어 있습니다. 메일링 리스트는 IRC에 있는 사람들보다 더 큰 그룹과 의사소통하는 방법입니다. 이 목록에 있는 모든 전자 메일은 보관되어 있으며 `메일링 목록 <https://wiki.openstack.org/wiki/Mailing_Lists>`_ wiki에 저장되어 있습니다. 같은 페이지에서는 리스트에 가입하는 방법과 인기 있는 리스트에 대해 설명합니다.

source: There is a Call For Papers (CFP) process before each Summit where anyone can propose sessions for the upcoming event. After the CFP deadline the proposals go through a community vote after which a group of track chairs decide about the final content for each track.
de: Vor jedem Gipfel gibt es einen Call For Papers (CFP)-Prozess, bei dem jeder Sitzungen für die bevorstehende Veranstaltung vorschlagen kann. Nach Ablauf der GFP-Frist durchlaufen die Vorschläge eine Gemeinschaftsabstimmung, nach der eine Gruppe von Track Chairs über den endgültigen Inhalt für jeden Track entscheidet.
id: Ada proses Call For Papers (CFP) sebelum setiap KTT di mana setiap orang dapat mengusulkan sesi untuk acara mendatang. Setelah batas waktu CFP, proposal melewati pemungutan suara komunitas dan setelah itu sekelompok kursi trek memutuskan tentang konten akhir untuk setiap trek.
ko_kr: 모든 사용자가 다가올 이벤트에 대한 세션을 제안할 수 있는 각 정상회담 전에 CFP(Call For Paper) 프로세스가 있습니다. CFP 마감일 이후 제안서는 커뮤니티 투표를 거쳐 트랙별 최종 내용을 트랙 의장 그룹이 결정합니다.

source: Therefore, having a stable gate pipeline is crucial and the clean check requirement will help with the stable jobs.
id: Oleh karena itu, memiliki pipeline gerbang yang stabil sangat penting dan persyaratan pemeriksaan yang bersih akan membantu pekerjaan yang stabil.
ko_kr: 따라서 안정적인 게이트 파이프라인을 확보하는 것이 매우 중요하며, 클린 체크 요구사항이 안정적인 작업에 도움이 될 것입니다.

source: These are different in that the name is what is used in the generated url and the title is what displays when blueprints are listed out (name: new_ibm_driver title: New IBM ISCSI Driver). The next most important part is the summary- a description of the code change, where most of the details about the implementation are. After that, there are several optional fields you may wish to fill in- a specification url, assignee, drafter, and approver. The last two fields before registering have default values- status and propose for a sprint. For most teams, it is typical to leave the default values.
de: Diese unterscheiden sich dadurch, dass der Name das ist, was in der generierten URL verwendet wird und der Titel das ist, was angezeigt wird, wenn Blueprints aufgelistet werden (Name: new_ibm_driver title: New IBM ISCSI Driver). Der nächste wichtige Teil ist die Zusammenfassung - eine Beschreibung der Code-Änderung, in der die meisten Details über die Implementierung enthalten sind. Danach gibt es mehrere optionale Felder, die Sie möglicherweise ausfüllen möchten, um eine Spezifikationsurl, einen Empfänger, einen Verfasser und einen Genehmigenden einzugeben. Die letzten beiden Felder vor der Registrierung haben einen Standardwert für Status und schlagen einen Sprint vor. Für die meisten Teams ist es typisch, die Standardwerte zu belassen.
id: Ini berbeda karena namanya adalah apa yang digunakan dalam url yang dihasilkan dan judulnya adalah apa yang ditampilkan ketika cetak biru dicantumkan (name: new_ibm_driver title: New IBM ISCSI Driver). Bagian terpenting berikutnya adalah ringkasan - deskripsi perubahan kode, di mana sebagian besar detail tentang implementasi berada. Setelah itu, ada beberapa bidang opsional yang mungkin ingin Anda isi dengan url spesifikasi, assignee, drafter, dan approver. Dua bidang terakhir sebelum mendaftar memiliki values- status default dan mengusulkan untuk sprint. Untuk sebagian besar tim, biasanya meninggalkan nilai default.
ko_kr: 이름은 생성된 URL에서 사용되는 이름과 Blueprint가 나열될 때 표시되는 제목(이름: new_ibm_driver 제목: 새로운 IBM ISCSI 드라이버)입니다. 다음으로 가장 중요한 부분은 코드 변경에 대한 설명으로, 구현에 대한 대부분의 세부사항이 요약되어 있습니다. 그런 다음 사양 URL, 피할당자, 드래프터 및 승인자 등 몇 가지 선택적 필드를 입력할 수 있습니다. 등록하기 전의 마지막 두 필드는 기본 값 - 상태 및 스프린트에 대한 제안입니다. 대부분의 팀에서는 기본값을 그대로 두는 것이 일반적입니다.

source: This avoids approving changes that have no hope of ever passing due to pep8 or other trivial errors.
id: Ini menghindari menyetujui perubahan yang tidak memiliki harapan untuk lulus karena pep8 atau kesalahan sepele lainnya.
ko_kr: 이는 pep8이나 다른 사소한 오류로 인해 통과될 가망이 없는 변경 사항을 승인하는 것을 방지합니다.

source: This bot allows people to recognize each other and be thankful. Anyone can post a message in the OpenStack IRC channels to say thanks. The way to say thanks is:
de: Dieser Bot ermöglicht es den Menschen, sich gegenseitig zu erkennen und dankbar zu sein. Jeder kann eine Nachricht in den OpenStack IRC-Kanälen posten, um sich zu bedanken. Der Weg, um Danke zu sagen, ist:
id: Bot ini memungkinkan orang untuk saling mengenali dan berterima kasih. Siapa pun dapat memposting pesan di saluran IRC OpenStack untuk mengucapkan terima kasih. Cara untuk mengucapkan terima kasih adalah:
ko_kr: 이 봇은 사람들이 서로를 알아보고 감사할 수 있도록 해줍니다. 누구나 OpenStack IRC 채널에 메시지를 게시하여 감사의 말을 전할 수 있습니다. 감사의 말을 하는 방법은 다음과 같습니다.

source: This event is created to provide space and time for developers and operators to get together and have detailed technical discussions.
de: Diese Veranstaltung soll Entwicklern und Betreibern Raum und Zeit bieten, sich zu treffen und detaillierte technische Diskussionen zu führen.
id: Acara ini dibuat untuk memberikan ruang dan waktu bagi pengembang dan operator untuk berkumpul dan melakukan diskusi teknis yang terperinci.
ko_kr: 이 이벤트는 개발자와 운영자가 함께 모여 자세한 기술 논의를 할 수 있는 공간과 시간을 제공하기 위해 만들어졌습니다.

source: This event is recommended to developers, operators and end users who are already involved in community activities. If you are a new comer you might want to consider one of the OpenStack Summits first where you can find several sessions to help you find your way within the community.
de: Diese Veranstaltung wird Entwicklern, Betreibern und Endanwendern empfohlen, die bereits an Community-Aktivitäten beteiligt sind. Wenn Sie ein Neuling sind, sollten Sie zuerst einen der OpenStack-Gipfel in Betracht ziehen, auf denen Sie mehrere Sitzungen finden, die Ihnen helfen, sich in der Community zurechtzufinden.
id: Acara ini direkomendasikan untuk pengembang, operator dan pengguna akhir yang sudah terlibat dalam kegiatan komunitas. Jika Anda seorang pendatang baru, Anda mungkin ingin mempertimbangkan salah satu dari OpenStack Summits terlebih dahulu di mana Anda dapat menemukan beberapa sesi untuk membantu Anda menemukan jalan Anda dalam komunitas.
ko_kr: 이 이벤트는 커뮤니티 활동에 이미 참여하고 있는 개발자, 운영자 및 최종 사용자에게 권장됩니다. 새로 온 사람이라면 커뮤니티 내에서 자신의 길을 찾는 데 도움이 되는 여러 세션을 찾을 수 있는 OpenStack Summits 중 하나를 먼저 고려해 보는 것이 좋습니다.

source: This is a valid issue, but it is the way it should be
de: Dies ist ein berechtigtes Thema, aber es ist die Art und Weise, wie es sein sollte
id: Ini adalah masalah yang valid, tetapi memang seharusnya begitu
ko_kr: 이것은 유효한 문제이지만, 이렇게 작동해야합니다.

source: This is a valid issue, but we don't intend to fix that
de: Dies ist ein berechtigtes Problem, aber wir beabsichtigen nicht, es zu beheben
id: Ini adalah masalah yang valid, tetapi kami tidak bermaksud memperbaikinya
ko_kr: 이것은 유효한 문제이지만, 우리는 그것을 고치고 싶지 않습니다.

source: This is not a bug
id: Ini bukan bug
ko_kr: 버그가 아닙니다

source: This is the review system the OpenStack community uses.
de: Dies ist das Bewertungssystem, das die OpenStack-Community verwendet.
id: Ini adalah sistem ulasan yang digunakan komunitas OpenStack.
ko_kr: 이것은 OpenStack 커뮤니티에서 사용하는 검토 시스템입니다.
