Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-code-and-documentation.po
Languages: de, id, ko_kr, zh_cn

source: DevStack is a modular set of scripts that can be run to deploy a basic OpenStack cloud for use as a demo or test environment. The scripts can be run on a single node that is baremetal or a virtual machine. It can also be configured to deploy to multiple nodes. DevStack deployment takes care of tedious tasks like configuring the database and message queueing system, making it possible for developers to quickly and easily deploy an OpenStack cloud.
de: DevStack ist ein modularer Satz von Skripten, die ausgeführt werden können, um eine grundlegende OpenStack-Cloud für die Verwendung als Demo- oder Testumgebung bereitzustellen. Die Skripte können auf einem einzelnen Knoten ausgeführt werden, der baremetal oder eine virtuelle Maschine ist. Es kann auch für die Bereitstellung auf mehreren Knoten konfiguriert werden. Die DevStack-Bereitstellung übernimmt lästige Aufgaben wie die Konfiguration des Datenbank- und Nachrichtenwarteschlangensystems und ermöglicht es Entwicklern, eine OpenStack-Cloud schnell und einfach bereitzustellen.
id: DevStack adalah sekumpulan skrip modular yang dapat dijalankan untuk menggunakan cloud OpenStack dasar untuk digunakan sebagai demo atau lingkungan pengujian. Skrip dapat dijalankan pada satu node yang baremetal atau mesin virtual. Itu juga dapat dikonfigurasi untuk digunakan ke beberapa node. Penyebaran DevStack menangani tugas-tugas yang membosankan seperti mengkonfigurasi database dan sistem antrian pesan, sehingga memungkinkan bagi pengembang untuk secara cepat dan mudah menggunakan cloud OpenStack.
ko_kr: DevStack은 데모 또는 테스트 환경을 위해 기본적인 OpenStack 클라우드를 배포할 수 있도록 실행할 수 있는 모듈화된 스크립트에 대한 집합입니다. 해당 스크립트는 베어메탈 또는 가상 머신과 같은 단일 노드에서 실행할 수 있습니다. 또한 멀티 노드로 배포하도록 구성할 수도 있습니다. DevStack 배포는 데이터베이스와 메시지 큐 시스템을 구성하는 것과 같은 번거로운 작업들을 다루며, 개발자들이 빠르고 쉽게 OpenStack 클라우드를 배포하는 것을 가능하게 해 줍니다.
zh_cn: DevStack是一组模块化脚本，通过运行这些脚本来部署基本的OpenStack云，以便用作演示或测试环境。 这些脚本可以在裸机或虚拟机的单个节点上运行。 也可以将其配置用于部署到多个节点。 DevStack部署能够处理繁琐的任务，例如配置数据库和消息排队系统，使开发人员可以快速轻松地部署OpenStack云。

source: DevStack uses the code in those directories to run the OpenStack services so any change may be tested by making a code change in the project's directory and then by restarting the project's service through systemd.
de: DevStack verwendet den Code in diesen Verzeichnissen, um die OpenStack-Dienste auszuführen, so dass jede Änderung getestet werden kann, indem eine Code-Änderung im Projektverzeichnis vorgenommen wird und dann der Dienst des Projekts durch systemd neu gestartet wird.
id: DevStack menggunakan kode di direktori tersebut untuk menjalankan layanan OpenStack sehingga setiap perubahan dapat diuji dengan membuat perubahan kode di direktori proyek dan kemudian dengan me-restart layanan proyek melalui systemd.
ko_kr: DevStack은 해당 디렉토리의 코드를 사용하여 OpenStack 서비스를 실행하므로 프로젝트 디렉토리에서 코드를 변경 한 다음 systemd를 통해 프로젝트 서비스를 재시작하여 변경 사항을 테스트 할 수 있습니다.
zh_cn: DevStack使用这些目录中的代码来运行OpenStack服务，因此可以通过更改项目目录中的代码，然后通过systemd重新启动项目服务来测试任何更改。

source: DevStack's full documentation can be found `here <https://docs.openstack.org/devstack/latest>`_.
de: Die vollständige Dokumentation von DevStack finden Sie `hier <https://docs.openstack.org/devstack/latest>``_.
id: Dokumentasi lengkap DevStack dapat ditemukan `here <https://docs.openstack.org/devstack/latest>`_.
ko_kr: DevStack 전체 문서는 `여기 <https://docs.openstack.org/devstack/latest>`_ 에서 확인하실 수 있습니다.
zh_cn: DevStack的完整文档可以在 `here <https://docs.openstack.org/devstack/latest>`_ 找到.

source: Developers need an easy way to deploy an OpenStack cloud to do functional and interoperability testing of changes. This is the purpose of DevStack.
de: Entwickler benötigen eine einfache Möglichkeit, eine OpenStack-Cloud bereitzustellen, um Funktions- und Interoperabilitätstests von Änderungen durchzuführen. Dies ist der Zweck von DevStack.
id: Pengembang membutuhkan cara mudah untuk menggunakan cloud OpenStack untuk melakukan pengujian perubahan fungsional dan interoperabilitas. Ini adalah tujuan dari DevStack.
ko_kr: 개발자들은 잘 동작하는지 그리고 변경 사항을 테스트하는데 있어 상호운용성이 어떤지를 확인하기 위해 OpenStack 클라우드를 쉽게 배포하고 싶어합니다. 이것이 DevStack을 사용하는 목적입니다.
zh_cn: 开发人员需要一种简单的方法来部署OpenStack云以便对更改进行功能性和互操作性测试。 这就是DevStack的目的。

source: Documentation
ko_kr: 문서
zh_cn: 文档

source: Documents in project repositories
ko_kr: 프로젝트 저장소안의 문서들
zh_cn: 项目仓库中的文档

source: Each graph shows how many matches were found for that fingerprint over the past 10 days. It also provides a link to both the launchpad page for the bug, and the kibana dashboard for the underlying elastic-search query used for the fingerprint.
de: Jede Grafik zeigt, wie viele Übereinstimmungen für diesen Fingerabdruck in den letzten 10 Tagen gefunden wurden. Es bietet auch einen Link sowohl zur Launchpad-Seite für den Bug als auch zum Kibana Dashboard für die zugrunde liegende elastische Suchanfrage, die für den Fingerabdruck verwendet wird.
id: Setiap grafik menunjukkan berapa banyak kecocokan yang ditemukan untuk fingerprint itu selama 10 hari terakhir. Ini juga menyediakan tautan ke halaman launchpad untuk bug, dan dasbor kibana untuk kueri elastic-search yang digunakan untuk fingerprint.
ko_kr: 각 그래프는 지난 10 일 동안 해당 지문과 일치하는 항목 수를 보여줍니다. 또한 버그에 대한 런치 패드 페이지와 지문에 사용되는 기본 elastic-search 쿼리에 대한 kibana 대시 보드에 대한 링크를 제공합니다.

source: Each project's database is created and populated
de: Die Datenbank jedes Projekts wird erstellt und ausgefüllt.
id: Setiap database proyek dibuat dan diisi
ko_kr: 각 프로젝트에 대한 데이터베이스가 생성되고 사용 가능하도록 구성됩니다
zh_cn: 创建并填充每个项目的数据库

source: Enhance the automatic testing the community does on every patch submitted to gerrit
de: Verbessern Sie die automatischen Tests, die die Community bei jedem Patch durchführt, der bei gerrit eingereicht wird.
id: Tingkatkan pengujian otomatis yang dilakukan komunitas pada setiap patch yang dikirimkan ke gerrit
ko_kr: gerrit에 제출 된 모든 패치에 대해 커뮤니티가 수행하는 자동 테스트를 향상시킵니다.
zh_cn: 增强社区对提交给gerrit的每个补丁所做的自动测试

source: Even if you have a chain of patches you still need to keep code changes and related tests in one patch as you cannot guarantee that both land in time for a release.
de: Selbst wenn Sie eine Kette von Patches haben, müssen Sie Code-Änderungen und zugehörige Tests in einem Patch aufbewahren, da Sie nicht garantieren können, dass beide rechtzeitig für eine Veröffentlichung landen.
id: Bahkan jika Anda memiliki rantai tambalan Anda masih perlu menyimpan perubahan kode dan tes terkait dalam satu patch karena Anda tidak dapat menjamin bahwa keduanya tiba pada waktunya untuk rilis.
ko_kr: 패치 체인이 있는 경우에도 릴리즈에 맞춰 두 패치가 모두 도착한다고 보장할 수 없기 때문에, 코드 변경 및 관련 테스트를 하나의 패치에 보관해야 합니다.
zh_cn: 即使有一组补丁链，您仍需要将代码更改和相关测试保留在一个补丁中，因为您不能保证两个部分都能及时整合进一次发布中。

source: Find your project in the file.
ko_kr: 파일에서 프로젝트를 찾으십시오.
zh_cn: 在文件中找到您的项目

source: First-timers can refer to the :doc:`quick-start` Guide.
ko_kr: 처음 시작하는 사람들은 :doc:`quick-start` 를 참고할 수 있습니다

source: Following is a list of the commands that you need to know for your first contribution:
de: Im Folgenden finden Sie eine Liste der Befehle, die Sie für Ihren ersten Beitrag kennen müssen:
id: Berikut ini adalah daftar perintah yang perlu Anda ketahui untuk kontribusi pertama Anda:
ko_kr: 다음은 첫 번째 기여를 위해 알아야 할 명령 목록입니다.
zh_cn: 以下是您首次贡献时需要了解的命令列表：

source: For a more in-depth look at managing patch chains, see :doc:`/code-and-documentation/patch-series-tutorial`.
id: Untuk melihat lebih dalam tentang mengelola rantai tambalan, lihat :doc:`/code-and-documentation/patch-series-tutorial`.
ko_kr: 패치 체인 관리에 대한 자세한 내용은 :doc:`/code-and-documentation/patch-series-tutorial` 을 참조하시기 바랍니다.
zh_cn: 有关管理补丁链的更深入的信息，请参见 :doc:`/code-and-documentation/patch-series-tutorial` 。

source: For further details on contributing to the OpenStack community, please refer to :doc:`../index`.
ko_kr: OpenStack 커뮤니티에 기여하는 방법에 대한 자세한 내용은 :doc:`index` 를 참조하시기 바랍니다.

source: For the project documents to be linked to on the `OpenStack documentation portal`_, the ``www/project-data/latest.yaml`` file in the ``openstack-manuals`` repository has to be updated, following the rules of the `template generator`_.
ko_kr: 프로젝트 문서를 `OpenStack documentation portal`_ 에 링크하려면 ``openstack-manuals`` 저장소의 ``www/project-data/latest.yaml`` 파일을 `template generator`_ 규칙에 따라 업데이트해야합니다.
zh_cn: 为了将项目文档链接到 `OpenStack documentation portal`_ 上，在 ``openstack-manuals`` 仓库中的 ``www/project-data/latest.yaml`` 文件必须遵循 `template generator`_ 的规则进行更新。

source: Further down the file is the ``Using milestone-proposed branches`` section. These are the variables that can be changed if you wish to clone a branch other than master for one or more projects.
de: Weiter unten in der Datei befindet sich der Abschnitt "Using milestone-proposed branches". Dies sind die Variablen, die geändert werden können, wenn Sie einen anderen Zweig als den Master für ein oder mehrere Projekte klonen möchten.
id: Lebih jauh ke bawah file adalah bagian ``Using milestone-proposed branches``. Ini adalah variabel yang dapat diubah jika Anda ingin mengkloning cabang selain master untuk satu atau lebih proyek.
ko_kr: 파일 아래 부분을 살펴보면 ``Using milestone-proposed branches`` 섹션이 있습니다. 하나 이상의 프로젝트에 대해 master 가 아닌 브랜치를 클론하고 싶은 경우에 해당 변수를 변경할 수 있습니다.
zh_cn: 在文件的最下方是 ``Using milestone-proposed branches`` 部分。 如果您希望为一个或多个项目克隆主分支以外的分支，则可以更改这部分变量。

source: General Information
de: Allgemeine Informationen
id: Informasi Umum
ko_kr: 일반 정보
zh_cn: 通用信息

source: Gerrit Topics
id: Topik Gerrit
ko_kr: 게릿 주제
zh_cn: Gerrit标题

source: Gerrit Web Editor
id: Editor Web Gerrit
ko_kr: Gerritt 웹 편집기
zh_cn: Gerrit网络编辑器

source: Gerrit allows you:
de: Gerrit erlaubt es Ihnen:
id: Gerrit memungkinkan Anda:
ko_kr: 게리트는 다음을 가능하게 합니다.
zh_cn: Gerrit允许您：

source: Gerrit also provides you options to edit the patch itself or only the commit message and a few more for more advanced changes, like modifying the author.
id: Gerrit juga menyediakan opsi untuk mengedit patch itu sendiri atau hanya pesan komit dan beberapa lagi untuk perubahan lebih lanjut, seperti memodifikasi pembuat.
ko_kr: 또한 Gerritt는 패치 자체를 편집하거나 커밋 메시지만 편집하는 옵션과 작성자 수정과 같은 고급 변경 사항에 대한 몇 가지 추가 옵션을 제공합니다.
zh_cn: Gerrit还为您提供了编辑补丁本身或仅提交消息的选项，还有更多选项可用于更高级的更改，例如修改作者。

source: Get an overview of the available projects for practice
de: Verschaffen Sie sich einen Überblick über die verfügbaren Projekte für die Praxis.
id: Dapatkan ikhtisar proyek yang tersedia untuk praktik
ko_kr: 사용 가능한 프로젝트의 개요를 실습에 활용합니다.
zh_cn: 获取可用于实践的项目概述

source: Get guidelines on how to use them
de: Holen Sie sich Richtlinien, wie Sie sie verwenden können.
id: Dapatkan panduan tentang cara menggunakannya
ko_kr: 사용 방법에 대한 지침을 확인합니다.
zh_cn: 获取如何使用他们的指南

source: Get reviews on your changes proposed to OpenStack repositories
de: Erhalten Sie Bewertungen zu Ihren Änderungsvorschlägen für OpenStack-Repositories.
id: Dapatkan ulasan tentang perubahan yang Anda usulkan ke repositori OpenStack
ko_kr: OpenStack 저장소에 제안된 변경 사항에 대한 리뷰를 받을 수 있습니다.
zh_cn: 获取有关对OpenStack仓库建议的更改的审核

source: Getting and Configuring DevStack
de: Holen und Konfigurieren von DevStack
id: Mendapatkan dan Mengkonfigurasi DevStack
ko_kr: DevStack 가져오기 및 구성하기
zh_cn: 获取和配置DevStack

source: Git is a version control system that we use to track changes to our source code and documentation.
de: Git ist ein Versionskontrollsystem, mit dem wir Änderungen an unserem Quellcode und unserer Dokumentation verfolgen.
id: Git adalah sistem kontrol versi yang kami gunakan untuk melacak perubahan pada kode sumber dan dokumentasi kami.
ko_kr: Git은 소스 코드 및 설명서의 변경 사항을 추적하는 데 사용하는 버전 제어 시스템입니다.
zh_cn: Git是一个版本控制系统，我们用于跟踪针对源代码和文档的更改。

source: Here is a quick overview of the `Gerrit Workflow <https://docs.opendev.org/opendev/infra-manual/latest/developers.html#quick-reference>`_
ko_kr: 다음은 `Gerrit 워크플로우 <https://docs.opendev.org/opendev/infra-manual/latest/developers.html#quick-reference>`_ 에 대한 간략한 개요입니다.

source: Here is an example of what that process would look like. In this example a change is made to Cinder's LVM driver:
de: Hier ist ein Beispiel dafür, wie dieser Prozess aussehen würde. In diesem Beispiel wird eine Änderung am LVM-Treiber von Cinder vorgenommen:
id: Ini adalah contoh bagaimana proses itu akan terlihat. Dalam contoh ini perubahan dibuat untuk driver LVM Cinder:
ko_kr: 여기 프로세스가 어떻게 되는지 예시가 있습니다. 이 예시에서는 Cinder의 LVM 드라이버를 변경하겠습니다.
zh_cn: 这是上面流程的一个示例。 在示例中，对Cinder的LVM驱动程序进行了更改：

source: Here we go.
id: Kita mulai.
ko_kr: 시작해봅시다
zh_cn: 我们开始吧!

source: How to Become a Patch Guru?
de: Wie werde ich Patch-Guru?
id: Bagaimana cara menjadi Patch Guru?
ko_kr: Patch Guru가 되는 방법?
zh_cn: 如何成为补丁大师？

source: How to Handle Chains?
de: Wie geht man mit Ketten um?
id: Bagaimana Cara Menangani Rantai (Chains) ?
ko_kr: 어떻게 체인을 다룰 수 있습니까?
zh_cn: 如何处理补丁链

source: How to Structure Your Changes?
de: Wie strukturiert man seine Änderungen?
id: Bagaimana Menyusun Perubahan Anda?
ko_kr: 어떻게 하면 변화를 구조화할 수 있을까요?
zh_cn: 如何组织您的更改？

source: How to Use the Sandbox Projects
de: Wie man die Sandbox-Projekte verwendet
id: Cara Menggunakan Proyek Sandbox
ko_kr: 샌드박스 프로젝트를 사용하는 방법
zh_cn: 如何使用沙箱项目

source: Hypervisor clean-up
de: Hypervisor-Bereinigung
id: Pembersihan hypervisor
ko_kr: 하이퍼바이저 정리
zh_cn: 清理Hypervisor

source: I fix ``lower-constraints.txt``:
id: Saya memperbaiki ``lower-constraints.txt``:
ko_kr: 저는 ``하위 기질`` 을 고칩니다. txtrights는 다음과 같습니다.
zh_cn: 我修复了 ``lower-constraints.txt`` ：

source: I just made commit ``d76195e`` on top of ``3d008a3``. You'll notice my branch name (``bp/nova-cyborg-interaction``) came along with me.
id: Saya baru saja membuat komit ``d76195e`` di atas ``3d008a3``. Anda akan melihat nama cabang saya (``bp/nova-cyborg-interaction``) datang bersama saya.
ko_kr: 저는 방금 ``3d008a3`` 에 덧붙여 ``d76195e`` 를 commit 했습니다. 제 지점 이름(`` bp/nova-cyborg-interaction`` )이 저와 함께 온 것을 보실 수 있을 겁니다.
zh_cn: 我刚刚在 ``3d008a3`` 之上提交了 ``d76195e`` 。 您会注意到我的分支名称（ ``bp/nova-cyborg-interaction`` ）与我一同出现了。

source: I want to fix the first one, so I change ``pick`` to ``edit``:
id: Saya ingin memperbaiki yang pertama, jadi saya mengubah ``pick`` menjadi `` edit``:
ko_kr: 첫 번째 것을 고치고 싶어서 ``pick`` 을 ``edit`` 으로 바꿉니다.
zh_cn: 我想修复第一个，因此将 ``pick`` 更改为 ``edit`` ：

source: If I had a taller series, and I had changed ``pick`` to ``edit`` for more than one commit, I would now be sitting on the next one I needed to edit. As it is, that was the only thing I needed to do, so I'm done and sitting on the top of my series again.
id: Jika saya memiliki seri yang lebih tinggi, dan saya telah mengubah ``pick`` menjadi ``edit`` untuk lebih dari satu komit, sekarang saya akan duduk di yang berikutnya yang perlu saya edit. Seperti itu, itu adalah satu-satunya hal yang perlu saya lakukan, jadi saya sudah selesai dan duduk di bagian atas seri saya lagi.
ko_kr: 만약 제가 더 큰 시리즈를 가지고 있고, 제가 ``pick`` 을 ``edit`` 으로 바꿔서 한 번 이상의 약속을 했다면, 저는 지금 편집해야 할 다음 편에 앉아 있을 것입니다. 지금 상태로는, 그것만이 제가 할 수 있는 유일한 일이었기 때문에, 저는 일을 끝내고 다시 제 시리즈의 맨 위에 앉았습니다.
zh_cn: 如果我有一个更高的系列，并且已经为超过一次提交将 ``pick`` 更改成了 ``edit`` ，那么我现在可能处于我需要编辑的下一个提交上。 实际上，这是我唯一需要做的事情，所以我已经完成并再次处于我的系列的顶部。

source: If OpenStack was successfully deployed by DevStack you should be able to point a web browser at the IP specified by ``HOST_IP`` in ``local.conf`` and access Horizon.
de: Wenn OpenStack erfolgreich von DevStack bereitgestellt wurde, sollten Sie in der Lage sein, einen Webbrowser auf die durch ``HOST_IP`` in `local.conf`` spezifizierte IP zu zeigen und auf Horizon zuzugreifen.
id: Jika OpenStack berhasil digunakan oleh DevStack Anda harus dapat mengarahkan browser web ke IP yang ditentukan oleh ``HOST_IP`` di ``local.conf`` dan mengakses Horizon.
ko_kr: OpenStack이 DevStack에 의해 성공적으로 배포 완료되었다면 웹 브라우저에서 ``local.conf`` 에 설정한 ``HOST_IP`` IP를 지정하여 접속할 수 있으며 Horizon에 접근 가능할 것입니다.
zh_cn: 如果OpenStack已由DevStack成功部署，则您应该能够用网络浏览器登录 ``local.conf`` 中 ``HOST_IP`` 所指定的IP并访问Horizon。

source: If a change is found to be flawed later, it may be necessary to revert the broken commit. This is much easier to do if there are not other unrelated code changes entangled with the original commit.
ko_kr: 나중에 변경 사항에 결함이 있는 것으로 밝혀지면, 결함이 있는 커밋을 되돌려야 할 수도 있습니다. 이 때 커밋에서 변경하고자 했던 것과 관련 없는 코드가 없다면, 훨씬 더 쉽게 수행할 수 있습니다.

source: If successful, the Git response message will contain a URL you can use to track your changes.
de: Wenn dies erfolgreich ist, enthält die Git-Antwortnachricht eine URL, mit der Sie Ihre Änderungen verfolgen können.
id: Jika berhasil, respons pesan Git akan berisi URL yang dapat digunakan untuk penelusuran perubahan Anda.
ko_kr: 성공하면 Git 응답 메시지에 변경 내용을 추적하는 데 사용할 수 있는 URL이 포함됩니다.
zh_cn: 如果成功，则Git响应消息将包含一个URL，您可以使用该URL来跟踪您的更改。

source: If the above structure exists in the project repository and the ``latest.yaml`` file is updated, the ``publish-openstack-sphinx-docs`` job in the ``project-config`` repo automatically includes the document in the published documentation. For detailed instructions, see the `Project guide setup`_.
ko_kr: 위의 구조가 프로젝트 저장소에 존재하고 ``latest.yaml`` 파일이 업데이트되면 ``project-config`` 저장소의 ``publish-openstack-sphinx-docs`` 작업은 자동으로 공개된 문서에 포함됩니다. 자세한 설명은 `Project guide setup`_ 을 참조하세요.
zh_cn: 如果项目仓库中存在上述结构，并且 ``latest.yaml`` 文件已更新，则 ``project-config`` 仓库中的 ``publish-openstack-sphinx-docs`` 作业会自动将文档包含在已发布的文档。 有关详细说明，请参见 `Project guide setup`_ 。

source: If you are a visual learner, you may prefer `this video <https://www.youtube.com/watch?v=mHyvP7zp4Ko&list=PLR97FKPZ-mD9XJCfwDE5c-td9lZGIPfS5&index=4>`_ which does roughly the same thing (but without ``git-restack``).
id: Jika Anda seorang pembelajar visual, Anda dapat memilih `video ini <https://www.youtube.com/watch?v=mHyvP7zp4Ko&list=PLR97FKPZ-mD9XJCfwDE5c-td9lZGIPfS5&index=4>` _ yang melakukan hal yang hampir sama (tetapi tanpa ``git-restack``))
ko_kr: 만약 여러분이 시각 학습자라면 거의 같은 일을 하는 `이 비디오 <https://www.youtube.com/watch?v=mHyvP7zp4Ko&list=PLR97FKPZ-mD9XJCfwDE5c-td9lZGIPfS5&index=4>`_ 을 선호할 수도 있습니다(그러나 ``git-restack`` 은 제외).

source: If you can, test the code! In some cases you may not have access to the specific hardware needed, but in general you should be able to test the changes or look at the zuul build of the documentation so that you are doing more than just looking at the code or documentation change.
de: Wenn Sie können, testen Sie den Code! In einigen Fällen haben Sie vielleicht keinen Zugriff auf die benötigte Hardware, aber im Allgemeinen sollten Sie in der Lage sein, die Änderungen zu testen oder sich den zuul build der Dokumentation anzusehen, so dass Sie mehr tun, als nur den Code oder die Änderung der Dokumentation zu betrachten.
id: Jika bisa, uji kodenya! Dalam beberapa kasus Anda mungkin tidak memiliki akses ke perangkat keras tertentu yang diperlukan, tetapi secara umum Anda harus dapat menguji perubahan atau melihat zuul build dari dokumentasi sehingga Anda melakukan lebih dari sekadar melihat kode atau perubahan dokumentasi.
ko_kr: 가능하다면 코드를 테스트해 보세요! 경우에 따라 필요한 특정 하드웨어에 액세스하지 못할 수도 있지만 일반적으로 변경 사항을 테스트하거나 문서의 zuul 빌드를 확인하여 코드 또는 문서 변경만 확인하는 것이 아니라 다른 작업을 수행할 수 있어야 합니다.
zh_cn: 如果可以，请测试代码！ 在某些情况下，您可能无权访问所需的特定硬件，但总的来说，您应该能够测试所做的更改或查看文档的zuul构建版本，因此您要做的不仅仅是查看代码或文档的更改。

source: If you have questions about the way something is phrased or done, or have found some other issue the easiest way to let the author of the patch know is to comment on that place inline. The inline comments are posted collectively when you hit the 'Reply' button and add your vote on the patchset.
de: Wenn Sie Fragen zur Art und Weise haben, wie etwas formuliert oder getan wird, oder wenn Sie ein anderes Problem gefunden haben, ist der einfachste Weg, den Autor des Patches wissen zu lassen, der Kommentar zu diesem Ort inline. Die Inline-Kommentare werden gemeinsam veröffentlicht, wenn Sie auf die Schaltfläche "Antworten" klicken und Ihre Stimme zum Patchset hinzufügen.
id: Jika Anda memiliki pertanyaan tentang cara sesuatu diungkapkan atau dilakukan, atau telah menemukan beberapa masalah lain, cara termudah untuk memberi tahu pembuat patch adalah mengomentari tempat tersebut secara inline. Komentar sebaris diposting secara kolektif ketika Anda menekan tombol 'Reply' dan menambahkan suara Anda di patchset.
ko_kr: 어떤 것이 표현되거나 수행되는 방식에 대해 질문이 있거나 다른 문제를 발견한 경우 패치 작성자에게 가장 쉽게 해당 플레이스에 대한 의견을 제시할 수 있습니다. 인라인 코멘트는 '응답하라' 버튼을 누르고 패치셋에 투표를 추가하면 일괄적으로 게시됩니다.
zh_cn: 如果您对补丁的某些措辞或完成方式有疑问，或者发现了其他问题，让补丁的作者知道的最简单方法是在行内的该位置上进行评论。 当您单击“答复”按钮并在补丁集上添加投票时，这些行内评论会集体发布。

source: If you need to make further changes to the same review, you can commit them using::
de: Wenn Sie weitere Änderungen an derselben Überprüfung vornehmen müssen, können Sie diese mit::
id: Jika Anda perlu membuat perubahan lebih lanjut pada ulasan yang sama, Anda bisa mengkomitnya using::
ko_kr: 동일한 검토 내용을 추가로 변경해야 하는 경우 다음을 사용하여 변경할 수 있습니다.
zh_cn: 如果您需要对同一审核进行进一步的更改，则可以使用::

source: If you only need to modify the top patch in the chain that can be done the same way as you update individual patches.
de: Wenn Sie nur den oberen Patch in der Kette ändern müssen, kann dies auf die gleiche Weise geschehen, wie Sie einzelne Patches aktualisieren.
id: Jika Anda hanya perlu memodifikasi patch teratas dalam rantai yang dapat dilakukan dengan cara yang sama seperti Anda memperbarui patch individu.
ko_kr: 개별 패치를 업데이트하는 것과 동일한 방식으로 체인의 상위 패치만 수정하면 되는 경우입니다.
zh_cn: 如果只需要修改补丁链中的顶层补丁，可以用更新单个补丁的方式来完成。

source: If you review a patch you are automatically added to the list of reviewers.
de: Wenn Sie einen Patch überprüfen, werden Sie automatisch zur Liste der Prüfer hinzugefügt.
id: Jika Anda mengulas patch Anda secara otomatis ditambahkan ke daftar pengulas.
ko_kr: 패치를 검토하면 검토자 목록에 자동으로 추가됩니다.
zh_cn: 如果您审阅了一个补丁，则会自动被添加到审阅者列表中。

source: If you're interested in more of the theory and history behind the project, this talk from the Juno OpenStack Summit provides a good overview: `Elastic Recheck - Tools for Finding Race Conditions in OpenStack <https://www.youtube.com/watch?v=Byo26Pioq1Y>`_
de: Wenn Sie sich für mehr über die Theorie und Geschichte des Projekts interessieren, bietet dieser Vortrag vom Juno OpenStack Summit einen guten Überblick: `Elastische Nachprüfung - Werkzeuge zur Ermittlung von Rennbedingungen in OpenStack <https://www.youtube.com/watch?v=Byo26Pioq1Y>``_
id: Jika Anda lebih tertarik pada teori dan sejarah di balik proyek ini, ceramah dari Juno OpenStack Summit ini memberikan gambaran yang bagus: `Elastic Recheck - Tools for Finding Race Conditions in OpenStack <https://www.youtube.com/watch?v=Byo26Pioq1Y>`_
ko_kr: 프로젝트의 이론과 역사에 더 관심이 있다면 주노 오픈스택 서밋의 이번 강연에서 `Elastic Recheck - OpenStack 에서 Race Conditions을 찾기 위한 도구들 <https://www.youtube.com/watch?v=Byo26Pioq1Y>`_ 이라는 좋은 개요를 제공합니다.

source: If your commit depends on a change which has been updated since you started your work, and you need to get the latest patchset from that change, you can cherry-pick your own changes on top of it:
de: Wenn Ihr Commit von einer Änderung abhängt, die seit Beginn Ihrer Arbeit aktualisiert wurde, und Sie das neueste Patchset von dieser Änderung erhalten müssen, können Sie Ihre eigenen Änderungen darüber hinaus auswählen:
id: Jika komit Anda bergantung pada perubahan yang telah diperbarui sejak Anda memulai pekerjaan Anda, dan Anda perlu mendapatkan patchset terbaru dari perubahan itu, Anda dapat memilih perubahan sendiri di atasnya:
ko_kr: 작업을 시작한 이후 업데이트된 변경 사항에 따라 커밋이 달라지고 해당 변경에서 최신 패치 집합을 얻어야 하는 경우, 해당 변경 사항 위에 자신의 변경 사항을 직접 선택할 수 있습니다.
zh_cn: 如果您的提交依赖于自您开始工作以来已更新的更改，并且您需要从该更改中获取最新的补丁集，则可以在该更改之上拣选您自己的更改：

source: If your patch gets a -1 it is not bad news, it just means you need to do a little more work.
de: Wenn Ihr Patch einen -1 erhält, ist es keine schlechte Nachricht, es bedeutet nur, dass Sie noch ein wenig mehr Arbeit erledigen mössen.
id: Jika patch Anda mendapatkan -1, itu bukan berita buruk, itu hanya berarti Anda perlu melakukan lebih banyak pekerjaan.
ko_kr: 패치가 -1을 얻는다면 나쁜 소식은 아니지만, 단지 조금 더 많은 작업을 해야 한다는 의미일 뿐입니다.
zh_cn: 如果您的补丁得到了-1，这不是一个坏消息，这仅意味着您需要做更多的修改。
