Repository: openstack/contributor-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-code-and-documentation.po
Languages: de, id, ko_kr, zh_cn

source: Once testing and development of your code change is complete you will want to push your code change to Gerrit for review. Since the projects in ``/opt/stack`` are already synced to their respective git repository you can configure `git review <https://docs.openstack.org/contributors/code-and-documentation/using-gerrit.html>`_, commit your change and upload the changes to Gerrit.
de: Sobald das Testen und Entwickeln Ihrer Codeänderung abgeschlossen ist, werden Sie Ihre Codeänderung zur Überprüfung an Gerrit weiterleiten wollen. Da die Projekte in ``/opt/stack`` bereits mit dem jeweiligen Git-Repository synchronisiert sind, können Sie `Git Review <https://docs.openstack.org/contributors/code-and-documentation/using-gerrit.html>``_ konfigurieren, Ihre Änderung übertragen und die Änderungen in Gerrit hochladen.
id: Setelah pengujian dan pengembangan perubahan kode Anda selesai, Anda akan ingin mendorong perubahan kode Anda ke Gerrit untuk ditinjau. Karena proyek-proyek di ``/opt/stack`` sudah disinkronkan ke repositori git masing-masing, Anda dapat mengonfigurasi `git review <https://docs.openstack.org/contributors/code-and-documentation/using-gerrit.html>`_, komit perubahan Anda dan unggah perubahan ke Gerrit.
ko_kr: 코드 변경 테스트 및 개발이 완료되면 검토를 위해 코드 변경 사항을 Gerrit에 푸시해야합니다. `/opt/stack`` 에 있는 프로젝트는 이미 해당 git 저장소에 동기화되어 있으므로 `git review <https://docs.openstack.org/contributors/code-and-documentation/using-gerrit.html>`_ , 변경 사항을 커밋하고 Gerrit에 변경 사항을 업로드하십시오.
zh_cn: 一旦完成代码更改的测试和开发，您将需要将代码更改推送给Gerrit进行审查。 考虑到 ``/opt/stack`` 中的项目已经同步到其各自的git仓库中，因此您可以配置 `git review <https://docs.openstack.org/contributors/code-and-documentation/using-gerrit.html>`_ , 提交您的更改并将更改上传到Gerrit。

source: Once you have your ``local.conf`` file configured executing DevStack is quite easy.
de: Sobald Sie Ihre ``local.conf`` Datei konfiguriert haben, ist es ganz einfach, DevStack auszuführen.
id: Setelah Anda memiliki file ``local.conf`` Anda yang dikonfigurasikan saat menjalankan DevStack cukup mudah.
ko_kr: 구성된 ``local.conf`` 파일이 있다면 DevStack을 실행하는 것은 매우 쉽습니다.
zh_cn: 一旦配置了 ``local.conf`` 文件，执行DevStack是非常容易的。

source: Once you've constructed a query and checked in on elastic-search you should create a yaml file in the queries directory of the elastic-recheck git repo. The file name is the launchpad bug number for the bug and the contents are the elastic-search query.
de: Sobald Sie eine Abfrage erstellt und bei der elastischen Suche eingecheckt haben, sollten Sie eine yaml-Datei im queries-Verzeichnis des elastic-recheck git repo erstellen. Der Dateiname ist die Launchpad-Bugnummer für den Bug und der Inhalt ist die elastische Suchanfrage.
id: Setelah Anda membuat kueri dan memeriksa elastic-search, Anda harus membuat file yaml di direktori kueri repo git elastic-rechecki. Nama file adalah nomor bug launchpad untuk bug dan isinya adalah permintaan elastic-recheck.
ko_kr: 쿼리를 구성하고 엘라스틱서치에 체크인 한 후에는 elastic-recheck 깃 레포지토리의 쿼리 디렉터리에 yaml 파일을 만들어야합니다. 파일 이름은 버그의 런치 패드 버그 번호이고 내용은 엘라스틱서치 쿼리입니다.

source: Once you've identified a message in the logs that can be used for fingerprinting you need to turn that into an elastic-search query. You can use any of the existing fingerprints as an example: `opendev/elastic-recheck <https://opendev.org/opendev/elastic-recheck/src/queries>`_
id: Setelah Anda mengidentifikasi pesan dalam log yang dapat digunakan untuk sidik jari, Anda harus mengubahnya menjadi permintaan pencarian elastis. Anda dapat menggunakan salah satu sidik jari yang ada sebagai contoh: `opendev/elastic-recheck <https://opendev.org/opendev/elastic-recheck/src/queries>` _
ko_kr: 지문 감식에 사용할 수있는 로그에서 메시지를 식별 한 후에는 이를 엘라스틱서치 검색 쿼리로 전환해야합니다. 기존 지문 중 하나를 예로 사용할 수 있습니다. `opendev/elastic-recheck <https://opendev.org/opendev/elastic-recheck/src/queries>`_

source: Once your changes have been saved to local.conf you are ready to deploy an OpenStack cloud with DevStack.
de: Sobald Ihre Änderungen in local.conf gespeichert wurden, können Sie eine OpenStack-Cloud mit DevStack bereitstellen.
id: Setelah perubahan Anda disimpan ke local.conf, Anda siap untuk deploy (mengerahkan) cloud OpenStack dengan DevStack.
ko_kr: 변경 사항이 local.conf 에 저장되었다면 OpenStack 클라우드를 DevStack으로 배포할 준비가 된 것입니다.
zh_cn: 一旦将更改保存到 ``local.conf`` 后，就可以使用DevStack部署OpenStack云了。

source: Only the person that voted the -2 can remove the vote and it will persist on all new patchsets.
de: Nur die Person, die für die -2 gestimmt hat, kann die Stimme entfernen und sie bleibt bei allen neuen Patchsets bestehen.
id: Hanya orang yang memilih -2 yang dapat menghapus suara dan itu akan tetap ada pada semua patchset baru.
ko_kr: -2를 투표한 사람만이 투표를 제거할 수 있으며 모든 새로운 패치 집합에서 계속됩니다.
zh_cn: 只有投票了“-2”的人才能删除投票，并且投票将保留在所有新补丁集上。

source: OpenStack Documentation Contributor Guide
de: OpenStack Dokumentation Mitwirkender Leitfaden
id: Panduan Kontributor Dokumentasi OpenStack
ko_kr: OpenStack 설명서 기여자 안내서
zh_cn: OpenStack文档贡献者指南

source: OpenStack uses Gerrit to propose and review the code.
ko_kr: OpenStack은 Gerrit를 사용하여 코드를 제안하고 리뷰합니다.

source: Patch Chains
de: Patchketten
id: Rantai patch
ko_kr: 패치 체인
zh_cn: 补丁链

source: Patch Chains, Depends-On Tag and Gerrit Topics
de: Patchketten, Depends-On-Tag und Gerrit-Topics
id: Patch Chains, Depends-On Tag dan Gerrit Topics
ko_kr: 패치 체인, 의존 태그 및 Gerrit 주제들
zh_cn: 补丁链，Depends-On标签和Gerrit标题

source: Practice the workflow using Sandbox Project
ko_kr: Sandbox Project를 사용하여 워크플로우 연습하기

source: Project services are all registered with systemd. Each service is prefixed with ``devstack@``. Therefore you may verify through systemd that the Cinder Volume process is working with a command like:
de: Die Projektdienste sind alle bei systemd registriert. Jedem Dienst ist ein Präfix mit ``devstack@``` vorangestellt. Daher können Sie durch systemd überprüfen, ob der Cinder Volume Prozess mit einem Befehl wie diesem arbeitet:
id: Layanan proyek semuanya terdaftar dengan systemd. Setiap layanan diawali dengan ``devstack@``. Karena itu Anda dapat memverifikasi melalui systemd bahwa proses Cinder Volume bekerja dengan perintah seperti:
ko_kr: 프로젝트 서비스들은 모두 systemd에 등록됩니다. 각 서비스는 ``devstack@`` 으로 앞에 붙습니다. 따라서 Cinder Volume 프로세스가 동작하는지를 systemd를 통해 검증하고 싶다면 다음과 같은 명령어를 사용하여 작업할 수 있습니다:
zh_cn: 项目服务都已在systemd中注册。 每个服务都以 ``devstack @`` 为前缀。 因此，您可以通过systemd使用以下命令验证Cinder Volume进程是否正在运行：

source: Publishing documents in project repositories
ko_kr: 프로젝트 저장소에 문서 게시
zh_cn: 发布项目仓库中的文档

source: Push your change
ko_kr: 변경 사항을 푸시하기

source: Push your change and review :doc:`using-gerrit`
ko_kr: 변경 사항을 푸시하고 리뷰하십시오 :doc:`using-gerrit`

source: Pushing A Change
de: Eine Änderung vorantreiben
id: Mendorong Perubahan
ko_kr: 변경사항을 푸시하고 있습니다.
zh_cn: 推进一个更改

source: Quick Start
ko_kr: 빠른 시작

source: Read the `Summary of Git commit message structure <https://wiki.openstack.org/wiki/GitCommitMessages?%22Summary%20of%20Git%20commit%20message%20structure%22#Summary_of_Git_commit_message_structure>`_ for best practices on writing the commit message. When you are ready to send your changes for review use::
de: Lesen Sie die `Zusammenfassung der Git Commit-Nachrichtenstruktur <https://wiki.openstack.org/wiki/GitCommitMessages?%22Summary%20of%20Git%20commit%20message%20structure%22#Summary_of_Git_commit_message_structure>``_ für Best Practices beim Schreiben der Commit-Nachricht. Wenn Sie bereit sind, Ihre Änderungen zur Überprüfung zu senden, verwenden Sie::
id: Membaca `Summary of Git commit message structure <https://wiki.openstack.org/wiki/GitCommitMessages?%22Summary%20of%20Git%20commit%20message%20structure%22#Summary_of_Git_commit_message_structure>`_ untuk praktik terbaik dalam menulis pesan komit. Saat Anda siap mengirim perubahan untuk ulasan use::
ko_kr: 커밋 메시지 작성에 대한 모범 사례는 `Git commit 메시지 구조 요약 <https://wiki.openstack.org/wiki/GitCommitMessages?%22Summary%20of%20Git%20commit%20message%20structure%22#Summary_of_Git_commit_message_structure>`_ 을 읽습니다. 검토를 위해 변경사항을 보낼 준비가 되면 다음을 수행합니다.
zh_cn: 阅读 `Summary of Git commit message structure <https://wiki.openstack.org/wiki/GitCommitMessages?%22Summary%20of%20Git%20commit%20message%20structure%22#Summary_of_Git_commit_message_structure>`_ 以获取编写提交消息的最佳实践。 当您准备好将您的更改发送以供审核时使用时：

source: Reference documents
ko_kr: 참조 문서
zh_cn: 参考文档

source: Removal of .pyc files
de: Entfernen von .pyc-Dateien
id: Penghapusan file .pyc
ko_kr: .pyc 파일들을 제거
zh_cn: 删除.pyc文件

source: Removing configuration files for projects from /etc
de: Entfernen von Konfigurationsdateien für Projekte aus /etc
id: Menghapus file konfigurasi untuk proyek dari /etc
ko_kr: /etc에 있는 프로젝트 설정 파일 제거하기
zh_cn: 从/etc删除项目的配置文件

source: Removing log files
de: Protokolldateien entfernen
id: Menghapus file log
ko_kr: 로그 파일들 제거하기
zh_cn: 删除日志文件

source: Report recurring bugs so that you don't need to manually 'recheck'
de: Melden Sie wiederkehrende Fehler, damit Sie nicht manuell "erneut prüfen" müssen.
id: Laporkan bug berulang sehingga Anda tidak perlu 'recheck' secara manual
ko_kr: 수동으로 `재확인` 할 필요가 없도록 반복되는 버그를 보고합니다.
zh_cn: 报告重复出现的错误，是的您无需手动'重新检查'

source: Request reviews from specific community members
de: Beantragung von Bewertungen von bestimmten Community-Mitgliedern
id: Minta ulasan dari anggota komunitas tertentu
ko_kr: 특정 커뮤니티 구성원에게 검토를 요청합니다.
zh_cn: 请求指定社区成员的审核

source: Required packages (like mysql and rabbitmq) are installed
de: Erforderliche Pakete (wie mysql und rabbitmq) werden installiert.
id: Paket yang diperlukan (seperti mysql dan rabbitmq) diinstal
ko_kr: 필수 패키지 (mysql 및 rabbitmq 등) 설치가 이루어집니다
zh_cn: 安装必需的软件包（例如mysql和rabbitmq）

source: Reviewing Changes
de: Überprüfen von Änderungen
id: Meninjau Perubahan
ko_kr: 변경 내용을 검토
zh_cn: 审阅更改

source: Reviewing changes is often suggested as a way to get started on a project. Whether this is how you choose to get started or not, it's an important community activity. See `How to Review Changes the OpenStack Way <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html>`_ for more detailed guidance on when to use which votes on a change review.
id: Meninjau perubahan sering disarankan sebagai cara untuk memulai suatu proyek. Apakah ini cara Anda memilih untuk memulai atau tidak, ini merupakan kegiatan komunitas yang penting. Lihat `How to Review Changes the OpenStack Way <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html>` _ untuk panduan lebih rinci tentang kapan menggunakan vote dimana pada change review (ulasan perubahan).
ko_kr: 프로젝트에서 시작하는 방법으로 변경 사항을 검토하는 것이 권장되는 경우가 많습니다. 이렇게 시작하든 말든 중요한 공동체 활동입니다. 변경 검토 시 어떤 표를 사용해야 하는지에 대한 자세한 지침은 `OpenStack Way 변경 검토 방법 <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html>`_ 을 참조하시기 바랍니다.
zh_cn: 审阅更改通常被建议为开始项目的一种方法。 无论您是选择开始还是不选择，这都是一项重要的社区活动。 请参阅 `How to Review Changes the OpenStack Way <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html>`_ 以获取有关何时在审阅更改中使用哪种投票的更详细指导。

source: Reviewing large patches is very inconvenient and time consuming therefore we always suggest to break down your changes into smaller blocks.
de: Die Überprüfung großer Patches ist sehr unangenehm und zeitaufwendig, daher empfehlen wir immer, Ihre Änderungen in kleinere Blöcke aufzuteilen.
id: Meninjau patch besar sangat merepotkan dan makan waktu karena itu kami selalu menyarankan untuk memecah perubahan Anda menjadi blok yang lebih kecil.
ko_kr: 큰 패치를 검토하는 것은 매우 불편하고 시간이 많이 걸리므로, 항상 변경사항을 작은 블록단위로 나누는 것이 좋습니다.
zh_cn: 审核大型补丁非常不方便且耗时，因此我们始终建议您将变更分解为较小的补丁。

source: Running ``unstack.sh`` is the first thing to try in the case that a DevStack run fails. If subsequent runs fail a more thorough removal of DevStack components may be done with the following command:
id: Menjalankan ``unstack.sh`` adalah hal pertama yang harus dicoba jika DevStack run gagal. Jika proses selanjutnya gagal, penghapusan komponen DevStack yang lebih menyeluruh dapat dilakukan dengan perintah berikut:
ko_kr: DevStack 실행이 실패한 경우 가장 먼저 ``unstack.sh`` 를 실행합니다. 후속 실행이 실패하면 다음 명령을 사용하여 DevStack 구성 요소를 보다 철저히 제거 할 수 있습니다.
zh_cn: 在DevStack运行失败的情况下，首先要尝试运行 ``unstack.sh`` 。 如果后续运行失败，则可以使用以下命令更彻底地删除DevStack组件：

source: Sandbox Git Repository
ko_kr: Sandbox Git Repository입니다.
zh_cn: 沙箱Git仓库

source: Sandbox Project on Launchpad
id: Sandbox Project pada Launchpad
ko_kr: Launchpad의 Sandbox Project
zh_cn: Launchpad上的沙箱项目

source: Sandbox Project on StoryBoard
de: Sandbox-Projekt auf StoryBoard
id: Proyek Sandbox di StoryBoard
ko_kr: 스토리보드의 샌드박스 프로젝트
zh_cn: 在StoryBoard上的沙箱项目

source: Save and quit the editor, and I see:
id: Simpan dan keluar dari editor, dan saya melihat:
ko_kr: 편집기를 저장한 후 종료하면 다음이 나타납니다.
zh_cn: 保存并退出编辑器，我会看到：

source: Set to 'true' all document options that apply. For example::
ko_kr: 적용되는 모든 문서 옵션을 'true'로 설정하십시오. 예를 들어 다음과 같습니다.
zh_cn: 将所有适用的文档选项设置为'true'。 例如::

source: Set up accounts and configure environment
ko_kr: 계정 설정 및 환경 구성

source: Since systemd accepts wildcards, the status of all services associated with DevStack can be displayed with:
de: Da das System Wildcards akzeptiert, kann der Status aller mit DevStack verbundenen Dienste angezeigt werden:
id: Karena systemd menerima wildcard, status semua layanan yang terkait dengan DevStack dapat ditampilkan dengan:
ko_kr: systemd는 와일드카드(*)를 허용하기에, DevStack과 관련된 모든 서비스에 대한 상태는 다음과 같이 보여지도록 할 수 있습니다:
zh_cn: 由于systemd接受通配符，因此与DevStack关联的所有服务的状态都可以显示为：

source: So let's say I make an edit for my first patch and commit it:
id: Jadi katakanlah saya melakukan edit untuk patch pertama saya dan melakukan itu:
ko_kr: 첫 번째 패치를 편집하여 커밋한다고 가정해 보겠습니다.
zh_cn: 假设我对第一个补丁进行了编辑并提交：

source: Sometimes there might be people you need to weigh in on your patch because they have a vested interest or are helping mentor you. The easiest way of letting them know you have uploaded a new patch or patchset is to add them as reviewers in the gerrit web-ui. You can look them up by name, gerrit email address, ssh user name, or gerrit id.
de: Manchmal kann es Menschen geben, die Sie auf Ihren Patch einbeziehen möchten, weil sie ein persönliches Interesse haben oder Ihnen als Mentor helfen. Der einfachste Weg, sie wissen zu lassen, dass Sie einen neuen Patch oder ein neues Patchset hochgeladen hast, ist, sie als Reviewer im gerrit web-ui hinzuzufügen. Sie können sie nach Namen, gerrit E-Mail-Adresse, ssh-Benutzername oder gerrit-ID durchsuchen.
id: Terkadang mungkin ada orang yang perlu Anda pertimbangkan di patch Anda karena mereka memiliki minat pribadi atau membantu mentor Anda. Cara termudah untuk memberi tahu mereka bahwa Anda telah mengunggah patch atau patch baru adalah dengan menambahkannya sebagai pengulas di gerrit web-ui. Anda dapat mencarinya berdasarkan nama, alamat email gerrit, nama pengguna ssh, atau id gerrit.
ko_kr: 때로는 기득권이 있거나 멘토링을 도와주기 때문에 패치를 따져봐야 할 사람들이 있을 수 있습니다. 사용자가 새 패치 또는 패치 세트를 업로드했음을 알리는 가장 쉬운 방법은 게리트 웹 UI에서 검토자로 추가하는 것입니다. 이름, 게리트 이메일 주소, ssh 사용자 이름 또는 게리트 ID로 검색할 수 있습니다.
zh_cn: 有时候，您可能需要有人帮助权衡您的补丁，因为他们有相关的关键考量或正处于帮助指导您开发基础的阶段。 让他们知道您已上传新补丁或补丁集的最简单方法是将他们添加为gerrit web-ui中的审阅者（reviewer）。 您可以通过名字，gerrit电子邮件地址，ssh用户名或gerrit ID来查找它们。

source: Start on a freshly-``pull``\ed master branch:
id: Mulai dari cabang master freshly-``pull``\ed:
ko_kr: 마스터 브랜치에서 ``pull``\ed 을 뽑아서 시작합니다
zh_cn: 从一个新 ``pull`` 出来的主分支开始：

source: Stopping DevStack
de: Stoppen von DevStack
id: Menghentikan DevStack
ko_kr: DevStack 중지하기
zh_cn: 停止DevStack

source: Stopping the project services, mysql and rabbitmq
de: Einstellung der Projektdienste, mysql und rabbitmq
id: Menghentikan layanan proyek, mysql dan rabbitmq
ko_kr: 프로젝트 서비스, mysql 그리고 rabbitmq 중지하기
zh_cn: 停止项目服务，mysql和rabbitmq

source: Structural split of Changes
ko_kr: 변경 사항을 구조적으로 분할

source: Testing Changes with DevStack
de: Änderungen mit DevStack testen
id: Testing Changes dengan DevStack
ko_kr: DevStack으로 변경 사항 테스팅하기
zh_cn: 使用DevStack测试更改

source: The 'Depends-On' tag is a marker on your changes and when used a patch cannot be merged until all its dependencies are landed.
de: Das 'Depends-On' Tag ist ein Marker für Ihre Änderungen und bei Verwendung kann ein Patch erst dann zusammengeführt werden, wenn alle seine Abhängigkeiten gelandet sind.
id: Tag 'Depends-On' adalah penanda pada perubahan Anda dan ketika digunakan patch tidak dapat digabungkan hingga semua dependensinya mendarat (landed).
ko_kr: 'Depends-On' 태그는 변경 사항에 대한 마커로, 사용시 모든 종속성이 떨어질 때까지 패치를 병합 할 수 없습니다.
zh_cn: 'Depends-On'标签是您所做更改的标记，当使用标签时，除非提交更改的所有依赖项均已获得，否则补丁将无法合并。

source: The OpenStack Services are registered and started
de: Die OpenStack-Dienste sind registriert und werden gestartet.
id: Layanan OpenStack terdaftar dan dimulai
ko_kr: OpenStack 서비스들이 등록 및 시작됩니다
zh_cn: 注册并启动OpenStack服务

source: The OpenStack projects are cloned into /opt/stack/
de: Die OpenStack-Projekte werden in /opt/stack/ geklont.
id: Proyek OpenStack dikloning ke /opt/stack/
ko_kr: OpenStack 프로젝트가 /opt/stack으로 클론됩니다
zh_cn: 克隆OpenStack项目到/opt/stack/

source: The Right Content
de: Der richtige Inhalt
id: Konten yang Tepat
ko_kr: 올바른 컨텐츠
zh_cn: 合适的内容

source: The Right Size
de: Die richtige Größe
id: Ukuran yang Tepat
ko_kr: 적절한 크기
zh_cn: 合适的大小

source: The Sandbox repository and projects are maintained by community members with occasional cleanup. Please help us with the housekeeping and clean up your work, when you are finished with your practice and feel comfortable using the tool.
de: Das Sandbox-Repository und die Projekte werden von Community-Mitgliedern mit gelegentlichen Bereinigungen gepflegt. Bitte helfen Sie uns bei der Hauswirtschaft und reinigen Sie Ihre Arbeit, wenn Sie mit Ihrer Praxis fertig sind und sich mit dem Werkzeug wohlfühlen.
id: Repositori dan proyek Sandbox dikelola oleh anggota masyarakat dengan pembersihan sesekali. Tolong bantu kami dengan tata housekeeping dan membersihkan pekerjaan Anda, ketika Anda selesai dengan latihan Anda dan merasa nyaman menggunakan alat ini.
ko_kr: 샌드박스 리포지토리 및 프로젝트는 커뮤니티 구성원에 의해 유지 관리되며, 가끔 정리됩니다. 연습이 끝나고 도구 사용이 편할 때 하우스키핑과 작업 정리를 도와주시기 바랍니다.
zh_cn: 沙箱仓库（Sandbox Repo）和项目由社区成员维护，并偶尔进行清理。 完成练习后，请帮助我们在完整这些实践练习并感觉会用这些工具了以后进行环境整理并清理您的工作。

source: The `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`_ describes how to contribute to OpenStack documentation. It contains information on `writing <https://docs.openstack.org/doc-contrib-guide/writing-docs.html>`_, `building <https://docs.openstack.org/doc-contrib-guide/docs-builds.html>`_, and `reviewing <https://docs.openstack.org/doc-contrib-guide/docs-review.html>`_ documents, as well as best practices and `API documentation guidelines <https://docs.openstack.org/doc-contrib-guide/api-guides.html>`_.
id: The `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`_ menjelaskan cara berkontribusi pada dokumentasi OpenStack. Ini berisi informasi tentang dokumen `writing <https://docs.openstack.org/doc-contrib-guide/writing-docs.html>`_, `building <https://docs.openstack.org/doc-contrib-guide/docs-builds.html>`_, and `reviewing <https://docs.openstack.org/doc-contrib-guide/docs-review.html>`_, serta praktik terbaik dan `API documentation guidelines <https://docs.openstack.org/doc-contrib-guide/api-guides.html>`_.
ko_kr: `OpenStack 설명서 기여자 가이드 <https://docs.openstack.org/doc-contrib-guide/index.html>`_ 에는 OpenStack 설명서에 기여하는 방법이 설명되어 있습니다. `writing <https://docs.openstack.org/doc-contrib-guide/writing-docs.html>`_ , `빌딩 <https://docs.openstack.org/doc-contrib-guide/docs-builds.html> `_ , `리뷰 <https://docs.openstack.org/doc-contrib-guide/docs-review.html>`_ 등의 문서 작성에 관한 정보뿐만 아니라, 베스트 프랙티스와 `API 문서 가이드라인 <https://docs.openstack.org/doc-contrib-guide/api-guides.html>`_ 도 수록되어 있습니다.
zh_cn: `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`_ 描述了如何为OpenStack文档做出贡献。 它包含有关如何 `writing <https://docs.openstack.org/doc-contrib-guide/writing-docs.html>`_, `building <https://docs.openstack.org/doc-contrib-guide/docs-builds.html>`_, 和 `reviewing <https://docs.openstack.org/doc-contrib-guide/docs-review.html>`_ 文档的相关信息，以及最佳做法和 `API documentation guidelines <https://docs.openstack.org/doc-contrib-guide/api-guides.html>`_ 。

source: The ``admin`` password will be set to the value you put in your ``local.conf`` file for ``ADMIN_PASSWORD``
de: Das Passwort für ``admin`` wird auf den Wert gesetzt, den Sie in Ihrer `local.conf`` Datei für ``ADMIN_PASSWORD`` eingestellt haben.
id: Kata sandi ``admin`` akan ditetapkan ke nilai yang Anda masukkan dalam file ``local.conf`` Anda untuk ``ADMIN_PASSWORD``
ko_kr: ``admin`` (사용자에 대한) 패스워드는 ``local.conf`` 파일에 ``ADMIN_PASSWORD`` 로 지정한 값으로 설정될 것입니다

source: The ``cli`` directory contains command line tool reference documentation which can be automatically generated with cliff’s sphinx integration, or manually written when auto-generation is not possible. For more information, see `cliff Sphinx Integration`_.
ko_kr: ``cli`` 디렉토리에는 cliff's sphinx integration으로 자동 생성되거나 자동 생성이 불가능할 때 수동으로 작성할 수있는 명령 도구 참조 문서가 포함되어 있습니다. 자세한 내용은 `cliff Sphinx Integration`_ 을 참조하세요.
zh_cn: ``cli`` 目录包含命令行工具参考文档，这些文档可以通过cliff的sphinx集成自动生成，或者在无法自动生成时手动编写。 有关更多信息，请参见 `cliff Sphinx Integration`_ 。

source: The ``configuration`` directory contains configuration reference information that is either automatically generated (if the project uses ``oslo.config``) or manually written (if ``oslo.config`` is not used). For more information, see `Sphinx Integration`_.
ko_kr: ``configuration`` 디렉토리에는 자동으로 생성되거나 (프로젝트가 ``oslo.config`` 를 사용하는 경우) 수동으로 작성되는 (``oslo.config`` 가 사용되지 않는 경우) 구성 참조 정보가 포함됩니다. 자세한 내용은 `Sphinx Integration`_ 을 참조하십시오.
zh_cn: ``configuration`` 目录包含配置参考信息，这些信息可以自动生成（如果项目使用 ``oslo.config`` ）或手动编写（如果不使用 ``oslo.config`` ）。 有关更多信息，请参见 `Sphinx Integration`_ 。

source: The ``reference`` directory contains reference information not included in the other directories, for instance, automatically generated class documentation in library projects.
ko_kr: ``reference`` 디렉토리에는 다른 디렉토리에 포함되지 않은 참조 정보 (예 : 라이브러리 프로젝트에서 자동 생성 된 클래스 문서)가 포함되어 있습니다.
zh_cn: ``reference`` 目录包含其他目录中未包含的参考信息，例如库项目中自动生成的类文档。

source: The ``user`` directory contains information targeted at end-users, for instance, concept guides, tutorials, step-by-step instructions for using the CLI or the project's API, and such.
ko_kr: ``user`` 디렉토리에는 개념 가이드, 튜토리얼, CLI 또는 프로젝트의 API 사용에 대한 단계별 지침 등 최종 사용자를 대상으로하는 정보가 포함되어 있습니다.
zh_cn: ``user`` 目录包含针对最终用户的信息，例如概念指南，教程，使用CLI或项目API的分步说明等。

source: The above command and subsequent command examples assume you are still in the root directory of your DevStack clone.
de: Der obige Befehl und die nachfolgenden Befehlsbeispiele gehen davon aus, dass Sie sich noch im Stammverzeichnis Ihres DevStack-Klons befinden.
id: Perintah di atas dan contoh-contoh perintah selanjutnya menganggap Anda masih berada di direktori root klon DevStack Anda.
ko_kr: 위 명령어 및 부차적인 명령 예제들은 DevStack을 클론한 루트 디렉토리에 위치해 있다고 가정합니다.
zh_cn: 以上命令和后续命令示例假定您仍位于DevStack克隆的根目录下。

source: The admin guide can be found in the ``admin`` directory. It contains information on the configuration and operation of the software. The project's administrator guide is included in the `OpenStack Administrator Guides`_.
ko_kr: 관리자 가이드는 ``admin`` 디렉토리에서 찾을 수 있습니다. 여기에는 소프트웨어의 구성과 작동에 대한 정보가 포함되어 있습니다. 프로젝트 관리자 가이드는 `OpenStack Administrator Guides`_ 에 포함되어 있습니다.
zh_cn: 管理员指南可以在 ``admin`` 目录中找到。 它包含有关软件配置和操作的信息。 项目的管理员指南包含在 `OpenStack Administrator Guides`_ 中。
